[Killed] LogicalOperator
helpers/type/isEmpty.ts:44:7
  * @since 2.0.0
  */
 export function isEmpty(value: unknown): value is null | undefined | '' | never[] | ReadonlyMap<never, never> | ReadonlySet<never> {
-  if (value === null || value === undefined) {
+  if (value === null && value === undefined) {
     return true;
   }
killedBy: isEmpty should treat null and undefined as empty
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
helpers/type/isEmpty.ts:44:7
  * @since 2.0.0
  */
 export function isEmpty(value: unknown): value is null | undefined | '' | never[] | ReadonlyMap<never, never> | ReadonlySet<never> {
-  if (value === null || value === undefined) {
+  if (value !== null || value === undefined) {
     return true;
   }
killedBy: isEmpty should treat null and undefined as empty
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
helpers/type/isEmpty.ts:52:29
     return value.length === 0;
   }
 
-  if (Array.isArray(value)) {
-    return value.length === 0;
-  }
+  if (Array.isArray(value)) {}
 
   if (value instanceof Map || value instanceof Set) {
killedBy: isEmpty should handle arrays
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isEmpty.ts:53:12
   }
 
   if (Array.isArray(value)) {
-    return value.length === 0;
+    return value.length !== 0;
   }
 
killedBy: isEmpty should handle arrays
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:56:7
     return value.length === 0;
   }
 
-  if (value instanceof Map || value instanceof Set) {
+  if (true) {
     return value.size === 0;
   }
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isEmpty.ts:56:53
     return value.length === 0;
   }
 
-  if (value instanceof Map || value instanceof Set) {
-    return value.size === 0;
-  }
+  if (value instanceof Map || value instanceof Set) {}
 
   if (typeof value === 'object') {
killedBy: isEmpty should handle Map and Set
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:57:12
   }
 
   if (value instanceof Map || value instanceof Set) {
-    return value.size === 0;
+    return true;
   }
 
killedBy: isEmpty should handle Map and Set
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:60:7
     return value.size === 0;
   }
 
-  if (typeof value === 'object') {
+  if (false) {
     if (isSpecialObject(value)) {
       return false;
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
helpers/type/isEmpty.ts:61:9
   }
 
   if (typeof value === 'object') {
-    if (isSpecialObject(value)) {
+    if (false) {
       return false;
     }

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:66:9
     }
 
     const proto = Object.getPrototypeOf(value);
-    if (proto !== Object.prototype && proto !== null) {
+    if (false) {
       return false;
     }
killedBy: isEmpty should return false for special objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isEmpty.ts:70:12
       return false;
     }
 
-    return Object.keys(value as Record<string, unknown>).length === 0;
+    return Object.keys(value as Record<string, unknown>).length !== 0;
   }
 
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality
