[Killed] StringLiteral
helpers/string/escapeHtml.ts:10:8
 /** Map of characters that must be escaped in HTML. */
 const HTML_ESCAPES: Record<string, string> = {
   '&': '&amp;',
-  '<': '&lt;',
+  '<': "",
   '>': '&gt;',
   '"': '&quot;',
killedBy: escapeHtml escapes <
statusReason: expected 'div&gt;' to be '&lt;div&gt;' // Object.is equality

[Killed] StringLiteral
helpers/string/escapeHtml.ts:11:8
 const HTML_ESCAPES: Record<string, string> = {
   '&': '&amp;',
   '<': '&lt;',
-  '>': '&gt;',
+  '>': "",
   '"': '&quot;',
   "'": '&#39;',
killedBy: escapeHtml escapes <
statusReason: expected '&lt;div' to be '&lt;div&gt;' // Object.is equality

[Killed] StringLiteral
helpers/string/escapeHtml.ts:12:8
   '&': '&amp;',
   '<': '&lt;',
   '>': '&gt;',
-  '"': '&quot;',
+  '"': "",
   "'": '&#39;',
 };
killedBy: escapeHtml escapes double quotes
statusReason: expected 'hello' to be '&quot;hello&quot;' // Object.is equality

[Killed] BlockStatement
helpers/string/escapeHtml.ts:34:49
  * // "It&#39;s a &lt;test&gt; &amp; more"
  * @since next
  */
-export function escapeHtml(str: string): string {
-  return str.replace(HTML_ESCAPE_REGEX, (char) => HTML_ESCAPES[char] as string);
-}
+export function escapeHtml(str: string): string {}
 
killedBy: escapeHtml escapes &
statusReason: expected undefined to be 'a &amp; b' // Object.is equality

[Killed] ArrowFunction
helpers/string/escapeHtml.ts:35:41
  * @since next
  */
 export function escapeHtml(str: string): string {
-  return str.replace(HTML_ESCAPE_REGEX, (char) => HTML_ESCAPES[char] as string);
+  return str.replace(HTML_ESCAPE_REGEX, () => undefined);
 }
 
killedBy: escapeHtml escapes &
statusReason: expected 'a undefined b' to be 'a &amp; b' // Object.is equality
