[Killed] ConditionalExpression
helpers/type/isPrimitive.ts:29:10
  * @since 2.0.0
  */
 export function isPrimitive(value: unknown): value is Primitive {
-  return value === null || (typeof value !== 'object' && typeof value !== 'function');
+  return false;
 }
 
killedBy: isPrimitive — property-based isPrimitive(v) → !isPlainObject(v)
statusReason: Property failed after 1 tests
{ seed: 576721071, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
