[Killed] BlockStatement
helpers/array/cartesianProduct.ts:25:39
  */
 export function cartesianProduct<T extends readonly (readonly unknown[])[]>(
   ...arrays: T
-): { [K in keyof T]: T[K][number] }[] {
-  if (arrays.length === 0) return [];
-  return arrays.reduce<unknown[][]>(
-    (acc, arr) => acc.flatMap((combo) => arr.map((item) => [...combo, item])),
-    [[]],
-  ) as { [K in keyof T]: T[K][number] }[];
-}
+): { [K in keyof T]: T[K][number] }[] {}
 
killedBy: cartesianProduct (property-based) result length equals product of input lengths
statusReason: Property failed after 1 tests
{ seed: -1218880856, path: "0:0:0", endOnFailure: true }
Counterexample: [[[0]]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/cartesianProduct.ts:26:7
 export function cartesianProduct<T extends readonly (readonly unknown[])[]>(
   ...arrays: T
 ): { [K in keyof T]: T[K][number] }[] {
-  if (arrays.length === 0) return [];
+  if (false) return [];
   return arrays.reduce<unknown[][]>(
     (acc, arr) => acc.flatMap((combo) => arr.map((item) => [...combo, item])),
killedBy: cartesianProduct returns empty array when no arrays are provided
statusReason: expected [ [] ] to deeply equal []

[Killed] ConditionalExpression
helpers/array/cartesianProduct.ts:26:7
 export function cartesianProduct<T extends readonly (readonly unknown[])[]>(
   ...arrays: T
 ): { [K in keyof T]: T[K][number] }[] {
-  if (arrays.length === 0) return [];
+  if (true) return [];
   return arrays.reduce<unknown[][]>(
     (acc, arr) => acc.flatMap((combo) => arr.map((item) => [...combo, item])),
killedBy: cartesianProduct (property-based) result length equals product of input lengths
statusReason: Property failed after 1 tests
{ seed: 2074779857, path: "0:0:0", endOnFailure: true }
Counterexample: [[[0]]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
