[Killed] BlockStatement
helpers/array/chunk.ts:14:59
  * @returns Array of chunks
  * @since 1.9.0
  */
-export function chunk<T>(array: T[], size: number): T[][] {
-  if (size <= 0) return [];
-  const result: T[][] = [];
-  for (let i = 0; i < array.length; i += size) {
-    result.push(array.slice(i, i + size));
-  }
-  return result;
-}
+export function chunk<T>(array: T[], size: number): T[][] {}
 
killedBy: chunk — property-based all chunks have length <= size
statusReason: Property failed after 1 tests
{ seed: -1752653191, path: "0:0", endOnFailure: true }
Counterexample: [[],1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/chunk.ts:15:7
  * @since 1.9.0
  */
 export function chunk<T>(array: T[], size: number): T[][] {
-  if (size <= 0) return [];
+  if (size > 0) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {
killedBy: chunk — property-based concatenation of chunks equals original array
statusReason: Property failed after 1 tests
{ seed: 2044684551, path: "0:1:1:1", endOnFailure: true }
Counterexample: [[0],1]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/chunk.ts:15:7
  * @since 1.9.0
  */
 export function chunk<T>(array: T[], size: number): T[][] {
-  if (size <= 0) return [];
+  if (true) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {
killedBy: chunk — property-based concatenation of chunks equals original array
statusReason: Property failed after 1 tests
{ seed: 1409590128, path: "0:1:0:0:1:1", endOnFailure: true }
Counterexample: [[0],1]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/chunk.ts:17:48
 export function chunk<T>(array: T[], size: number): T[][] {
   if (size <= 0) return [];
   const result: T[][] = [];
-  for (let i = 0; i < array.length; i += size) {
-    result.push(array.slice(i, i + size));
-  }
+  for (let i = 0; i < array.length; i += size) {}
   return result;
 }
killedBy: chunk — property-based concatenation of chunks equals original array
statusReason: Property failed after 1 tests
{ seed: -1209592116, path: "0:1:1:1", endOnFailure: true }
Counterexample: [[0],1]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/chunk.ts:17:19
 export function chunk<T>(array: T[], size: number): T[][] {
   if (size <= 0) return [];
   const result: T[][] = [];
-  for (let i = 0; i < array.length; i += size) {
+  for (let i = 0; false; i += size) {
     result.push(array.slice(i, i + size));
   }
killedBy: chunk — property-based concatenation of chunks equals original array
statusReason: Property failed after 1 tests
{ seed: 194374095, path: "0:1:1:1", endOnFailure: true }
Counterexample: [[0],1]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/array/chunk.ts:18:17
   if (size <= 0) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {
-    result.push(array.slice(i, i + size));
+    result.push(array);
   }
   return result;
killedBy: chunk — property-based all chunks have length <= size
statusReason: Property failed after 1 tests
{ seed: 1300548520, path: "0:1:0:1:2", endOnFailure: true }
Counterexample: [[0,0],1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/array/chunk.ts:18:32
   if (size <= 0) return [];
   const result: T[][] = [];
   for (let i = 0; i < array.length; i += size) {
-    result.push(array.slice(i, i + size));
+    result.push(array.slice(i, i - size));
   }
   return result;
killedBy: chunk — property-based all chunks have length <= size
statusReason: Property failed after 42 tests
{ seed: -281149089, path: "41:1:2:5:7:9:10:10:0", endOnFailure: true }
Counterexample: [[0,0,0],1]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
