[Killed] BlockStatement
helpers/array/compact.ts:18:80
  * // => [1, 2, 3]
  * @since 2.0.0
  */
-export function compact<T>(array: readonly (T | Falsy)[]): Exclude<T, Falsy>[] {
-  return array.filter(v => !isFalsy(v)) as Exclude<T, Falsy>[];
-}
+export function compact<T>(array: readonly (T | Falsy)[]): Exclude<T, Falsy>[] {}
 
killedBy: compact — property-based result contains only truthy values
statusReason: Property failed after 1 tests
{ seed: 1335004786, path: "0", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
