[Killed] BlockStatement
helpers/array/difference.ts:14:62
  * @returns Array with items from first array not present in second array
  * @since 1.9.0
  */
-export function difference<T>(array1: T[], array2: T[]): T[] {
-  const set2 = new Set(array2);
-  return array1.filter(item => !set2.has(item));
-}
+export function difference<T>(array1: T[], array2: T[]): T[] {}
 
killedBy: difference — property-based all result items are in array1
statusReason: Property failed after 1 tests
{ seed: 314828028, path: "0:0", endOnFailure: true }
Counterexample: [[],[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/array/difference.ts:16:10
  */
 export function difference<T>(array1: T[], array2: T[]): T[] {
   const set2 = new Set(array2);
-  return array1.filter(item => !set2.has(item));
+  return array1;
 }
 
killedBy: difference — property-based difference(a, a) returns []
statusReason: Property failed after 1 tests
{ seed: 691745979, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/difference.ts:16:24
  */
 export function difference<T>(array1: T[], array2: T[]): T[] {
   const set2 = new Set(array2);
-  return array1.filter(item => !set2.has(item));
+  return array1.filter(() => undefined);
 }
 
killedBy: difference — property-based difference(a, []) returns all elements of a
statusReason: Property failed after 1 tests
{ seed: -1448484649, path: "0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
