[Killed] BlockStatement
helpers/array/ensureArray.ts:39:103
  * @since 2.0.0
  */
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth: number): unknown[];
-export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {
-  if (value === null || value === undefined) return [];
-  const arr: unknown[] = Array.isArray(value) ? value : [value];
-  return depth !== undefined ? arr.flat(depth) : arr;
-}
+export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {}
 
killedBy: ensureArray should wrap a single value in an array
statusReason: expected undefined to deeply equal [ 'hello' ]

[Killed] ConditionalExpression
helpers/array/ensureArray.ts:40:25
  */
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth: number): unknown[];
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {
-  if (value === null || value === undefined) return [];
+  if (value === null || false) return [];
   const arr: unknown[] = Array.isArray(value) ? value : [value];
   return depth !== undefined ? arr.flat(depth) : arr;
killedBy: ensureArray should return empty array for undefined
statusReason: expected [ undefined ] to deeply equal []

[Killed] EqualityOperator
helpers/array/ensureArray.ts:40:25
  */
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth: number): unknown[];
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {
-  if (value === null || value === undefined) return [];
+  if (value === null || value !== undefined) return [];
   const arr: unknown[] = Array.isArray(value) ? value : [value];
   return depth !== undefined ? arr.flat(depth) : arr;
killedBy: ensureArray should wrap a single value in an array
statusReason: expected [] to deeply equal [ 'hello' ]

[Killed] ConditionalExpression
helpers/array/ensureArray.ts:42:10
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {
   if (value === null || value === undefined) return [];
   const arr: unknown[] = Array.isArray(value) ? value : [value];
-  return depth !== undefined ? arr.flat(depth) : arr;
+  return false ? arr.flat(depth) : arr;
 }
 
killedBy: ensureArray should flatten to depth 1 when depth is provided
statusReason: expected [ [ 1, [ 2, 3 ] ], [ 4 ] ] to deeply equal [ 1, [ 2, 3 ], 4 ]

[Killed] ConditionalExpression
helpers/array/ensureArray.ts:42:10
 export function ensureArray<T>(value: T | readonly T[] | null | undefined, depth?: number): unknown[] {
   if (value === null || value === undefined) return [];
   const arr: unknown[] = Array.isArray(value) ? value : [value];
-  return depth !== undefined ? arr.flat(depth) : arr;
+  return true ? arr.flat(depth) : arr;
 }
 
killedBy: ensureArray should return the array as-is if already an array
statusReason: expected [ 1, 2, 3 ] to be [ 1, 2, 3 ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: [ 1, 2, 3 ]
Received: serializes to the same string
