[Killed] BlockStatement
helpers/array/equalsDeep.ts:29:80
  * @returns `true` if arrays are deeply equal, `false` otherwise.
  * @since 2.0.0
  */
-export function equalsDeep<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
-    return true;
-  }
-  if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
-    return false;
-  }
-  if (arrA.length !== arrB.length) {
-    return false;
-  }
-  for (let i = 0; i < arrA.length; i++) {
-    if (!valuesEqual(arrA[i], arrB[i])) {
-      return false;
-    }
-  }
-  return true;
-}
+export function equalsDeep<T>(arrA: readonly T[], arrB: readonly T[]): boolean {}
 
 function valuesEqual(a: unknown, b: unknown): boolean {
killedBy: diff should return true for identical arrays
statusReason: expected { arr: false } to be true // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsDeep.ts:30:7
  * @since 2.0.0
  */
 export function equalsDeep<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
+  if (arrA !== arrB) {
     return true;
   }
killedBy: diff should handle arrays by returning false for differences
statusReason: expected true to deeply equal { arr: false }

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:30:7
  * @since 2.0.0
  */
 export function equalsDeep<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
+  if (true) {
     return true;
   }
killedBy: diff should handle arrays by returning false for differences
statusReason: expected true to deeply equal { arr: false }

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:31:12
  */
 export function equalsDeep<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
   if (arrA === arrB) {
-    return true;
+    return false;
   }
   if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
killedBy: equalsDeep — property-based reflexive: equalsDeep(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: 1160971841, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:33:7
   if (arrA === arrB) {
     return true;
   }
-  if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
+  if (true) {
     return false;
   }
killedBy: diff should return true for identical arrays
statusReason: expected { arr: false } to be true // Object.is equality

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:33:7
   if (arrA === arrB) {
     return true;
   }
-  if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
+  if (Array.isArray(arrA) || !Array.isArray(arrB)) {
     return false;
   }
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: -1245239107, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:34:12
     return true;
   }
   if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
-    return false;
+    return true;
   }
   if (arrA.length !== arrB.length) {
killedBy: array/equalsDeep returns false when one input is not an array
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsDeep.ts:36:7
   if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
     return false;
   }
-  if (arrA.length !== arrB.length) {
+  if (arrA.length === arrB.length) {
     return false;
   }
killedBy: equalsDeep — property-based symmetric: equalsDeep(a, b) === equalsDeep(b, a)
statusReason: Property failed after 2 tests
{ seed: 1535358813, path: "1:1:1", endOnFailure: true }
Counterexample: [[],[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/equalsDeep.ts:36:36
   if (!Array.isArray(arrA) || !Array.isArray(arrB)) {
     return false;
   }
-  if (arrA.length !== arrB.length) {
-    return false;
-  }
+  if (arrA.length !== arrB.length) {}
   for (let i = 0; i < arrA.length; i++) {
     if (!valuesEqual(arrA[i], arrB[i])) {
killedBy: equalsDeep — property-based symmetric: equalsDeep(a, b) === equalsDeep(b, a)
statusReason: Property failed after 15 tests
{ seed: 1230487209, path: "14:1:0:1", endOnFailure: true }
Counterexample: [[],[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:37:12
     return false;
   }
   if (arrA.length !== arrB.length) {
-    return false;
+    return true;
   }
   for (let i = 0; i < arrA.length; i++) {
killedBy: equalsDeep — contract different lengths are not equal
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:39:19
   if (arrA.length !== arrB.length) {
     return false;
   }
-  for (let i = 0; i < arrA.length; i++) {
+  for (let i = 0; false; i++) {
     if (!valuesEqual(arrA[i], arrB[i])) {
       return false;
killedBy: equalsDeep — contract different order returns false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:39:41
   if (arrA.length !== arrB.length) {
     return false;
   }
-  for (let i = 0; i < arrA.length; i++) {
-    if (!valuesEqual(arrA[i], arrB[i])) {
-      return false;
-    }
-  }
+  for (let i = 0; i < arrA.length; i++) {}
   return true;
 }
killedBy: equalsDeep — contract different order returns false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:40:9
     return false;
   }
   for (let i = 0; i < arrA.length; i++) {
-    if (!valuesEqual(arrA[i], arrB[i])) {
+    if (true) {
       return false;
     }
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 1501972665, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:40:9
     return false;
   }
   for (let i = 0; i < arrA.length; i++) {
-    if (!valuesEqual(arrA[i], arrB[i])) {
+    if (valuesEqual(arrA[i], arrB[i])) {
       return false;
     }
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: -599819752, path: "0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:41:14
   }
   for (let i = 0; i < arrA.length; i++) {
     if (!valuesEqual(arrA[i], arrB[i])) {
-      return false;
+      return true;
     }
   }
killedBy: equalsDeep — contract different order returns false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsDeep.ts:48:7
 }
 
 function valuesEqual(a: unknown, b: unknown): boolean {
-  if (a === b) {
+  if (a !== b) {
     return true;
   }
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 69990349, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/equalsDeep.ts:48:16
 }
 
 function valuesEqual(a: unknown, b: unknown): boolean {
-  if (a === b) {
-    return true;
-  }
+  if (a === b) {}
   if (Array.isArray(a) && Array.isArray(b)) {
     return equalsDeep(a, b);
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 549411740, path: "0:1:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:49:12
 
 function valuesEqual(a: unknown, b: unknown): boolean {
   if (a === b) {
-    return true;
+    return false;
   }
   if (Array.isArray(a) && Array.isArray(b)) {
killedBy: equalsDeep — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 2094455814, path: "0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:51:7
   if (a === b) {
     return true;
   }
-  if (Array.isArray(a) && Array.isArray(b)) {
+  if (false) {
     return equalsDeep(a, b);
   }
killedBy: equalsDeep — contract nested arrays with same structure are equal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:51:45
   if (a === b) {
     return true;
   }
-  if (Array.isArray(a) && Array.isArray(b)) {
-    return equalsDeep(a, b);
-  }
+  if (Array.isArray(a) && Array.isArray(b)) {}
   if (a instanceof Date && b instanceof Date) {
     return a.getTime() === b.getTime();
killedBy: equalsDeep — contract nested arrays with same structure are equal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:54:47
   if (Array.isArray(a) && Array.isArray(b)) {
     return equalsDeep(a, b);
   }
-  if (a instanceof Date && b instanceof Date) {
-    return a.getTime() === b.getTime();
-  }
+  if (a instanceof Date && b instanceof Date) {}
   if (isPlainObject(a) && isPlainObject(b)) {
     const ao = a as Record<string, unknown>;
killedBy: array/equalsDeep compares Date instances by epoch value
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:54:7
   if (Array.isArray(a) && Array.isArray(b)) {
     return equalsDeep(a, b);
   }
-  if (a instanceof Date && b instanceof Date) {
+  if (true) {
     return a.getTime() === b.getTime();
   }
killedBy: equalsDeep — property-based symmetric: equalsDeep(a, b) === equalsDeep(b, a)
statusReason: Property failed after 9 tests
{ seed: -1263333448, path: "8:4:7:11:14:17:20:23:25:27:28:32:35:39:42:45:48:51:53:55:57:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56:56", endOnFailure: true }
Counterexample: [[0,0,0,0,0,0,0,0,0,0],[0,0,0,0,0,0,0,0,0,1]]
Shrunk 50 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered du

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:55:12
     return equalsDeep(a, b);
   }
   if (a instanceof Date && b instanceof Date) {
-    return a.getTime() === b.getTime();
+    return false;
   }
   if (isPlainObject(a) && isPlainObject(b)) {
killedBy: array/equalsDeep compares Date instances by epoch value
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:55:12
     return equalsDeep(a, b);
   }
   if (a instanceof Date && b instanceof Date) {
-    return a.getTime() === b.getTime();
+    return true;
   }
   if (isPlainObject(a) && isPlainObject(b)) {
killedBy: array/equalsDeep compares Date instances by epoch value
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:57:7
   if (a instanceof Date && b instanceof Date) {
     return a.getTime() === b.getTime();
   }
-  if (isPlainObject(a) && isPlainObject(b)) {
+  if (true) {
     const ao = a as Record<string, unknown>;
     const bo = b as Record<string, unknown>;
killedBy: array/equalsDeep returns false for arrays differing at one index
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:57:45
   if (a instanceof Date && b instanceof Date) {
     return a.getTime() === b.getTime();
   }
-  if (isPlainObject(a) && isPlainObject(b)) {
-    const ao = a as Record<string, unknown>;
-    const bo = b as Record<string, unknown>;
-    const keysA = Object.keys(ao);
-    if (keysA.length !== Object.keys(bo).length) {
-      return false;
-    }
-    for (const key of keysA) {
-      if (!Object.prototype.hasOwnProperty.call(bo, key)) {
-        return false;
-      }
-      if (!valuesEqual(ao[key], bo[key])) {
-        return false;
-      }
-    }
-    return true;
-  }
+  if (isPlainObject(a) && isPlainObject(b)) {}
   return false;
 }
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:61:9
     const ao = a as Record<string, unknown>;
     const bo = b as Record<string, unknown>;
     const keysA = Object.keys(ao);
-    if (keysA.length !== Object.keys(bo).length) {
+    if (true) {
       return false;
     }
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsDeep.ts:61:9
     const ao = a as Record<string, unknown>;
     const bo = b as Record<string, unknown>;
     const keysA = Object.keys(ao);
-    if (keysA.length !== Object.keys(bo).length) {
+    if (keysA.length === Object.keys(bo).length) {
       return false;
     }
killedBy: diff should handle arrays in object properties using equalsShallow
statusReason: expected { arr: false } to be true // Object.is equality

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:62:14
     const bo = b as Record<string, unknown>;
     const keysA = Object.keys(ao);
     if (keysA.length !== Object.keys(bo).length) {
-      return false;
+      return true;
     }
     for (const key of keysA) {
killedBy: array/equalsDeep returns false when nested objects in arrays differ in key count
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:64:30
     if (keysA.length !== Object.keys(bo).length) {
       return false;
     }
-    for (const key of keysA) {
-      if (!Object.prototype.hasOwnProperty.call(bo, key)) {
-        return false;
-      }
-      if (!valuesEqual(ao[key], bo[key])) {
-        return false;
-      }
-    }
+    for (const key of keysA) {}
     return true;
   }
killedBy: diff should handle arrays in object properties using equalsShallow
statusReason: expected true to deeply equal { arr: false }

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:65:11
       return false;
     }
     for (const key of keysA) {
-      if (!Object.prototype.hasOwnProperty.call(bo, key)) {
+      if (true) {
         return false;
       }
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:65:11
       return false;
     }
     for (const key of keysA) {
-      if (!Object.prototype.hasOwnProperty.call(bo, key)) {
+      if (Object.prototype.hasOwnProperty.call(bo, key)) {
         return false;
       }
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:66:16
     }
     for (const key of keysA) {
       if (!Object.prototype.hasOwnProperty.call(bo, key)) {
-        return false;
+        return true;
       }
       if (!valuesEqual(ao[key], bo[key])) {
killedBy: array/equalsDeep returns false when nested objects in arrays have same key count but different keys
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsDeep.ts:68:11
       if (!Object.prototype.hasOwnProperty.call(bo, key)) {
         return false;
       }
-      if (!valuesEqual(ao[key], bo[key])) {
+      if (true) {
         return false;
       }
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/array/equalsDeep.ts:68:43
       if (!Object.prototype.hasOwnProperty.call(bo, key)) {
         return false;
       }
-      if (!valuesEqual(ao[key], bo[key])) {
-        return false;
-      }
+      if (!valuesEqual(ao[key], bo[key])) {}
     }
     return true;
killedBy: array/equalsDeep recurses into nested plain objects
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/array/equalsDeep.ts:69:16
         return false;
       }
       if (!valuesEqual(ao[key], bo[key])) {
-        return false;
+        return true;
       }
     }
killedBy: diff should handle arrays in object properties using equalsShallow
statusReason: expected true to deeply equal { arr: false }
