[Killed] BlockStatement
helpers/array/equalsShallow.ts:22:83
  * @returns `true` if every element matches by `===` at the same index, `false` otherwise.
  * @since 2.0.0
  */
-export function equalsShallow<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
-    return true;
-  }
-  if (arrA.length !== arrB.length) {
-    return false;
-  }
-  for (let i = 0; i < arrA.length; i++) {
-    if (arrA[i] !== arrB[i]) {
-      return false;
-    }
-  }
-  return true;
-}
+export function equalsShallow<T>(arrA: readonly T[], arrB: readonly T[]): boolean {}
 
killedBy: equalsShallow — property-based reflexive: equalsShallow(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -736673163, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/equalsShallow.ts:23:7
  * @since 2.0.0
  */
 export function equalsShallow<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
+  if (arrA !== arrB) {
     return true;
   }
killedBy: equalsShallow — contract [1,2] vs [2,1] are not equal (order matters)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsShallow.ts:23:7
  * @since 2.0.0
  */
 export function equalsShallow<T>(arrA: readonly T[], arrB: readonly T[]): boolean {
-  if (arrA === arrB) {
+  if (true) {
     return true;
   }
killedBy: equalsShallow — contract [1,2] vs [2,1] are not equal (order matters)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsShallow.ts:26:7
   if (arrA === arrB) {
     return true;
   }
-  if (arrA.length !== arrB.length) {
+  if (true) {
     return false;
   }
killedBy: equalsShallow — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 1125730763, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/equalsShallow.ts:29:41
   if (arrA.length !== arrB.length) {
     return false;
   }
-  for (let i = 0; i < arrA.length; i++) {
-    if (arrA[i] !== arrB[i]) {
-      return false;
-    }
-  }
+  for (let i = 0; i < arrA.length; i++) {}
   return true;
 }
killedBy: equalsShallow — contract [1,2] vs [2,1] are not equal (order matters)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/array/equalsShallow.ts:30:30
     return false;
   }
   for (let i = 0; i < arrA.length; i++) {
-    if (arrA[i] !== arrB[i]) {
-      return false;
-    }
+    if (arrA[i] !== arrB[i]) {}
   }
   return true;
killedBy: equalsShallow — contract [1,2] vs [2,1] are not equal (order matters)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsShallow.ts:30:9
     return false;
   }
   for (let i = 0; i < arrA.length; i++) {
-    if (arrA[i] !== arrB[i]) {
+    if (arrA[i] === arrB[i]) {
       return false;
     }
killedBy: equalsShallow — property-based equal arrays return true
statusReason: Property failed after 1 tests
{ seed: 2035723726, path: "0:1:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsShallow.ts:31:14
   }
   for (let i = 0; i < arrA.length; i++) {
     if (arrA[i] !== arrB[i]) {
-      return false;
+      return true;
     }
   }
killedBy: equalsShallow — contract [1,2] vs [2,1] are not equal (order matters)
statusReason: expected true to be false // Object.is equality
