[Killed] BlockStatement
helpers/array/equalsUnordered.ts:30:85
  * @returns `true` if both arrays contain the same items regardless of order, `false` otherwise.
  * @since 2.0.0
  */
-export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
-  if (arr1.length !== arr2.length) return false;
-  const used: boolean[] = arr2.map(() => false);
-  return arr1.every((v1) => {
-    const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
-    });
-    if (idx === -1) return false;
-    used[idx] = true;
-    return true;
-  });
-}
+export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {}
 
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: 1017359764, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsUnordered.ts:31:43
  * @since 2.0.0
  */
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
-  if (arr1.length !== arr2.length) return false;
+  if (arr1.length !== arr2.length) return true;
   const used: boolean[] = arr2.map(() => false);
   return arr1.every((v1) => {
killedBy: equalsUnordered — contract different lengths return false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsUnordered.ts:31:7
  * @since 2.0.0
  */
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
-  if (arr1.length !== arr2.length) return false;
+  if (arr1.length === arr2.length) return false;
   const used: boolean[] = arr2.map(() => false);
   return arr1.every((v1) => {
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: 730973418, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsUnordered.ts:32:42
  */
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
   if (arr1.length !== arr2.length) return false;
-  const used: boolean[] = arr2.map(() => false);
+  const used: boolean[] = arr2.map(() => true);
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: 334021015, path: "0:1:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ArrowFunction
helpers/array/equalsUnordered.ts:32:36
  */
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
   if (arr1.length !== arr2.length) return false;
-  const used: boolean[] = arr2.map(() => false);
+  const used: boolean[] = arr2.map(() => undefined);
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {

[Killed] BlockStatement
helpers/array/equalsUnordered.ts:33:29
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
   if (arr1.length !== arr2.length) return false;
   const used: boolean[] = arr2.map(() => false);
-  return arr1.every((v1) => {
-    const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
-    });
-    if (idx === -1) return false;
-    used[idx] = true;
-    return true;
-  });
+  return arr1.every((v1) => {});
 }
 
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -1231721549, path: "0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/array/equalsUnordered.ts:33:10
 export function equalsUnordered<T>(arr1: readonly T[], arr2: readonly T[]): boolean {
   if (arr1.length !== arr2.length) return false;
   const used: boolean[] = arr2.map(() => false);
-  return arr1.every((v1) => {
-    const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
-    });
-    if (idx === -1) return false;
-    used[idx] = true;
-    return true;
-  });
+  return arr1.some(v1 => {
+  const idx = arr2.findIndex((v2, i) => {
+    if (used[i]) return false;
+    if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
+    if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
+    return v1 === v2;
+  });
+  if (idx === -1) return false;
+  used[idx] = true;
+  return true;
+});
 }
 
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 9 tests
{ seed: -1810358769, path: "8", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/equalsUnordered.ts:34:43
   if (arr1.length !== arr2.length) return false;
   const used: boolean[] = arr2.map(() => false);
   return arr1.every((v1) => {
-    const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
-    });
+    const idx = arr2.findIndex((v2, i) => {});
     if (idx === -1) return false;
     used[idx] = true;
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -190118415, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/array/equalsUnordered.ts:35:27
   const used: boolean[] = arr2.map(() => false);
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
+      if (used[i]) return true;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
killedBy: equalsUnordered should return false for nested arrays if they are not identical
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:35:11
   const used: boolean[] = arr2.map(() => false);
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {
-      if (used[i]) return false;
+      if (true) return false;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -1142939480, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:36:11
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {
       if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
+      if (false) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
killedBy: equalsUnordered should return true for nested arrays if they are identical
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:36:11
   return arr1.every((v1) => {
     const idx = arr2.findIndex((v2, i) => {
       if (used[i]) return false;
-      if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
+      if (true) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -1542071694, path: "0:1:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:37:11
     const idx = arr2.findIndex((v2, i) => {
       if (used[i]) return false;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
+      if (false) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
     });
killedBy: equalsUnordered — contract [{a:1}] vs [{a:1}] returns true via equalsShallow
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
helpers/array/equalsUnordered.ts:37:11
     const idx = arr2.findIndex((v2, i) => {
       if (used[i]) return false;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
-      if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
+      if (isPlainObject(v1) || isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
     });

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:38:14
       if (used[i]) return false;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
+      return true;
     });
     if (idx === -1) return false;
killedBy: equalsUnordered — contract arrays with no matching items return false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/array/equalsUnordered.ts:38:14
       if (used[i]) return false;
       if (isArray(v1) && isArray(v2)) return equalsUnordered(v1 as unknown[], v2 as unknown[]);
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
-      return v1 === v2;
+      return v1 !== v2;
     });
     if (idx === -1) return false;
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -1760285788, path: "0:1:1:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/equalsUnordered.ts:40:9
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
     });
-    if (idx === -1) return false;
+    if (idx !== -1) return false;
     used[idx] = true;
     return true;
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -1032173493, path: "0:1:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/equalsUnordered.ts:40:9
       if (isPlainObject(v1) && isPlainObject(v2)) return equalsShallow(v1 as object, v2 as object);
       return v1 === v2;
     });
-    if (idx === -1) return false;
+    if (false) return false;
     used[idx] = true;
     return true;
killedBy: equalsUnordered — contract arrays with no matching items return false
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
helpers/array/equalsUnordered.ts:41:17
       return v1 === v2;
     });
     if (idx === -1) return false;
-    used[idx] = true;
+    used[idx] = false;
     return true;
   });

[Killed] BooleanLiteral
helpers/array/equalsUnordered.ts:42:12
     });
     if (idx === -1) return false;
     used[idx] = true;
-    return true;
+    return false;
   });
 }
killedBy: equalsUnordered — property-based reflexive: equalsUnordered(a, a) is always true
statusReason: Property failed after 1 tests
{ seed: -2142822381, path: "0:1:0:0:1", endOnFailure: true }
Counterexample: [[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
