[Killed] BlockStatement
helpers/array/intersection.ts:16:72
  * @returns The intersection of the two arrays
  * @since 1.0.0
  */
-export function intersection<T>(a: readonly T[], b: readonly T[]): T[] {
-    return a.filter((v) => b.includes(v));
-}
+export function intersection<T>(a: readonly T[], b: readonly T[]): T[] {}
 
killedBy: intersection — property-based result items are all in both a and b
statusReason: Property failed after 1 tests
{ seed: 1005801119, path: "0:0:0", endOnFailure: true }
Counterexample: [[],[]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/intersection.ts:17:21
  * @since 1.0.0
  */
 export function intersection<T>(a: readonly T[], b: readonly T[]): T[] {
-    return a.filter((v) => b.includes(v));
+    return a.filter(() => undefined);
 }
 
killedBy: intersection — contract identical arrays return the elements
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
helpers/array/intersection.ts:17:12
  * @since 1.0.0
  */
 export function intersection<T>(a: readonly T[], b: readonly T[]): T[] {
-    return a.filter((v) => b.includes(v));
+    return a;
 }
 
killedBy: intersection — property-based result items are all in both a and b
statusReason: Property failed after 1 tests
{ seed: 1567878426, path: "0:1:0:0:1:1", endOnFailure: true }
Counterexample: [[0],[]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
