[Killed] BlockStatement
helpers/array/intersects.ts:15:74
  * @returns `true` if one item is in common, `false` otherwise.
  * @since 1.0.0
  */
-export function intersects<T>(a: readonly T[], b: readonly T[]): boolean {
-    return a.some((i) => b.includes(i));
-}
+export function intersects<T>(a: readonly T[], b: readonly T[]): boolean {}
 
killedBy: intersects — property-based intersects(a, a) is true if a.length > 0
statusReason: Property failed after 1 tests
{ seed: -1433163458, path: "0:0", endOnFailure: true }
Counterexample: [[0]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/intersects.ts:16:19
  * @since 1.0.0
  */
 export function intersects<T>(a: readonly T[], b: readonly T[]): boolean {
-    return a.some((i) => b.includes(i));
+    return a.some(() => undefined);
 }
 
killedBy: intersects — property-based intersects(a, a) is true if a.length > 0
statusReason: Property failed after 1 tests
{ seed: -1100034291, path: "0:0:0", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/array/intersects.ts:16:12
  * @since 1.0.0
  */
 export function intersects<T>(a: readonly T[], b: readonly T[]): boolean {
-    return a.some((i) => b.includes(i));
+    return a.every(i => b.includes(i));
 }
 
killedBy: intersects — property-based intersects(a, []) is false for any a
statusReason: Property failed after 9 tests
{ seed: 1006051190, path: "8", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
