[Killed] EqualityOperator
helpers/array/range.ts:36:7
   let start: number;
   let stop: number;
 
-  if (end === undefined) {
+  if (end !== undefined) {
     start = 0;
     stop = startOrEnd;
killedBy: range — property-based all values satisfy start <= v < stop (forward range)
statusReason: Property failed after 8 tests
{ seed: -662997076, path: "7:1:2:1:2", endOnFailure: true }
Counterexample: [1,2,1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/range.ts:36:7
   let start: number;
   let stop: number;
 
-  if (end === undefined) {
+  if (false) {
     start = 0;
     stop = startOrEnd;
killedBy: range — contract range(5) returns [0,1,2,3,4]
statusReason: expected [] to deeply equal [ +0, 1, 2, 3, 4 ]

[Killed] BlockStatement
helpers/array/range.ts:39:10
   if (end === undefined) {
     start = 0;
     stop = startOrEnd;
-  } else {
-    start = startOrEnd;
-    stop = end;
-  }
+  } else {}
 
   const direction = stop >= start ? 1 : -1;
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: 185265001, path: "0:1:0:0:0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/range.ts:44:21
     stop = end;
   }
 
-  const direction = stop >= start ? 1 : -1;
+  const direction = false ? 1 : -1;
   const increment = step ?? direction;
 
killedBy: range — contract range(5) returns [0,1,2,3,4]
statusReason: expected [] to deeply equal [ +0, 1, 2, 3, 4 ]

[Killed] ConditionalExpression
helpers/array/range.ts:44:21
     stop = end;
   }
 
-  const direction = stop >= start ? 1 : -1;
+  const direction = true ? 1 : -1;
   const increment = step ?? direction;
 
killedBy: range — contract range(5,0) returns [5,4,3,2,1]
statusReason: expected [] to deeply equal [ 5, 4, 3, 2, 1 ]

[Killed] LogicalOperator
helpers/array/range.ts:45:21
   }
 
   const direction = stop >= start ? 1 : -1;
-  const increment = step ?? direction;
+  const increment = step && direction;
 
   if (increment === 0) return [];
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: 99503615, path: "0:3:2:2", endOnFailure: true }
Counterexample: [2,2]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/range.ts:47:7
   const direction = stop >= start ? 1 : -1;
   const increment = step ?? direction;
 
-  if (increment === 0) return [];
+  if (increment !== 0) return [];
   if (increment > 0 && start >= stop) return [];
   if (increment < 0 && start <= stop) return [];
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -185102917, path: "0:1:0:0:0:0:0", endOnFailure: true }
Counterexample: [1,1]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/range.ts:47:7
   const direction = stop >= start ? 1 : -1;
   const increment = step ?? direction;
 
-  if (increment === 0) return [];
+  if (true) return [];
   if (increment > 0 && start >= stop) return [];
   if (increment < 0 && start <= stop) return [];
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -713022600, path: "0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/range.ts:48:7
   const increment = step ?? direction;
 
   if (increment === 0) return [];
-  if (increment > 0 && start >= stop) return [];
+  if (increment <= 0 && start >= stop) return [];
   if (increment < 0 && start <= stop) return [];
 
killedBy: range — contract range(5,0) returns [5,4,3,2,1]
statusReason: expected [] to deeply equal [ 5, 4, 3, 2, 1 ]

[Killed] EqualityOperator
helpers/array/range.ts:48:24
   const increment = step ?? direction;
 
   if (increment === 0) return [];
-  if (increment > 0 && start >= stop) return [];
+  if (increment > 0 && start < stop) return [];
   if (increment < 0 && start <= stop) return [];
 
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -1262694949, path: "0:1:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/array/range.ts:49:7
 
   if (increment === 0) return [];
   if (increment > 0 && start >= stop) return [];
-  if (increment < 0 && start <= stop) return [];
+  if (increment < 0 || start <= stop) return [];
 
   const result: number[] = [];
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -1695676003, path: "0:1:0:0:0:0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/range.ts:49:24
 
   if (increment === 0) return [];
   if (increment > 0 && start >= stop) return [];
-  if (increment < 0 && start <= stop) return [];
+  if (increment < 0 && true) return [];
 
   const result: number[] = [];
killedBy: range — contract range(5,0) returns [5,4,3,2,1]
statusReason: expected [] to deeply equal [ 5, 4, 3, 2, 1 ]

[Killed] EqualityOperator
helpers/array/range.ts:52:7
   if (increment < 0 && start <= stop) return [];
 
   const result: number[] = [];
-  if (increment > 0) {
+  if (increment <= 0) {
     for (let i = start; i < stop; i += increment) {
       result.push(i);
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: 818580338, path: "0:1:0:0:0:0:0", endOnFailure: true }
Counterexample: [1,1]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/range.ts:52:22
   if (increment < 0 && start <= stop) return [];
 
   const result: number[] = [];
-  if (increment > 0) {
-    for (let i = start; i < stop; i += increment) {
-      result.push(i);
-    }
-  } else {
+  if (increment > 0) {} else {
     for (let i = start; i > stop; i += increment) {
       result.push(i);
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: 182336356, path: "0:1:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/range.ts:53:25
 
   const result: number[] = [];
   if (increment > 0) {
-    for (let i = start; i < stop; i += increment) {
+    for (let i = start; i >= stop; i += increment) {
       result.push(i);
     }
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -1759043918, path: "0:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/range.ts:53:51
 
   const result: number[] = [];
   if (increment > 0) {
-    for (let i = start; i < stop; i += increment) {
-      result.push(i);
-    }
+    for (let i = start; i < stop; i += increment) {}
   } else {
     for (let i = start; i > stop; i += increment) {
killedBy: range — property-based length matches expected count
statusReason: Property failed after 1 tests
{ seed: -1111236973, path: "0:1:0", endOnFailure: true }
Counterexample: [1,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/range.ts:56:10
     for (let i = start; i < stop; i += increment) {
       result.push(i);
     }
-  } else {
-    for (let i = start; i > stop; i += increment) {
-      result.push(i);
-    }
-  }
+  } else {}
 
   return result;
killedBy: range — contract range(5,0) returns [5,4,3,2,1]
statusReason: expected [] to deeply equal [ 5, 4, 3, 2, 1 ]

[Killed] EqualityOperator
helpers/array/range.ts:57:25
       result.push(i);
     }
   } else {
-    for (let i = start; i > stop; i += increment) {
+    for (let i = start; i >= stop; i += increment) {
       result.push(i);
     }
killedBy: range — property-based all values satisfy stop < v <= start (backward range)
statusReason: Property failed after 47 tests
{ seed: -1678087797, path: "46:4:7:0:0:0:0:0:1:0:0:0:0", endOnFailure: true }
Counterexample: [0,-1,1]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/range.ts:57:51
       result.push(i);
     }
   } else {
-    for (let i = start; i > stop; i += increment) {
-      result.push(i);
-    }
+    for (let i = start; i > stop; i += increment) {}
   }
 
killedBy: range — contract range(5,0) returns [5,4,3,2,1]
statusReason: expected [] to deeply equal [ 5, 4, 3, 2, 1 ]
