[Killed] BlockStatement
helpers/array/sample.ts:26:85
  */
 export function sample<T>(array: readonly T[]): T | undefined;
 export function sample<T>(array: readonly T[], count: number): T[];
-export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {
-  if (array.length === 0) {
-    return count === undefined ? undefined : [];
-  }
-
-  if (count === undefined) {
-    return array[Math.floor(Math.random() * array.length)];
-  }
-
-  const clamped = Math.max(0, Math.min(count, array.length));
-  return shuffle(array).slice(0, clamped);
-}
+export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {}
 
killedBy: sample without count (single element) should return a single element from the array
statusReason: expected [ 1, 2, 3, 4, 5 ] to include undefined

[Killed] EqualityOperator
helpers/array/sample.ts:27:7
 export function sample<T>(array: readonly T[]): T | undefined;
 export function sample<T>(array: readonly T[], count: number): T[];
 export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {
-  if (array.length === 0) {
+  if (array.length !== 0) {
     return count === undefined ? undefined : [];
   }
killedBy: sample without count (single element) should return a single element from the array
statusReason: expected [ 1, 2, 3, 4, 5 ] to include undefined

[Killed] ConditionalExpression
helpers/array/sample.ts:27:7
 export function sample<T>(array: readonly T[]): T | undefined;
 export function sample<T>(array: readonly T[], count: number): T[];
 export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {
-  if (array.length === 0) {
+  if (true) {
     return count === undefined ? undefined : [];
   }
killedBy: sample without count (single element) should return a single element from the array
statusReason: expected [ 1, 2, 3, 4, 5 ] to include undefined

[Killed] ConditionalExpression
helpers/array/sample.ts:28:12
 export function sample<T>(array: readonly T[], count: number): T[];
 export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {
   if (array.length === 0) {
-    return count === undefined ? undefined : [];
+    return false ? undefined : [];
   }
 
killedBy: sample without count (single element) should return undefined for empty array
statusReason: expected [] to be undefined

[Killed] EqualityOperator
helpers/array/sample.ts:28:12
 export function sample<T>(array: readonly T[], count: number): T[];
 export function sample<T>(array: readonly T[], count?: number): T | undefined | T[] {
   if (array.length === 0) {
-    return count === undefined ? undefined : [];
+    return count !== undefined ? undefined : [];
   }
 
killedBy: sample — property-based single sample returns an element from array (or undefined if empty)
statusReason: Property failed after 3 tests
{ seed: 718111757, path: "2", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/sample.ts:31:7
     return count === undefined ? undefined : [];
   }
 
-  if (count === undefined) {
+  if (true) {
     return array[Math.floor(Math.random() * array.length)];
   }
killedBy: sample with count (multiple elements) should return the requested number of elements
statusReason: expected 5 to have property 'length'

[Killed] BlockStatement
helpers/array/sample.ts:31:28
     return count === undefined ? undefined : [];
   }
 
-  if (count === undefined) {
-    return array[Math.floor(Math.random() * array.length)];
-  }
+  if (count === undefined) {}
 
   const clamped = Math.max(0, Math.min(count, array.length));
killedBy: sample without count (single element) should return a single element from the array
statusReason: expected [ 1, 2, 3, 4, 5 ] to include []

[Killed] ArithmeticOperator
helpers/array/sample.ts:32:29
   }
 
   if (count === undefined) {
-    return array[Math.floor(Math.random() * array.length)];
+    return array[Math.floor(Math.random() / array.length)];
   }
 
killedBy: sample without count (single element) should use Math.random for selection
statusReason: expected 10 to be 30 // Object.is equality

[Killed] MethodExpression
helpers/array/sample.ts:35:31
     return array[Math.floor(Math.random() * array.length)];
   }
 
-  const clamped = Math.max(0, Math.min(count, array.length));
+  const clamped = Math.max(0, Math.max(count, array.length));
   return shuffle(array).slice(0, clamped);
 }
killedBy: sample with count (multiple elements) should return the requested number of elements
statusReason: expected [ 3, 4, 5, 1, 2 ] to have a length of 3 but got 5

[Killed] MethodExpression
helpers/array/sample.ts:35:19
     return array[Math.floor(Math.random() * array.length)];
   }
 
-  const clamped = Math.max(0, Math.min(count, array.length));
+  const clamped = Math.min(0, Math.min(count, array.length));
   return shuffle(array).slice(0, clamped);
 }
killedBy: sample — contract count > length returns all elements
statusReason: expected [] to have a length of 3 but got +0

[Killed] MethodExpression
helpers/array/sample.ts:36:10
   }
 
   const clamped = Math.max(0, Math.min(count, array.length));
-  return shuffle(array).slice(0, clamped);
+  return shuffle(array);
 }
 
killedBy: sample with count (multiple elements) should return the requested number of elements
statusReason: expected [ 5, 2, 4, 1, 3 ] to have a length of 3 but got 5
