[Killed] BlockStatement
helpers/array/shuffle.ts:17:54
  * // => [3, 1, 5, 2, 4] (random order)
  * @since 2.0.0
  */
-export function shuffle<T>(array: readonly T[]): T[] {
-  const result = [...array];
-  for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [result[i], result[j]] = [result[j], result[i]];
-  }
-  return result;
-}
+export function shuffle<T>(array: readonly T[]): T[] {}
 
killedBy: sample — property-based sample with count returns array with length <= count
statusReason: Property failed after 1 tests
{ seed: -59439309, path: "0:1:0:0:0:1:1", endOnFailure: true }
Counterexample: [[0],0]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/shuffle.ts:19:35
  */
 export function shuffle<T>(array: readonly T[]): T[] {
   const result = [...array];
-  for (let i = result.length - 1; i > 0; i--) {
+  for (let i = result.length - 1; i <= 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
     [result[i], result[j]] = [result[j], result[i]];
killedBy: sample with count (multiple elements) should produce varied results (deterministic)
statusReason: expected '[1,2,3]' not to be '[1,2,3]' // Object.is equality

[Killed] BlockStatement
helpers/array/shuffle.ts:19:47
  */
 export function shuffle<T>(array: readonly T[]): T[] {
   const result = [...array];
-  for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
-    [result[i], result[j]] = [result[j], result[i]];
-  }
+  for (let i = result.length - 1; i > 0; i--) {}
   return result;
 }
killedBy: sample with count (multiple elements) should produce varied results (deterministic)
statusReason: expected '[1,2,3]' not to be '[1,2,3]' // Object.is equality

[Killed] ArithmeticOperator
helpers/array/shuffle.ts:20:43
 export function shuffle<T>(array: readonly T[]): T[] {
   const result = [...array];
   for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() * (i - 1));
     [result[i], result[j]] = [result[j], result[i]];
   }
killedBy: shuffle should use Fisher-Yates algorithm correctly
statusReason: expected [ 2, 3, 1 ] to deeply equal [ 3, 1, 2 ]

[Killed] ArithmeticOperator
helpers/array/shuffle.ts:20:26
 export function shuffle<T>(array: readonly T[]): T[] {
   const result = [...array];
   for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1));
+    const j = Math.floor(Math.random() / (i + 1));
     [result[i], result[j]] = [result[j], result[i]];
   }
killedBy: sample with count (multiple elements) should produce varied results (deterministic)
statusReason: expected '[2,3,4]' not to be '[2,3,4]' // Object.is equality

[Killed] ArrayDeclaration
helpers/array/shuffle.ts:21:30
   const result = [...array];
   for (let i = result.length - 1; i > 0; i--) {
     const j = Math.floor(Math.random() * (i + 1));
-    [result[i], result[j]] = [result[j], result[i]];
+    [result[i], result[j]] = [];
   }
   return result;
killedBy: sample — property-based all sampled items are from original array
statusReason: Property failed after 1 tests
{ seed: -362527499, path: "0:1:1:2:1", endOnFailure: true }
Counterexample: [[0,0],1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
