[Killed] ArithmeticOperator
helpers/array/sort.ts:20:74
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortNumberAscFn: SortFn<number> = (a: number, b: number) => a - b;
+export const sortNumberAscFn: SortFn<number> = (a: number, b: number) => a + b;
 
 /**
killedBy: sort functions number sorting should sort numbers ascending
statusReason: expected [ 3, 1, 4, 1, 5 ] to deeply equal [ 1, 1, 3, 4, 5 ]

[Killed] ArrowFunction
helpers/array/sort.ts:20:48
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortNumberAscFn: SortFn<number> = (a: number, b: number) => a - b;
+export const sortNumberAscFn: SortFn<number> = () => undefined;
 
 /**
killedBy: sort — property-based sortNumberAscFn: result is non-decreasing
statusReason: Property failed after 1 tests
{ seed: -1368181954, path: "0:2:3:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [[0,-1.401298464324817e-45]]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/array/sort.ts:29:75
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortNumberDescFn: SortFn<number> = (a: number, b: number) => b - a;
+export const sortNumberDescFn: SortFn<number> = (a: number, b: number) => b + a;
 
 /**
killedBy: sort functions number sorting should sort numbers descending
statusReason: expected [ 3, 1, 4, 1, 5 ] to deeply equal [ 5, 4, 3, 1, 1 ]

[Killed] ArrowFunction
helpers/array/sort.ts:29:49
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortNumberDescFn: SortFn<number> = (a: number, b: number) => b - a;
+export const sortNumberDescFn: SortFn<number> = () => undefined;
 
 /**
killedBy: sort functions number sorting should sort numbers descending
statusReason: expected [ 3, 1, 4, 1, 5 ] to deeply equal [ 5, 4, 3, 1, 1 ]

[Killed] ArrowFunction
helpers/array/sort.ts:38:48
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringAscFn: SortFn<string> = (a: string, b: string) => a.localeCompare(b);
+export const sortStringAscFn: SortFn<string> = () => undefined;
 
 /**
killedBy: sort functions string sorting should sort strings ascending
statusReason: expected [ 'cherry', 'apple', 'banana' ] to deeply equal [ 'apple', 'banana', 'cherry' ]

[Killed] ArrowFunction
helpers/array/sort.ts:47:49
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringDescFn: SortFn<string> = (a: string, b: string) => b.localeCompare(a);
+export const sortStringDescFn: SortFn<string> = () => undefined;
 
 /**
killedBy: sort functions string sorting should sort strings descending
statusReason: expected [ 'cherry', 'apple', 'banana' ] to deeply equal [ 'cherry', 'banana', 'apple' ]

[Killed] ArrowFunction
helpers/array/sort.ts:56:59
  * @returns Sort order
  * @since 1.9.0
  */
-export const sortStringAscInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  a.toLowerCase().localeCompare(b.toLowerCase());
+export const sortStringAscInsensitiveFn: SortFn<string> = () => undefined;
 
 /**
killedBy: sort functions string sorting should sort strings case insensitive
statusReason: expected [ 'Cherry', 'apple', 'Banana' ] to deeply equal [ 'apple', 'Banana', 'Cherry' ]

[Survived] MethodExpression
helpers/array/sort.ts:57:33
  * @since 1.9.0
  */
 export const sortStringAscInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  a.toLowerCase().localeCompare(b.toLowerCase());
+  a.toLowerCase().localeCompare(b.toUpperCase());
 
 /**

[Survived] MethodExpression
helpers/array/sort.ts:57:3
  * @since 1.9.0
  */
 export const sortStringAscInsensitiveFn: SortFn<string> = (a: string, b: string) =>
-  a.toLowerCase().localeCompare(b.toLowerCase());
+  a.toUpperCase().localeCompare(b.toLowerCase());
 
 /**

[Survived] BooleanLiteral
helpers/array/sort.ts:68:30
  */
 export function createSortByStringFn<T extends Record<string, unknown>>(
   property?: keyof T,
-  caseInsensitive: boolean = false
+  caseInsensitive: boolean = true
 ): SortFn<T> {
   return (a: T, b: T) => {

[Killed] BlockStatement
helpers/array/sort.ts:69:14
 export function createSortByStringFn<T extends Record<string, unknown>>(
   property?: keyof T,
   caseInsensitive: boolean = false
-): SortFn<T> {
-  return (a: T, b: T) => {
-    let aVal = '';
-    let bVal = '';
-
-    if (property) {
-      aVal = String(a[property] ?? '');
-      bVal = String(b[property] ?? '');
-    } else {
-      // Try default properties in order
-      for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
-          aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
-          break;
-        }
-      }
-    }
-
-    return caseInsensitive
-      ? aVal.toLowerCase().localeCompare(bVal.toLowerCase())
-      : aVal.localeCompare(bVal);
-  };
-}
+): SortFn<T> {}
 
 /**
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'John', 'alice', 'Bob' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] BlockStatement
helpers/array/sort.ts:70:26
   property?: keyof T,
   caseInsensitive: boolean = false
 ): SortFn<T> {
-  return (a: T, b: T) => {
-    let aVal = '';
-    let bVal = '';
-
-    if (property) {
-      aVal = String(a[property] ?? '');
-      bVal = String(b[property] ?? '');
-    } else {
-      // Try default properties in order
-      for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
-          aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
-          break;
-        }
-      }
-    }
-
-    return caseInsensitive
-      ? aVal.toLowerCase().localeCompare(bVal.toLowerCase())
-      : aVal.localeCompare(bVal);
-  };
+  return (a: T, b: T) => {};
 }
 
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'John', 'alice', 'Bob' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] ConditionalExpression
helpers/array/sort.ts:74:9
     let aVal = '';
     let bVal = '';
 
-    if (property) {
+    if (false) {
       aVal = String(a[property] ?? '');
       bVal = String(b[property] ?? '');
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'John', 'alice', 'Bob' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] BlockStatement
helpers/array/sort.ts:74:19
     let aVal = '';
     let bVal = '';
 
-    if (property) {
-      aVal = String(a[property] ?? '');
-      bVal = String(b[property] ?? '');
-    } else {
+    if (property) {} else {
       // Try default properties in order
       for (const prop of ['value', 'label', 'title', 'description']) {
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'John', 'alice', 'Bob' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] LogicalOperator
helpers/array/sort.ts:75:21
     let bVal = '';
 
     if (property) {
-      aVal = String(a[property] ?? '');
+      aVal = String(a[property] && '');
       bVal = String(b[property] ?? '');
     } else {
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'Bob', 'alice', 'John' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] LogicalOperator
helpers/array/sort.ts:76:21
 
     if (property) {
       aVal = String(a[property] ?? '');
-      bVal = String(b[property] ?? '');
+      bVal = String(b[property] && '');
     } else {
       // Try default properties in order
killedBy: sort functions property sorting should sort by string property
statusReason: expected [ 'John', 'alice', 'Bob' ] to deeply equal [ 'alice', 'Bob', 'John' ]

[Killed] BlockStatement
helpers/array/sort.ts:77:12
     if (property) {
       aVal = String(a[property] ?? '');
       bVal = String(b[property] ?? '');
-    } else {
-      // Try default properties in order
-      for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
-          aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
-          break;
-        }
-      }
-    }
+    } else {}
 
     return caseInsensitive
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] BlockStatement
helpers/array/sort.ts:79:70
       bVal = String(b[property] ?? '');
     } else {
       // Try default properties in order
-      for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
-          aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
-          break;
-        }
-      }
+      for (const prop of ['value', 'label', 'title', 'description']) {}
     }
 
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] StringLiteral
helpers/array/sort.ts:79:27
       bVal = String(b[property] ?? '');
     } else {
       // Try default properties in order
-      for (const prop of ['value', 'label', 'title', 'description']) {
+      for (const prop of ["", 'label', 'title', 'description']) {
         if (prop in a && prop in b) {
           aVal = String(a[prop] ?? '');
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] ConditionalExpression
helpers/array/sort.ts:80:13
     } else {
       // Try default properties in order
       for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
+        if (false) {
           aVal = String(a[prop] ?? '');
           bVal = String(b[prop] ?? '');
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] ConditionalExpression
helpers/array/sort.ts:80:13
     } else {
       // Try default properties in order
       for (const prop of ['value', 'label', 'title', 'description']) {
-        if (prop in a && prop in b) {
+        if (true) {
           aVal = String(a[prop] ?? '');
           bVal = String(b[prop] ?? '');
killedBy: sort functions property sorting should fallback to label when all objects have label
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] LogicalOperator
helpers/array/sort.ts:81:25
       // Try default properties in order
       for (const prop of ['value', 'label', 'title', 'description']) {
         if (prop in a && prop in b) {
-          aVal = String(a[prop] ?? '');
+          aVal = String(a[prop] && '');
           bVal = String(b[prop] ?? '');
           break;
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'c', 'a', 'z' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] LogicalOperator
helpers/array/sort.ts:82:25
       for (const prop of ['value', 'label', 'title', 'description']) {
         if (prop in a && prop in b) {
           aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
+          bVal = String(b[prop] && '');
           break;
         }
killedBy: sort functions property sorting should use default properties
statusReason: expected [ 'z', 'a', 'c' ] to deeply equal [ 'a', 'c', 'z' ]

[Killed] StringLiteral
helpers/array/sort.ts:82:36
       for (const prop of ['value', 'label', 'title', 'description']) {
         if (prop in a && prop in b) {
           aVal = String(a[prop] ?? '');
-          bVal = String(b[prop] ?? '');
+          bVal = String(b[prop] ?? "Stryker was here!");
           break;
         }
killedBy: sort functions property sorting should handle null/undefined values
statusReason: expected undefined to be null // Object.is equality

[Survived] MethodExpression
helpers/array/sort.ts:89:42
     }
 
     return caseInsensitive
-      ? aVal.toLowerCase().localeCompare(bVal.toLowerCase())
+      ? aVal.toLowerCase().localeCompare(bVal.toUpperCase())
       : aVal.localeCompare(bVal);
   };

[Survived] MethodExpression
helpers/array/sort.ts:89:9
     }
 
     return caseInsensitive
-      ? aVal.toLowerCase().localeCompare(bVal.toLowerCase())
+      ? aVal.toUpperCase().localeCompare(bVal.toLowerCase())
       : aVal.localeCompare(bVal);
   };

[Killed] BlockStatement
helpers/array/sort.ts:102:14
  */
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T
-): SortFn<T> {
-  const prop = property || 'value';
-  return (a: T, b: T) => {
-    const aVal = Number(a[prop] ?? 0);
-    const bVal = Number(b[prop] ?? 0);
-    return aVal - bVal;
-  };
-}
+): SortFn<T> {}
 
 /**
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] ConditionalExpression
helpers/array/sort.ts:103:16
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T
 ): SortFn<T> {
-  const prop = property || 'value';
+  const prop = true;
   return (a: T, b: T) => {
     const aVal = Number(a[prop] ?? 0);
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] LogicalOperator
helpers/array/sort.ts:103:16
 export function createSortByNumberFn<T extends Record<string, unknown>>(
   property?: keyof T
 ): SortFn<T> {
-  const prop = property || 'value';
+  const prop = property && 'value';
   return (a: T, b: T) => {
     const aVal = Number(a[prop] ?? 0);
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] BlockStatement
helpers/array/sort.ts:104:26
   property?: keyof T
 ): SortFn<T> {
   const prop = property || 'value';
-  return (a: T, b: T) => {
-    const aVal = Number(a[prop] ?? 0);
-    const bVal = Number(b[prop] ?? 0);
-    return aVal - bVal;
-  };
+  return (a: T, b: T) => {};
 }
 
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] LogicalOperator
helpers/array/sort.ts:105:25
 ): SortFn<T> {
   const prop = property || 'value';
   return (a: T, b: T) => {
-    const aVal = Number(a[prop] ?? 0);
+    const aVal = Number(a[prop] && 0);
     const bVal = Number(b[prop] ?? 0);
     return aVal - bVal;
killedBy: sort — property-based createSortByNumberFn: result is non-decreasing by value
statusReason: Property failed after 1 tests
{ seed: 912166165, path: "0:1:1:1:1:2:3:2:2:2:3", endOnFailure: true }
Counterexample: [[{"value":0},{"value":-1.401298464324817e-45}]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/array/sort.ts:106:25
   const prop = property || 'value';
   return (a: T, b: T) => {
     const aVal = Number(a[prop] ?? 0);
-    const bVal = Number(b[prop] ?? 0);
+    const bVal = Number(b[prop] && 0);
     return aVal - bVal;
   };
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] ArithmeticOperator
helpers/array/sort.ts:107:12
   return (a: T, b: T) => {
     const aVal = Number(a[prop] ?? 0);
     const bVal = Number(b[prop] ?? 0);
-    return aVal - bVal;
+    return aVal + bVal;
   };
 }
killedBy: sort functions property sorting should sort by number property
statusReason: expected [ 30, 25, 35 ] to deeply equal [ 25, 30, 35 ]

[Killed] BlockStatement
helpers/array/sort.ts:119:14
  */
 export function createSortByDateFn<T extends Record<string, unknown>>(
   property?: keyof T
-): SortFn<T> {
-  const prop = property || 'date';
-  return (a: T, b: T) => {
-    const aVal = new Date(a[prop] as string | number | Date).getTime();
-    const bVal = new Date(b[prop] as string | number | Date).getTime();
-    return aVal - bVal;
-  };
-}
+): SortFn<T> {}
 
killedBy: sort functions property sorting should sort by date property
statusReason: expected [ 2020, 2021, 2019 ] to deeply equal [ 2019, 2020, 2021 ]

[Killed] LogicalOperator
helpers/array/sort.ts:120:16
 export function createSortByDateFn<T extends Record<string, unknown>>(
   property?: keyof T
 ): SortFn<T> {
-  const prop = property || 'date';
+  const prop = property && 'date';
   return (a: T, b: T) => {
     const aVal = new Date(a[prop] as string | number | Date).getTime();
killedBy: sort functions property sorting should sort by date property
statusReason: expected [ 2020, 2021, 2019 ] to deeply equal [ 2019, 2020, 2021 ]

[Killed] ConditionalExpression
helpers/array/sort.ts:120:16
 export function createSortByDateFn<T extends Record<string, unknown>>(
   property?: keyof T
 ): SortFn<T> {
-  const prop = property || 'date';
+  const prop = false;
   return (a: T, b: T) => {
     const aVal = new Date(a[prop] as string | number | Date).getTime();
killedBy: sort functions property sorting should sort by date property
statusReason: expected [ 2020, 2021, 2019 ] to deeply equal [ 2019, 2020, 2021 ]

[Killed] BlockStatement
helpers/array/sort.ts:121:26
   property?: keyof T
 ): SortFn<T> {
   const prop = property || 'date';
-  return (a: T, b: T) => {
-    const aVal = new Date(a[prop] as string | number | Date).getTime();
-    const bVal = new Date(b[prop] as string | number | Date).getTime();
-    return aVal - bVal;
-  };
+  return (a: T, b: T) => {};
 }
 
killedBy: sort — contract createSortByDateFn: sorts by date property ascending
statusReason: expected [ { date: '2023-06-01' }, …(2) ] to deeply equal [ { date: '2021-01-01' }, …(2) ]

[Killed] ArithmeticOperator
helpers/array/sort.ts:124:12
   return (a: T, b: T) => {
     const aVal = new Date(a[prop] as string | number | Date).getTime();
     const bVal = new Date(b[prop] as string | number | Date).getTime();
-    return aVal - bVal;
+    return aVal + bVal;
   };
 }
killedBy: sort functions property sorting should sort by date property
statusReason: expected [ 2020, 2021, 2019 ] to deeply equal [ 2019, 2020, 2021 ]
