[Killed] BlockStatement
helpers/array/unique.ts:13:44
  * @returns New array with unique values only
  * @since 1.9.0
  */
-export function unique<T>(array: T[]): T[] {
-  return Array.from(new Set(array));
-}
+export function unique<T>(array: T[]): T[] {}
 
killedBy: unique — property-based no duplicates in result
statusReason: Property failed after 1 tests
{ seed: -1870053417, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
