[Killed] BlockStatement
helpers/array/unzip.ts:23:65
 export function unzip<A, B>(pairs: readonly [A, B][]): [A[], B[]];
 export function unzip<A, B, C>(pairs: readonly [A, B, C][]): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][]): [A[], B[], C[], D[]];
-export function unzip(pairs: readonly unknown[][]): unknown[][] {
-  if (pairs.length === 0) return [];
-  const width = pairs[0].length;
-  const result = Array.from({ length: width }, (): unknown[] => []);
-  for (const tuple of pairs) {
-    for (let i = 0; i < width; i++) {
-      result[i].push(tuple[i]);
-    }
-  }
-  return result;
-}
+export function unzip(pairs: readonly unknown[][]): unknown[][] {}
 
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 13146354, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/unzip.ts:24:7
 export function unzip<A, B, C>(pairs: readonly [A, B, C][]): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][]): [A[], B[], C[], D[]];
 export function unzip(pairs: readonly unknown[][]): unknown[][] {
-  if (pairs.length === 0) return [];
+  if (pairs.length !== 0) return [];
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 728372683, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/unzip.ts:24:7
 export function unzip<A, B, C>(pairs: readonly [A, B, C][]): [A[], B[], C[]];
 export function unzip<A, B, C, D>(pairs: readonly [A, B, C, D][]): [A[], B[], C[], D[]];
 export function unzip(pairs: readonly unknown[][]): unknown[][] {
-  if (pairs.length === 0) return [];
+  if (true) return [];
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 1527540678, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/unzip.ts:26:48
 export function unzip(pairs: readonly unknown[][]): unknown[][] {
   if (pairs.length === 0) return [];
   const width = pairs[0].length;
-  const result = Array.from({ length: width }, (): unknown[] => []);
+  const result = Array.from({ length: width }, () => undefined);
   for (const tuple of pairs) {
     for (let i = 0; i < width; i++) {
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 92773208, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
helpers/array/unzip.ts:26:29
 export function unzip(pairs: readonly unknown[][]): unknown[][] {
   if (pairs.length === 0) return [];
   const width = pairs[0].length;
-  const result = Array.from({ length: width }, (): unknown[] => []);
+  const result = Array.from({}, (): unknown[] => []);
   for (const tuple of pairs) {
     for (let i = 0; i < width; i++) {
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 1452145029, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/array/unzip.ts:27:30
   if (pairs.length === 0) return [];
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);
-  for (const tuple of pairs) {
-    for (let i = 0; i < width; i++) {
-      result[i].push(tuple[i]);
-    }
-  }
+  for (const tuple of pairs) {}
   return result;
 }
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: -1514978262, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/array/unzip.ts:28:21
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);
   for (const tuple of pairs) {
-    for (let i = 0; i < width; i++) {
+    for (let i = 0; i <= width; i++) {
       result[i].push(tuple[i]);
     }
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 1359508488, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/array/unzip.ts:28:21
   const width = pairs[0].length;
   const result = Array.from({ length: width }, (): unknown[] => []);
   for (const tuple of pairs) {
-    for (let i = 0; i < width; i++) {
+    for (let i = 0; false; i++) {
       result[i].push(tuple[i]);
     }
killedBy: unzip splits pairs into two arrays
statusReason: expected [] to deeply equal [ 1, 2, 3 ]
