[Killed] BlockStatement
helpers/array/without.ts:23:70
  * without(['a', 'b', 'c'], 'b');      // ['a', 'c']
  * @since next
  */
-export function without<T>(array: readonly T[], ...values: T[]): T[] {
-  const excluded = new Set(values);
-  return array.filter((item) => !excluded.has(item));
-}
+export function without<T>(array: readonly T[], ...values: T[]): T[] {}
 
killedBy: without removes a single value
statusReason: expected undefined to deeply equal [ 1, 3, 4 ]

[Killed] ArrowFunction
helpers/array/without.ts:25:23
  */
 export function without<T>(array: readonly T[], ...values: T[]): T[] {
   const excluded = new Set(values);
-  return array.filter((item) => !excluded.has(item));
+  return array.filter(() => undefined);
 }
 
killedBy: without removes a single value
statusReason: expected [] to deeply equal [ 1, 3, 4 ]

[Killed] MethodExpression
helpers/array/without.ts:25:10
  */
 export function without<T>(array: readonly T[], ...values: T[]): T[] {
   const excluded = new Set(values);
-  return array.filter((item) => !excluded.has(item));
+  return array;
 }
 
killedBy: without removes a single value
statusReason: expected [ 1, 2, 3, 2, 4 ] to deeply equal [ 1, 3, 4 ]
