[Killed] BlockStatement
helpers/array/zip.ts:28:78
 export function zip<A, B>(a: readonly A[], b: readonly B[]): [A, B][];
 export function zip<A, B, C>(a: readonly A[], b: readonly B[], c: readonly C[]): [A, B, C][];
 export function zip<A, B, C, D>(a: readonly A[], b: readonly B[], c: readonly C[], d: readonly D[]): [A, B, C, D][];
-export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
-  if (arrays.length === 0) return [];
-  const length = Math.min(...arrays.map(a => a.length));
-  return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
-}
+export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {}
 
killedBy: zip zips two arrays of equal length
statusReason: expected undefined to deeply equal [ [ 1, 'a' ], [ 2, 'b' ], [ 3, 'c' ] ]

[Killed] ConditionalExpression
helpers/array/zip.ts:29:7
 export function zip<A, B, C>(a: readonly A[], b: readonly B[], c: readonly C[]): [A, B, C][];
 export function zip<A, B, C, D>(a: readonly A[], b: readonly B[], c: readonly C[], d: readonly D[]): [A, B, C, D][];
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
-  if (arrays.length === 0) return [];
+  if (false) return [];
   const length = Math.min(...arrays.map(a => a.length));
   return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
killedBy: zip returns empty array when called with no arrays
statusReason: Invalid array length

[Killed] EqualityOperator
helpers/array/zip.ts:29:7
 export function zip<A, B, C>(a: readonly A[], b: readonly B[], c: readonly C[]): [A, B, C][];
 export function zip<A, B, C, D>(a: readonly A[], b: readonly B[], c: readonly C[], d: readonly D[]): [A, B, C, D][];
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
-  if (arrays.length === 0) return [];
+  if (arrays.length !== 0) return [];
   const length = Math.min(...arrays.map(a => a.length));
   return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
killedBy: zip zips two arrays of equal length
statusReason: expected [] to deeply equal [ [ 1, 'a' ], [ 2, 'b' ], [ 3, 'c' ] ]

[Killed] MethodExpression
helpers/array/zip.ts:30:18
 export function zip<A, B, C, D>(a: readonly A[], b: readonly B[], c: readonly C[], d: readonly D[]): [A, B, C, D][];
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
   if (arrays.length === 0) return [];
-  const length = Math.min(...arrays.map(a => a.length));
+  const length = Math.max(...arrays.map(a => a.length));
   return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
 }
killedBy: zip truncates to the shorter array
statusReason: expected [ [ 1, 'a' ], [ 2, 'b' ], …(1) ] to deeply equal [ [ 1, 'a' ], [ 2, 'b' ] ]

[Killed] ArrowFunction
helpers/array/zip.ts:30:41
 export function zip<A, B, C, D>(a: readonly A[], b: readonly B[], c: readonly C[], d: readonly D[]): [A, B, C, D][];
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
   if (arrays.length === 0) return [];
-  const length = Math.min(...arrays.map(a => a.length));
+  const length = Math.min(...arrays.map(() => undefined));
   return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
 }
killedBy: zip zips two arrays of equal length
statusReason: expected [] to deeply equal [ [ 1, 'a' ], [ 2, 'b' ], [ 3, 'c' ] ]

[Killed] ArrowFunction
helpers/array/zip.ts:31:33
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
   if (arrays.length === 0) return [];
   const length = Math.min(...arrays.map(a => a.length));
-  return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
+  return Array.from({ length }, () => undefined);
 }
 
killedBy: unzip — property-based unzip(zip(a, b)) === [a, b] (roundtrip)
statusReason: Property failed after 1 tests
{ seed: 1656528589, path: "0:0:0", endOnFailure: true }
Counterexample: [[0],[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/array/zip.ts:31:54
 export function zip(...arrays: readonly (readonly unknown[])[]): unknown[][] {
   if (arrays.length === 0) return [];
   const length = Math.min(...arrays.map(a => a.length));
-  return Array.from({ length }, (_, i) => arrays.map(a => a[i]));
+  return Array.from({ length }, (_, i) => arrays.map(() => undefined));
 }
 
killedBy: zip zips two arrays of equal length
statusReason: expected [ [ undefined, undefined ], …(2) ] to deeply equal [ [ 1, 'a' ], [ 2, 'b' ], [ 3, 'c' ] ]
