[Killed] BlockStatement
helpers/ci/buildStatusTable.ts:28:72
  * // => '| ✅ | **Unit Tests** | `passing` |\n| ❌ | **Lint** | `failing` |'
  * @since next
  */
-export function buildStatusTable(jobs: Record<string, string>): string {
-  return Object.entries(jobs)
-    .map(([job, status]) => {
-      const safeJob = job
-        .replace(/\\/g, '\\\\')
-        .replace(/\|/g, '\\|')
-        .replace(/\n/g, ' ')
-        .replace(/\*/g, '\\*')
-        .replace(/_/g, '\\_')
-        .replace(/`/g, '\\`');
-      return `| ${statusToIcon(status)} | **${safeJob}** | ${statusToBadge(status)} |`;
-    })
-    .join('\n');
-}
+export function buildStatusTable(jobs: Record<string, string>): string {}
 
killedBy: buildStatusTable — property-based row count equals number of jobs
statusReason: Property failed after 1 tests
{ seed: -1431732668, path: "0", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/ci/buildStatusTable.ts:30:29
  */
 export function buildStatusTable(jobs: Record<string, string>): string {
   return Object.entries(jobs)
-    .map(([job, status]) => {
-      const safeJob = job
-        .replace(/\\/g, '\\\\')
-        .replace(/\|/g, '\\|')
-        .replace(/\n/g, ' ')
-        .replace(/\*/g, '\\*')
-        .replace(/_/g, '\\_')
-        .replace(/`/g, '\\`');
-      return `| ${statusToIcon(status)} | **${safeJob}** | ${statusToBadge(status)} |`;
-    })
+    .map(([job, status]) => {})
     .join('\n');
 }
killedBy: buildStatusTable — property-based each row starts with | and ends with |
statusReason: Property failed after 1 tests
{ seed: -2023727439, path: "0:0:0", endOnFailure: true }
Counterexample: [[" "]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
helpers/ci/buildStatusTable.ts:32:25
   return Object.entries(jobs)
     .map(([job, status]) => {
       const safeJob = job
-        .replace(/\\/g, '\\\\')
+        .replace(/\\/g, "")
         .replace(/\|/g, '\\|')
         .replace(/\n/g, ' ')

[Survived] StringLiteral
helpers/ci/buildStatusTable.ts:33:25
     .map(([job, status]) => {
       const safeJob = job
         .replace(/\\/g, '\\\\')
-        .replace(/\|/g, '\\|')
+        .replace(/\|/g, "")
         .replace(/\n/g, ' ')
         .replace(/\*/g, '\\*')

[Survived] StringLiteral
helpers/ci/buildStatusTable.ts:36:24
         .replace(/\|/g, '\\|')
         .replace(/\n/g, ' ')
         .replace(/\*/g, '\\*')
-        .replace(/_/g, '\\_')
+        .replace(/_/g, "")
         .replace(/`/g, '\\`');
       return `| ${statusToIcon(status)} | **${safeJob}** | ${statusToBadge(status)} |`;

[Killed] StringLiteral
helpers/ci/buildStatusTable.ts:38:14
         .replace(/\*/g, '\\*')
         .replace(/_/g, '\\_')
         .replace(/`/g, '\\`');
-      return `| ${statusToIcon(status)} | **${safeJob}** | ${statusToBadge(status)} |`;
+      return ``;
     })
     .join('\n');
killedBy: buildStatusTable — property-based each row starts with | and ends with |
statusReason: Property failed after 1 tests
{ seed: 1104397309, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[" "]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/ci/buildStatusTable.ts:40:11
         .replace(/`/g, '\\`');
       return `| ${statusToIcon(status)} | **${safeJob}** | ${statusToBadge(status)} |`;
     })
-    .join('\n');
+    .join("");
 }
 
killedBy: buildStatusTable — property-based row count equals number of jobs
statusReason: Property failed after 2 tests
{ seed: -289031490, path: "1:1:1:1:2:3:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [[" ","!"]]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
