[Killed] BlockStatement
helpers/ci/statusToBadge.ts:29:57
  * statusToBadge('pending')  // => '`unknown`'
  * @since next
  */
-export function statusToBadge(status: CiStatus): string {
-  switch (status) {
-    case 'success': return '`passing`';
-    case 'failure': return '`failing`';
-    case 'skipped': return '`skipped`';
-    default: return '`unknown`';
-  }
-}
+export function statusToBadge(status: CiStatus): string {}
 
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| ✅ | **Unit Tests** | undefined |' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToBadge.ts:31:5
  */
 export function statusToBadge(status: CiStatus): string {
   switch (status) {
-    case 'success': return '`passing`';
+    case 'success':
     case 'failure': return '`failing`';
     case 'skipped': return '`skipped`';
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| ✅ | **Unit Tests** | `failing` |' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] StringLiteral
helpers/ci/statusToBadge.ts:31:10
  */
 export function statusToBadge(status: CiStatus): string {
   switch (status) {
-    case 'success': return '`passing`';
+    case "": return '`passing`';
     case 'failure': return '`failing`';
     case 'skipped': return '`skipped`';
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| ✅ | **Unit Tests** | `unknown` |' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToBadge.ts:32:5
 export function statusToBadge(status: CiStatus): string {
   switch (status) {
     case 'success': return '`passing`';
-    case 'failure': return '`failing`';
+    case 'failure':
     case 'skipped': return '`skipped`';
     default: return '`unknown`';
killedBy: buildStatusTable formats a failure row correctly
statusReason: expected '| ❌ | **Lint** | `skipped` |' to be '| ❌ | **Lint** | `failing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToBadge.ts:33:5
   switch (status) {
     case 'success': return '`passing`';
     case 'failure': return '`failing`';
-    case 'skipped': return '`skipped`';
+    case 'skipped':
     default: return '`unknown`';
   }
killedBy: buildStatusTable formats a skipped row correctly
statusReason: expected '| ⏭️ | **Deploy** | `unknown` |' to be '| ⏭️ | **Deploy** | `skipped` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToBadge.ts:34:5
     case 'success': return '`passing`';
     case 'failure': return '`failing`';
     case 'skipped': return '`skipped`';
-    default: return '`unknown`';
+    default:
   }
 }
killedBy: statusToBadge returns `unknown` for unknown
statusReason: expected undefined to be '`unknown`' // Object.is equality
