[Killed] BlockStatement
helpers/ci/statusToIcon.ts:29:56
  * statusToIcon('pending')  // => '⚠️'
  * @since next
  */
-export function statusToIcon(status: CiStatus): string {
-  switch (status) {
-    case 'success': return '✅';
-    case 'failure': return '❌';
-    case 'skipped': return '⏭️';
-    default: return '⚠️';
-  }
-}
+export function statusToIcon(status: CiStatus): string {}
 
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| undefined | **Unit Tests** | `passi…' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToIcon.ts:31:5
  */
 export function statusToIcon(status: CiStatus): string {
   switch (status) {
-    case 'success': return '✅';
+    case 'success':
     case 'failure': return '❌';
     case 'skipped': return '⏭️';
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| ❌ | **Unit Tests** | `passing` |' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] StringLiteral
helpers/ci/statusToIcon.ts:31:10
  */
 export function statusToIcon(status: CiStatus): string {
   switch (status) {
-    case 'success': return '✅';
+    case "": return '✅';
     case 'failure': return '❌';
     case 'skipped': return '⏭️';
killedBy: buildStatusTable formats a success row correctly
statusReason: expected '| ⚠️ | **Unit Tests** | `passing` |' to be '| ✅ | **Unit Tests** | `passing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToIcon.ts:32:5
 export function statusToIcon(status: CiStatus): string {
   switch (status) {
     case 'success': return '✅';
-    case 'failure': return '❌';
+    case 'failure':
     case 'skipped': return '⏭️';
     default: return '⚠️';
killedBy: buildStatusTable formats a failure row correctly
statusReason: expected '| ⏭️ | **Lint** | `failing` |' to be '| ❌ | **Lint** | `failing` |' // Object.is equality

[Killed] StringLiteral
helpers/ci/statusToIcon.ts:32:28
 export function statusToIcon(status: CiStatus): string {
   switch (status) {
     case 'success': return '✅';
-    case 'failure': return '❌';
+    case 'failure': return "";
     case 'skipped': return '⏭️';
     default: return '⚠️';
killedBy: buildStatusTable formats a failure row correctly
statusReason: expected '|  | **Lint** | `failing` |' to be '| ❌ | **Lint** | `failing` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToIcon.ts:33:5
   switch (status) {
     case 'success': return '✅';
     case 'failure': return '❌';
-    case 'skipped': return '⏭️';
+    case 'skipped':
     default: return '⚠️';
   }
killedBy: buildStatusTable formats a skipped row correctly
statusReason: expected '| ⚠️ | **Deploy** | `skipped` |' to be '| ⏭️ | **Deploy** | `skipped` |' // Object.is equality

[Killed] StringLiteral
helpers/ci/statusToIcon.ts:33:28
   switch (status) {
     case 'success': return '✅';
     case 'failure': return '❌';
-    case 'skipped': return '⏭️';
+    case 'skipped': return "";
     default: return '⚠️';
   }
killedBy: buildStatusTable formats a skipped row correctly
statusReason: expected '|  | **Deploy** | `skipped` |' to be '| ⏭️ | **Deploy** | `skipped` |' // Object.is equality

[Killed] ConditionalExpression
helpers/ci/statusToIcon.ts:34:5
     case 'success': return '✅';
     case 'failure': return '❌';
     case 'skipped': return '⏭️';
-    default: return '⚠️';
+    default:
   }
 }
killedBy: statusToIcon returns ⚠️ for unknown
statusReason: expected undefined to be '⚠️' // Object.is equality

[Killed] StringLiteral
helpers/ci/statusToIcon.ts:34:21
     case 'success': return '✅';
     case 'failure': return '❌';
     case 'skipped': return '⏭️';
-    default: return '⚠️';
+    default: return "";
   }
 }
killedBy: statusToIcon returns ⚠️ for unknown
statusReason: expected '' to be '⚠️' // Object.is equality
