[Survived] Regex
helpers/commit/analyzeCommits.ts:10:25
 import { parseConventionalCommit } from './parseConventionalCommit';
 import type { AnalyzableCommit, CommitAnalysis, CommitVersionBump } from './types';
 
-const BREAKING_MARKER = /^BREAKING[ -]CHANGE: /m;
+const BREAKING_MARKER = /BREAKING[ -]CHANGE: /m;
 
 /**

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:36:28
  * @since next
  */
 export function analyzeCommits(commits: readonly AnalyzableCommit[]): CommitAnalysis {
-  let hasBreakingChanges = false;
+  let hasBreakingChanges = true;
   let hasFeatures = false;
   let hasFixes = false;
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'major' to be 'patch' // Object.is equality

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:37:21
  */
 export function analyzeCommits(commits: readonly AnalyzableCommit[]): CommitAnalysis {
   let hasBreakingChanges = false;
-  let hasFeatures = false;
+  let hasFeatures = true;
   let hasFixes = false;
 
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'minor' to be 'patch' // Object.is equality

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:38:18
 export function analyzeCommits(commits: readonly AnalyzableCommit[]): CommitAnalysis {
   let hasBreakingChanges = false;
   let hasFeatures = false;
-  let hasFixes = false;
+  let hasFixes = true;
 
   for (const commit of commits) {
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'Bug fixes detected in commits' to be 'No commits to analyse' // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:40:33
   let hasFeatures = false;
   let hasFixes = false;
 
-  for (const commit of commits) {
-    const fullMessage = commit.body
-      ? `${commit.subject}\n\n${commit.body}`
-      : commit.subject;
-    const parsed = parseConventionalCommit(fullMessage);
-
-    if (parsed) {
-      if (parsed.breaking) hasBreakingChanges = true;
-      if (parsed.type === 'feat') hasFeatures = true;
-      if (parsed.type === 'fix') hasFixes = true;
-    } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
-      hasBreakingChanges = true;
-    }
-  }
+  for (const commit of commits) {}
 
   let suggestedBump: CommitVersionBump;
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected 'patch' to be 'major' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:46:9
       : commit.subject;
     const parsed = parseConventionalCommit(fullMessage);
 
-    if (parsed) {
+    if (false) {
       if (parsed.breaking) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected 'patch' to be 'major' // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:46:17
       : commit.subject;
     const parsed = parseConventionalCommit(fullMessage);
 
-    if (parsed) {
-      if (parsed.breaking) hasBreakingChanges = true;
-      if (parsed.type === 'feat') hasFeatures = true;
-      if (parsed.type === 'fix') hasFixes = true;
-    } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
+    if (parsed) {} else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
       hasBreakingChanges = true;
     }
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected 'patch' to be 'major' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:47:11
     const parsed = parseConventionalCommit(fullMessage);
 
     if (parsed) {
-      if (parsed.breaking) hasBreakingChanges = true;
+      if (true) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
killedBy: analyzeCommits suggests minor when only features are present
statusReason: expected 'major' to be 'minor' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:47:11
     const parsed = parseConventionalCommit(fullMessage);
 
     if (parsed) {
-      if (parsed.breaking) hasBreakingChanges = true;
+      if (false) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected 'minor' to be 'major' // Object.is equality

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:48:49
 
     if (parsed) {
       if (parsed.breaking) hasBreakingChanges = true;
-      if (parsed.type === 'feat') hasFeatures = true;
+      if (parsed.type === 'feat') hasFeatures = false;
       if (parsed.type === 'fix') hasFixes = true;
     } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:48:11
 
     if (parsed) {
       if (parsed.breaking) hasBreakingChanges = true;
-      if (parsed.type === 'feat') hasFeatures = true;
+      if (false) hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
     } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:49:11
     if (parsed) {
       if (parsed.breaking) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
-      if (parsed.type === 'fix') hasFixes = true;
+      if (true) hasFixes = true;
     } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
       hasBreakingChanges = true;
killedBy: analyzeCommits ignores non-feat/fix conventional types for the suggestion
statusReason: expected 'Bug fixes detected in commits' to be 'Changes detected but no conventional …' // Object.is equality

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:49:45
     if (parsed) {
       if (parsed.breaking) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
-      if (parsed.type === 'fix') hasFixes = true;
+      if (parsed.type === 'fix') hasFixes = false;
     } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
       hasBreakingChanges = true;
killedBy: analyzeCommits suggests patch when only fixes are present
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:50:89
       if (parsed.breaking) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
-    } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
-      hasBreakingChanges = true;
-    }
+    } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {}
   }
 
killedBy: analyzeCommits detects BREAKING CHANGE in body of non-conventional commits
statusReason: expected 'patch' to be 'major' // Object.is equality

[Killed] LogicalOperator
helpers/commit/analyzeCommits.ts:50:16
       if (parsed.breaking) hasBreakingChanges = true;
       if (parsed.type === 'feat') hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
-    } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
+    } else if (commit.body || BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
       hasBreakingChanges = true;
     }
killedBy: analyzeCommits falls back to patch when commits exist but none are conventional
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BooleanLiteral
helpers/commit/analyzeCommits.ts:51:28
       if (parsed.type === 'feat') hasFeatures = true;
       if (parsed.type === 'fix') hasFixes = true;
     } else if (commit.body && BREAKING_MARKER.test(commit.body.replace(/\r\n/g, '\n'))) {
-      hasBreakingChanges = true;
+      hasBreakingChanges = false;
     }
   }
killedBy: analyzeCommits detects BREAKING CHANGE in body of non-conventional commits
statusReason: expected 'patch' to be 'major' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:58:7
   let suggestedBump: CommitVersionBump;
   let reason: string;
 
-  if (hasBreakingChanges) {
+  if (false) {
     suggestedBump = 'major';
     reason = 'Breaking changes detected in commits';
killedBy: analyzeCommits suggests major when a commit has the `!` marker
statusReason: expected 'minor' to be 'major' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:58:7
   let suggestedBump: CommitVersionBump;
   let reason: string;
 
-  if (hasBreakingChanges) {
+  if (true) {
     suggestedBump = 'major';
     reason = 'Breaking changes detected in commits';
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'major' to be 'patch' // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:61:27
   if (hasBreakingChanges) {
     suggestedBump = 'major';
     reason = 'Breaking changes detected in commits';
-  } else if (hasFeatures) {
-    suggestedBump = 'minor';
-    reason = 'New features detected in commits';
-  } else if (hasFixes) {
+  } else if (hasFeatures) {} else if (hasFixes) {
     suggestedBump = 'patch';
     reason = 'Bug fixes detected in commits';
killedBy: analyzeCommits suggests minor when only features are present
statusReason: expected undefined to be 'minor' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:61:14
   if (hasBreakingChanges) {
     suggestedBump = 'major';
     reason = 'Breaking changes detected in commits';
-  } else if (hasFeatures) {
+  } else if (true) {
     suggestedBump = 'minor';
     reason = 'New features detected in commits';
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'minor' to be 'patch' // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:64:24
   } else if (hasFeatures) {
     suggestedBump = 'minor';
     reason = 'New features detected in commits';
-  } else if (hasFixes) {
-    suggestedBump = 'patch';
-    reason = 'Bug fixes detected in commits';
-  } else if (commits.length > 0) {
+  } else if (hasFixes) {} else if (commits.length > 0) {
     suggestedBump = 'patch';
     reason = 'Changes detected but no conventional commit types found';
killedBy: analyzeCommits suggests patch when only fixes are present
statusReason: expected undefined to be 'patch' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:64:14
   } else if (hasFeatures) {
     suggestedBump = 'minor';
     reason = 'New features detected in commits';
-  } else if (hasFixes) {
+  } else if (true) {
     suggestedBump = 'patch';
     reason = 'Bug fixes detected in commits';
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected 'Bug fixes detected in commits' to be 'No commits to analyse' // Object.is equality

[Survived] StringLiteral
helpers/commit/analyzeCommits.ts:66:14
     reason = 'New features detected in commits';
   } else if (hasFixes) {
     suggestedBump = 'patch';
-    reason = 'Bug fixes detected in commits';
+    reason = "";
   } else if (commits.length > 0) {
     suggestedBump = 'patch';

[Killed] EqualityOperator
helpers/commit/analyzeCommits.ts:67:14
   } else if (hasFixes) {
     suggestedBump = 'patch';
     reason = 'Bug fixes detected in commits';
-  } else if (commits.length > 0) {
+  } else if (commits.length <= 0) {
     suggestedBump = 'patch';
     reason = 'Changes detected but no conventional commit types found';
killedBy: analyzeCommits — contract empty list → patch / "No commits to analyse"
statusReason: expected { suggestedBump: 'patch', …(4) } to deeply equal { suggestedBump: 'patch', …(4) }

[Killed] ConditionalExpression
helpers/commit/analyzeCommits.ts:67:14
   } else if (hasFixes) {
     suggestedBump = 'patch';
     reason = 'Bug fixes detected in commits';
-  } else if (commits.length > 0) {
+  } else if (true) {
     suggestedBump = 'patch';
     reason = 'Changes detected but no conventional commit types found';
killedBy: analyzeCommits — contract empty list → patch / "No commits to analyse"
statusReason: expected { suggestedBump: 'patch', …(4) } to deeply equal { suggestedBump: 'patch', …(4) }

[Killed] StringLiteral
helpers/commit/analyzeCommits.ts:68:21
     suggestedBump = 'patch';
     reason = 'Bug fixes detected in commits';
   } else if (commits.length > 0) {
-    suggestedBump = 'patch';
+    suggestedBump = "";
     reason = 'Changes detected but no conventional commit types found';
   } else {
killedBy: analyzeCommits falls back to patch when commits exist but none are conventional
statusReason: expected '' to be 'patch' // Object.is equality

[Killed] BlockStatement
helpers/commit/analyzeCommits.ts:70:10
   } else if (commits.length > 0) {
     suggestedBump = 'patch';
     reason = 'Changes detected but no conventional commit types found';
-  } else {
-    suggestedBump = 'patch';
-    reason = 'No commits to analyse';
-  }
+  } else {}
 
   return {
killedBy: analyzeCommits — contract empty list → patch / "No commits to analyse"
statusReason: expected { suggestedBump: undefined, …(4) } to deeply equal { suggestedBump: 'patch', …(4) }

[Killed] StringLiteral
helpers/commit/analyzeCommits.ts:72:14
     reason = 'Changes detected but no conventional commit types found';
   } else {
     suggestedBump = 'patch';
-    reason = 'No commits to analyse';
+    reason = "";
   }
 
killedBy: analyzeCommits — contract empty list → patch / "No commits to analyse"
statusReason: expected { suggestedBump: 'patch', …(4) } to deeply equal { suggestedBump: 'patch', …(4) }

[Killed] ObjectLiteral
helpers/commit/analyzeCommits.ts:75:10
     reason = 'No commits to analyse';
   }
 
-  return {
-    suggestedBump,
-    reason,
-    hasBreakingChanges,
-    hasFeatures,
-    hasFixes,
-  };
+  return {};
 }
 
killedBy: analyzeCommits returns patch with no-commits reason for an empty list
statusReason: expected undefined to be 'patch' // Object.is equality
