[Survived] Regex
helpers/commit/parseConventionalCommit.ts:10:21
 import { buildConventionalCommitRegex } from './buildConventionalCommitRegex';
 import type { ConventionalCommitOptions, ParsedConventionalCommit } from './types';
 
-const FOOTER_LINE = /^(?:BREAKING[ -]CHANGE|[A-Za-z][A-Za-z0-9-]*)(?:: | #)/;
+const FOOTER_LINE = /(?:BREAKING[ -]CHANGE|[A-Za-z][A-Za-z0-9-]*)(?:: | #)/;
 const BREAKING_FOOTER = /^BREAKING[ -]CHANGE: /m;
 

[Survived] Regex
helpers/commit/parseConventionalCommit.ts:11:25
 import type { ConventionalCommitOptions, ParsedConventionalCommit } from './types';
 
 const FOOTER_LINE = /^(?:BREAKING[ -]CHANGE|[A-Za-z][A-Za-z0-9-]*)(?:: | #)/;
-const BREAKING_FOOTER = /^BREAKING[ -]CHANGE: /m;
+const BREAKING_FOOTER = /BREAKING[ -]CHANGE: /m;
 
 function splitBodyAndFooter(rest: string): { body: string; footer: string } {

[Killed] BlockStatement
helpers/commit/parseConventionalCommit.ts:13:77
 const FOOTER_LINE = /^(?:BREAKING[ -]CHANGE|[A-Za-z][A-Za-z0-9-]*)(?:: | #)/;
 const BREAKING_FOOTER = /^BREAKING[ -]CHANGE: /m;
 
-function splitBodyAndFooter(rest: string): { body: string; footer: string } {
-  if (rest.length === 0) return { body: '', footer: '' };
-
-  const paragraphs = rest.split(/\n{2,}/);
-  const last = paragraphs[paragraphs.length - 1];
-  const lastLines = last.split('\n');
-  const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
-
-  if (isFooter && paragraphs.length > 1) {
-    return {
-      body: paragraphs.slice(0, -1).join('\n\n'),
-      footer: last,
-    };
-  }
-
-  if (isFooter && paragraphs.length === 1) {
-    return { body: '', footer: last };
-  }
-
-  return { body: rest, footer: '' };
-}
+function splitBodyAndFooter(rest: string): { body: string; footer: string } {}
 
 /**
killedBy: parseConventionalCommit subject line parses type and description
statusReason: Cannot destructure property 'body' of 'splitBodyAndFooter(...)' as it is undefined.

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:14:7
 const BREAKING_FOOTER = /^BREAKING[ -]CHANGE: /m;
 
 function splitBodyAndFooter(rest: string): { body: string; footer: string } {
-  if (rest.length === 0) return { body: '', footer: '' };
+  if (rest.length !== 0) return { body: '', footer: '' };
 
   const paragraphs = rest.split(/\n{2,}/);
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected '' to be 'Detailed body here' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:14:7
 const BREAKING_FOOTER = /^BREAKING[ -]CHANGE: /m;
 
 function splitBodyAndFooter(rest: string): { body: string; footer: string } {
-  if (rest.length === 0) return { body: '', footer: '' };
+  if (true) return { body: '', footer: '' };
 
   const paragraphs = rest.split(/\n{2,}/);
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected '' to be 'Detailed body here' // Object.is equality

[Killed] ArithmeticOperator
helpers/commit/parseConventionalCommit.ts:17:27
   if (rest.length === 0) return { body: '', footer: '' };
 
   const paragraphs = rest.split(/\n{2,}/);
-  const last = paragraphs[paragraphs.length - 1];
+  const last = paragraphs[paragraphs.length + 1];
   const lastLines = last.split('\n');
   const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] MethodExpression
helpers/commit/parseConventionalCommit.ts:19:20
   const paragraphs = rest.split(/\n{2,}/);
   const last = paragraphs[paragraphs.length - 1];
   const lastLines = last.split('\n');
-  const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
+  const isFooter = lastLines.some(line => FOOTER_LINE.test(line));
 
   if (isFooter && paragraphs.length > 1) {
killedBy: parseConventionalCommit body and footer treats trailing block as body when not all lines are footer tokens
statusReason: expected 'Mostly text\nRefs: #1' to be '' // Object.is equality

[Killed] ArrowFunction
helpers/commit/parseConventionalCommit.ts:19:36
   const paragraphs = rest.split(/\n{2,}/);
   const last = paragraphs[paragraphs.length - 1];
   const lastLines = last.split('\n');
-  const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
+  const isFooter = lastLines.every(() => undefined);
 
   if (isFooter && paragraphs.length > 1) {
killedBy: parseConventionalCommit body and footer extracts a footer-only message
statusReason: expected 'Refs: #1\nReviewed-by: alice' to be '' // Object.is equality

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:21:19
   const lastLines = last.split('\n');
   const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
 
-  if (isFooter && paragraphs.length > 1) {
+  if (isFooter && paragraphs.length <= 1) {
     return {
       body: paragraphs.slice(0, -1).join('\n\n'),
killedBy: parseConventionalCommit body and footer separates body from footer
statusReason: expected 'Body paragraph.\n\nRefs: #1' to be 'Body paragraph.' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:21:7
   const lastLines = last.split('\n');
   const isFooter = lastLines.every(line => FOOTER_LINE.test(line));
 
-  if (isFooter && paragraphs.length > 1) {
+  if (true) {
     return {
       body: paragraphs.slice(0, -1).join('\n\n'),
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected '' to be 'Detailed body here' // Object.is equality

[Killed] UnaryOperator
helpers/commit/parseConventionalCommit.ts:23:33
 
   if (isFooter && paragraphs.length > 1) {
     return {
-      body: paragraphs.slice(0, -1).join('\n\n'),
+      body: paragraphs.slice(0, +1).join('\n\n'),
       footer: last,
     };
killedBy: parseConventionalCommit body and footer keeps multi-paragraph body intact
statusReason: expected 'First.' to be 'First.\n\nSecond.' // Object.is equality

[Killed] MethodExpression
helpers/commit/parseConventionalCommit.ts:23:13
 
   if (isFooter && paragraphs.length > 1) {
     return {
-      body: paragraphs.slice(0, -1).join('\n\n'),
+      body: paragraphs.join('\n\n'),
       footer: last,
     };
killedBy: parseConventionalCommit body and footer separates body from footer
statusReason: expected 'Body paragraph.\n\nRefs: #1' to be 'Body paragraph.' // Object.is equality

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:28:19
     };
   }
 
-  if (isFooter && paragraphs.length === 1) {
+  if (isFooter && paragraphs.length !== 1) {
     return { body: '', footer: last };
   }
killedBy: parseConventionalCommit body and footer extracts a footer-only message
statusReason: expected 'Refs: #1\nReviewed-by: alice' to be '' // Object.is equality

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:28:7
     };
   }
 
-  if (isFooter && paragraphs.length === 1) {
+  if (true) {
     return { body: '', footer: last };
   }
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected '' to be 'Detailed body here' // Object.is equality

[Killed] StringLiteral
helpers/commit/parseConventionalCommit.ts:32:32
     return { body: '', footer: last };
   }
 
-  return { body: rest, footer: '' };
+  return { body: rest, footer: "Stryker was here!" };
 }
 
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
helpers/commit/parseConventionalCommit.ts:56:36
 export function parseConventionalCommit(
   message: string,
   options?: ConventionalCommitOptions,
-): ParsedConventionalCommit | null {
-  if (typeof message !== 'string' || message.length === 0) return null;
-
-  const normalized = message.replace(/\r\n/g, '\n');
-  const newlineIndex = normalized.indexOf('\n');
-  const subject = newlineIndex === -1 ? normalized : normalized.slice(0, newlineIndex);
-  const rest = newlineIndex === -1 ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
-
-  const regex = buildConventionalCommitRegex(options);
-  const match = regex.exec(subject);
-  if (!match) return null;
-
-  const [, type, scope, breakingMarker, description] = match;
-  const { body, footer } = splitBodyAndFooter(rest);
-  const breaking = breakingMarker === '!' || BREAKING_FOOTER.test(`${body}\n${footer}`);
-
-  return {
-    type,
-    scope: scope ?? null,
-    breaking,
-    description,
-    body,
-    footer,
-  };
-}
+): ParsedConventionalCommit | null {}
 
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected undefined to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:57:7
   message: string,
   options?: ConventionalCommitOptions,
 ): ParsedConventionalCommit | null {
-  if (typeof message !== 'string' || message.length === 0) return null;
+  if (true) return null;
 
   const normalized = message.replace(/\r\n/g, '\n');
killedBy: analyzeCommits — property-based any non-empty list of feat commits suggests minor
statusReason: Property failed after 1 tests
{ seed: 1059788283, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[{"subject":"feat: A"}]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:57:7
   message: string,
   options?: ConventionalCommitOptions,
 ): ParsedConventionalCommit | null {
-  if (typeof message !== 'string' || message.length === 0) return null;
+  if (typeof message === 'string' || message.length === 0) return null;
 
   const normalized = message.replace(/\r\n/g, '\n');
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected null to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:61:19
 
   const normalized = message.replace(/\r\n/g, '\n');
   const newlineIndex = normalized.indexOf('\n');
-  const subject = newlineIndex === -1 ? normalized : normalized.slice(0, newlineIndex);
+  const subject = false ? normalized : normalized.slice(0, newlineIndex);
   const rest = newlineIndex === -1 ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
 
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected { type: 'feat', scope: null, …(4) } to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:62:16
   const normalized = message.replace(/\r\n/g, '\n');
   const newlineIndex = normalized.indexOf('\n');
   const subject = newlineIndex === -1 ? normalized : normalized.slice(0, newlineIndex);
-  const rest = newlineIndex === -1 ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
+  const rest = true ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
 
   const regex = buildConventionalCommitRegex(options);
killedBy: parseConventionalCommit body and footer extracts a body without footer
statusReason: expected '' to be 'Detailed body here' // Object.is equality

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:62:16
   const normalized = message.replace(/\r\n/g, '\n');
   const newlineIndex = normalized.indexOf('\n');
   const subject = newlineIndex === -1 ? normalized : normalized.slice(0, newlineIndex);
-  const rest = newlineIndex === -1 ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
+  const rest = newlineIndex !== -1 ? '' : normalized.slice(newlineIndex + 1).replace(/^\n+/, '').replace(/\n+$/, '');
 
   const regex = buildConventionalCommitRegex(options);
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected { type: 'feat', scope: null, …(4) } to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] BooleanLiteral
helpers/commit/parseConventionalCommit.ts:66:7
 
   const regex = buildConventionalCommitRegex(options);
   const match = regex.exec(subject);
-  if (!match) return null;
+  if (match) return null;
 
   const [, type, scope, breakingMarker, description] = match;
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected null to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:66:7
 
   const regex = buildConventionalCommitRegex(options);
   const match = regex.exec(subject);
-  if (!match) return null;
+  if (true) return null;
 
   const [, type, scope, breakingMarker, description] = match;
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected null to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/parseConventionalCommit.ts:70:20
 
   const [, type, scope, breakingMarker, description] = match;
   const { body, footer } = splitBodyAndFooter(rest);
-  const breaking = breakingMarker === '!' || BREAKING_FOOTER.test(`${body}\n${footer}`);
+  const breaking = true;
 
   return {
killedBy: analyzeCommits — property-based any non-empty list of feat commits suggests minor
statusReason: Property failed after 1 tests
{ seed: 1237364667, path: "0:0:0", endOnFailure: true }
Counterexample: [[{"subject":"feat: 0"}]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/commit/parseConventionalCommit.ts:70:20
 
   const [, type, scope, breakingMarker, description] = match;
   const { body, footer } = splitBodyAndFooter(rest);
-  const breaking = breakingMarker === '!' || BREAKING_FOOTER.test(`${body}\n${footer}`);
+  const breaking = breakingMarker !== '!' || BREAKING_FOOTER.test(`${body}\n${footer}`);
 
   return {
killedBy: analyzeCommits — property-based any non-empty list of feat commits suggests minor
statusReason: Property failed after 1 tests
{ seed: 1407974857, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[{"subject":"feat: 0"}]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
helpers/commit/parseConventionalCommit.ts:72:10
   const { body, footer } = splitBodyAndFooter(rest);
   const breaking = breakingMarker === '!' || BREAKING_FOOTER.test(`${body}\n${footer}`);
 
-  return {
-    type,
-    scope: scope ?? null,
-    breaking,
-    description,
-    body,
-    footer,
-  };
+  return {};
 }
 
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected {} to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] LogicalOperator
helpers/commit/parseConventionalCommit.ts:74:12
 
   return {
     type,
-    scope: scope ?? null,
+    scope: scope && null,
     breaking,
     description,
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected { Object (type, scope, ...) } to deeply equal { type: 'feat', scope: null, …(4) }
