[Killed] BlockStatement
helpers/date/add.ts:26:70
  * @see Temporal alternative: `plainDate.add({ days: n })`
  * @since 2.0.0
  */
-export function addDays(date: DateLike, amount: number): Date | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  const result = new Date(d);
-  result.setDate(result.getDate() + amount);
-  return result;
-}
+export function addDays(date: DateLike, amount: number): Date | null {}
 
 /**
killedBy: addDays should add days
statusReason: expected undefined to be '2025-01-29T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
helpers/date/add.ts:28:7
  */
 export function addDays(date: DateLike, amount: number): Date | null {
   const d = ensureDate(date);
-  if (!d) return null;
+  if (false) return null;
   const result = new Date(d);
   result.setDate(result.getDate() + amount);
killedBy: addDays should return null for invalid input
statusReason: expected 1970-01-02T00:00:00.000Z to be null

[Killed] ConditionalExpression
helpers/date/add.ts:28:7
  */
 export function addDays(date: DateLike, amount: number): Date | null {
   const d = ensureDate(date);
-  if (!d) return null;
+  if (true) return null;
   const result = new Date(d);
   result.setDate(result.getDate() + amount);
killedBy: addDays should add days
statusReason: expected undefined to be '2025-01-29T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/add.ts:30:18
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setDate(result.getDate() + amount);
+  result.setDate(result.getDate() - amount);
   return result;
 }
killedBy: addDays should add days
statusReason: expected '2025-01-09T00:00:00.000Z' to be '2025-01-29T00:00:00.000Z' // Object.is equality

[Killed] MethodExpression
helpers/date/add.ts:30:3
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setDate(result.getDate() + amount);
+  result.setTime(result.getDate() + amount);
   return result;
 }
killedBy: addDays should add days
statusReason: expected '1970-01-01T00:00:00.029Z' to be '2025-01-29T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
helpers/date/add.ts:53:72
  * @see Temporal alternative: `plainDate.add({ months: n })`
  * @since 2.0.0
  */
-export function addMonths(date: DateLike, amount: number): Date | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  const result = new Date(d);
-  result.setMonth(result.getMonth() + amount);
-  return result;
-}
+export function addMonths(date: DateLike, amount: number): Date | null {}
 
 /**
killedBy: addMonths should add months
statusReason: expected undefined to be '2025-02-15T00:00:00.000Z' // Object.is equality

[Killed] BooleanLiteral
helpers/date/add.ts:55:7
  */
 export function addMonths(date: DateLike, amount: number): Date | null {
   const d = ensureDate(date);
-  if (!d) return null;
+  if (d) return null;
   const result = new Date(d);
   result.setMonth(result.getMonth() + amount);
killedBy: addMonths should add months
statusReason: expected undefined to be '2025-02-15T00:00:00.000Z' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/add.ts:57:19
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setMonth(result.getMonth() + amount);
+  result.setMonth(result.getMonth() - amount);
   return result;
 }
killedBy: addMonths should add months
statusReason: expected '2024-12-15T00:00:00.000Z' to be '2025-02-15T00:00:00.000Z' // Object.is equality

[Killed] MethodExpression
helpers/date/add.ts:57:3
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setMonth(result.getMonth() + amount);
+  result.setFullYear(result.getMonth() + amount);
   return result;
 }
killedBy: addMonths should add months
statusReason: expected '0001-01-15T00:00:00.000Z' to be '2025-02-15T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
helpers/date/add.ts:78:71
  * @see Temporal alternative: `plainDate.add({ years: n })`
  * @since 2.0.0
  */
-export function addYears(date: DateLike, amount: number): Date | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  const result = new Date(d);
-  result.setFullYear(result.getFullYear() + amount);
-  return result;
-}
+export function addYears(date: DateLike, amount: number): Date | null {}
 
killedBy: addYears should add years
statusReason: expected undefined to be 2026 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/add.ts:82:22
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setFullYear(result.getFullYear() + amount);
+  result.setFullYear(result.getFullYear() - amount);
   return result;
 }
killedBy: addYears should add years
statusReason: expected 2024 to be 2026 // Object.is equality

[Killed] MethodExpression
helpers/date/add.ts:82:3
   const d = ensureDate(date);
   if (!d) return null;
   const result = new Date(d);
-  result.setFullYear(result.getFullYear() + amount);
+  result.setMonth(result.getFullYear() + amount);
   return result;
 }
killedBy: addYears should add years
statusReason: expected 2193 to be 2026 // Object.is equality
