[Killed] BlockStatement
helpers/date/calendar.ts:23:51
  *
  * @since 2.0.0
  */
-export function isLeapYear(year: number): boolean {
-  return (year % 4 === 0 && year % 100 !== 0) || year % 400 === 0;
-}
+export function isLeapYear(year: number): boolean {}
 
 /**
killedBy: isLeapYear returns true for a common leap year (divisible by 4)
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/calendar.ts:24:10
  * @since 2.0.0
  */
 export function isLeapYear(year: number): boolean {
-  return (year % 4 === 0 && year % 100 !== 0) || year % 400 === 0;
+  return true;
 }
 
killedBy: isLeapYear returns false for a common non-leap year
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
helpers/date/calendar.ts:24:11
  * @since 2.0.0
  */
 export function isLeapYear(year: number): boolean {
-  return (year % 4 === 0 && year % 100 !== 0) || year % 400 === 0;
+  return (year * 4 === 0 && year % 100 !== 0) || year % 400 === 0;
 }
 
killedBy: isLeapYear returns true for a common leap year (divisible by 4)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/date/calendar.ts:46:66
  *
  * @since 2.0.0
  */
-export function daysInMonth(year: number, month: number): number {
-  if (month < 1 || month > 12 || !Number.isInteger(month)) return NaN;
-  // The "day 0" trick: new Date(year, month, 0) gives the last day of the previous month.
-  // Since month is 1-based and Date's month is 0-based, `new Date(year, month, 0)`
-  // gives the last day of month `month`.
-  return new Date(year, month, 0).getDate();
-}
+export function daysInMonth(year: number, month: number): number {}
 
killedBy: daysInMonth returns 31 for January
statusReason: expected undefined to be 31 // Object.is equality

[Killed] LogicalOperator
helpers/date/calendar.ts:47:7
  * @since 2.0.0
  */
 export function daysInMonth(year: number, month: number): number {
-  if (month < 1 || month > 12 || !Number.isInteger(month)) return NaN;
+  if ((month < 1 || month > 12) && !Number.isInteger(month)) return NaN;
   // The "day 0" trick: new Date(year, month, 0) gives the last day of the previous month.
   // Since month is 1-based and Date's month is 0-based, `new Date(year, month, 0)`
killedBy: daysInMonth returns NaN for month 0
statusReason: expected 31 to be NaN

[Killed] EqualityOperator
helpers/date/calendar.ts:47:20
  * @since 2.0.0
  */
 export function daysInMonth(year: number, month: number): number {
-  if (month < 1 || month > 12 || !Number.isInteger(month)) return NaN;
+  if (month < 1 || month <= 12 || !Number.isInteger(month)) return NaN;
   // The "day 0" trick: new Date(year, month, 0) gives the last day of the previous month.
   // Since month is 1-based and Date's month is 0-based, `new Date(year, month, 0)`
killedBy: daysInMonth returns 31 for January
statusReason: expected NaN to be 31 // Object.is equality
