[Killed] ConditionalExpression
helpers/date/compare.ts:49:7
   const b = ensureDate(dateB);
 
   // Any invalid → not equal
-  if (a === null || b === null) {
+  if (true) {
     return false;
   }
killedBy: diff should handle special objects by reference only
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:49:21
   const b = ensureDate(dateB);
 
   // Any invalid → not equal
-  if (a === null || b === null) {
+  if (a === null || false) {
     return false;
   }
killedBy: compare edge cases should handle invalid inputs
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] BooleanLiteral
helpers/date/compare.ts:50:12
 
   // Any invalid → not equal
   if (a === null || b === null) {
-    return false;
+    return true;
   }
 
killedBy: compare edge cases should handle invalid inputs
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:54:5
   }
 
   switch (precision) {
-    case 'years':
-      return a.getFullYear() === b.getFullYear();
+    case 'years':
 
     case 'months':
killedBy: compare — contract same year different months → true for precision=years
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/date/compare.ts:54:10
   }
 
   switch (precision) {
-    case 'years':
+    case "":
       return a.getFullYear() === b.getFullYear();
 
killedBy: compare years precision should return true for dates in the same year
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:55:14
 
   switch (precision) {
     case 'years':
-      return a.getFullYear() === b.getFullYear();
+      return true;
 
     case 'months':
killedBy: compare years precision should return false for dates in different years
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:55:14
 
   switch (precision) {
     case 'years':
-      return a.getFullYear() === b.getFullYear();
+      return false;
 
     case 'months':
killedBy: compare years precision should return true for dates in the same year
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:57:5
     case 'years':
       return a.getFullYear() === b.getFullYear();
 
-    case 'months':
-      return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
+    case 'months':
 
     case 'days':
killedBy: compare months precision should return true for dates in the same month
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:58:53
       return a.getFullYear() === b.getFullYear();
 
     case 'months':
-      return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
+      return a.getFullYear() === b.getFullYear() && true;
 
     case 'days':
killedBy: compare months precision should return false for dates in different months
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:58:14
       return a.getFullYear() === b.getFullYear();
 
     case 'months':
-      return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
+      return false;
 
     case 'days':
killedBy: compare — property-based is reflexive for all precisions with valid dates
statusReason: Property failed after 1 tests
{ seed: -1645587977, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/compare.ts:60:5
     case 'months':
       return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
 
-    case 'days':
-      return a.toDateString() === b.toDateString();
+    case 'days':
 
     case 'hours': {
killedBy: compare days precision should return true for same day with vastly different times
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/date/compare.ts:60:10
     case 'months':
       return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
 
-    case 'days':
+    case "":
       return a.toDateString() === b.toDateString();
 
killedBy: compare days precision should return true for dates on same day with different times
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:61:14
       return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
 
     case 'days':
-      return a.toDateString() === b.toDateString();
+      return false;
 
     case 'hours': {
killedBy: compare — property-based is reflexive for all precisions with valid dates
statusReason: Property failed after 1 tests
{ seed: -1627245093, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/date/compare.ts:61:14
       return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
 
     case 'days':
-      return a.toDateString() === b.toDateString();
+      return a.toDateString() !== b.toDateString();
 
     case 'hours': {
killedBy: compare days precision should return true for dates on same day with different times
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:63:5
     case 'days':
       return a.toDateString() === b.toDateString();
 
-    case 'hours': {
-      const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
-      const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
-      return hoursA === hoursB;
-    }
+    case 'hours':
 
     case 'minutes': {
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/date/compare.ts:63:19
     case 'days':
       return a.toDateString() === b.toDateString();
 
-    case 'hours': {
-      const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
-      const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
-      return hoursA === hoursB;
-    }
+    case 'hours': {}
 
     case 'minutes': {
killedBy: compare — contract same hour different minutes → true for precision=hours
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:64:48
       return a.toDateString() === b.toDateString();
 
     case 'hours': {
-      const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
+      const hoursA = Math.floor(a.getTime() / (1000 / 60 * 60));
       const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
       return hoursA === hoursB;
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:64:33
       return a.toDateString() === b.toDateString();
 
     case 'hours': {
-      const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
+      const hoursA = Math.floor(a.getTime() * (1000 * 60 * 60));
       const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
       return hoursA === hoursB;
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:65:48
 
     case 'hours': {
       const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
-      const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
+      const hoursB = Math.floor(b.getTime() / (1000 * 60 / 60));
       return hoursA === hoursB;
     }
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:65:48
 
     case 'hours': {
       const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
-      const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
+      const hoursB = Math.floor(b.getTime() / (1000 / 60 * 60));
       return hoursA === hoursB;
     }
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:66:14
     case 'hours': {
       const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
       const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
-      return hoursA === hoursB;
+      return false;
     }
 
killedBy: compare hours precision should return true for dates with same hour ignoring minutes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:66:14
     case 'hours': {
       const hoursA = Math.floor(a.getTime() / (1000 * 60 * 60));
       const hoursB = Math.floor(b.getTime() / (1000 * 60 * 60));
-      return hoursA === hoursB;
+      return true;
     }
 
killedBy: compare hours precision should return false for dates with different hours
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/date/compare.ts:69:21
       return hoursA === hoursB;
     }
 
-    case 'minutes': {
-      const minutesA = Math.floor(a.getTime() / (1000 * 60));
-      const minutesB = Math.floor(b.getTime() / (1000 * 60));
-      return minutesA === minutesB;
-    }
+    case 'minutes': {}
 
     case 'seconds': {
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:69:5
       return hoursA === hoursB;
     }
 
-    case 'minutes': {
-      const minutesA = Math.floor(a.getTime() / (1000 * 60));
-      const minutesB = Math.floor(b.getTime() / (1000 * 60));
-      return minutesA === minutesB;
-    }
+    case 'minutes':
 
     case 'seconds': {
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:70:50
     }
 
     case 'minutes': {
-      const minutesA = Math.floor(a.getTime() / (1000 * 60));
+      const minutesA = Math.floor(a.getTime() / (1000 / 60));
       const minutesB = Math.floor(b.getTime() / (1000 * 60));
       return minutesA === minutesB;
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:70:35
     }
 
     case 'minutes': {
-      const minutesA = Math.floor(a.getTime() / (1000 * 60));
+      const minutesA = Math.floor(a.getTime() * (1000 * 60));
       const minutesB = Math.floor(b.getTime() / (1000 * 60));
       return minutesA === minutesB;
killedBy: compare — property-based is reflexive for all precisions with valid dates
statusReason: Property failed after 1 tests
{ seed: -287904544, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [new Date("1969-12-31T23:59:59.999Z")]
Shrunk 50 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/compare.ts:71:50
 
     case 'minutes': {
       const minutesA = Math.floor(a.getTime() / (1000 * 60));
-      const minutesB = Math.floor(b.getTime() / (1000 * 60));
+      const minutesB = Math.floor(b.getTime() / (1000 / 60));
       return minutesA === minutesB;
     }
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:71:35
 
     case 'minutes': {
       const minutesA = Math.floor(a.getTime() / (1000 * 60));
-      const minutesB = Math.floor(b.getTime() / (1000 * 60));
+      const minutesB = Math.floor(b.getTime() * (1000 * 60));
       return minutesA === minutesB;
     }
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:72:14
     case 'minutes': {
       const minutesA = Math.floor(a.getTime() / (1000 * 60));
       const minutesB = Math.floor(b.getTime() / (1000 * 60));
-      return minutesA === minutesB;
+      return false;
     }
 
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/date/compare.ts:72:14
     case 'minutes': {
       const minutesA = Math.floor(a.getTime() / (1000 * 60));
       const minutesB = Math.floor(b.getTime() / (1000 * 60));
-      return minutesA === minutesB;
+      return minutesA !== minutesB;
     }
 
killedBy: compare minutes precision should return true for dates with same minute ignoring seconds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:75:5
       return minutesA === minutesB;
     }
 
-    case 'seconds': {
-      const secondsA = Math.floor(a.getTime() / 1000);
-      const secondsB = Math.floor(b.getTime() / 1000);
-      return secondsA === secondsB;
-    }
+    case 'seconds':
 
     case 'milliseconds':
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/date/compare.ts:75:21
       return minutesA === minutesB;
     }
 
-    case 'seconds': {
-      const secondsA = Math.floor(a.getTime() / 1000);
-      const secondsB = Math.floor(b.getTime() / 1000);
-      return secondsA === secondsB;
-    }
+    case 'seconds': {}
 
     case 'milliseconds':
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:76:35
     }
 
     case 'seconds': {
-      const secondsA = Math.floor(a.getTime() / 1000);
+      const secondsA = Math.floor(a.getTime() * 1000);
       const secondsB = Math.floor(b.getTime() / 1000);
       return secondsA === secondsB;
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
helpers/date/compare.ts:77:35
 
     case 'seconds': {
       const secondsA = Math.floor(a.getTime() / 1000);
-      const secondsB = Math.floor(b.getTime() / 1000);
+      const secondsB = Math.floor(b.getTime() * 1000);
       return secondsA === secondsB;
     }
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/date/compare.ts:78:14
     case 'seconds': {
       const secondsA = Math.floor(a.getTime() / 1000);
       const secondsB = Math.floor(b.getTime() / 1000);
-      return secondsA === secondsB;
+      return secondsA !== secondsB;
     }
 
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:78:14
     case 'seconds': {
       const secondsA = Math.floor(a.getTime() / 1000);
       const secondsB = Math.floor(b.getTime() / 1000);
-      return secondsA === secondsB;
+      return false;
     }
 
killedBy: compare seconds precision should return true for dates with same time ignoring milliseconds
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
helpers/date/compare.ts:81:10
       return secondsA === secondsB;
     }
 
-    case 'milliseconds':
+    case "":
     default:
       return a.getTime() === b.getTime();

[Killed] ConditionalExpression
helpers/date/compare.ts:82:5
     }
 
     case 'milliseconds':
-    default:
-      return a.getTime() === b.getTime();
+    default:
   }
 }
killedBy: compare milliseconds precision (default) should return true for identical dates
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/compare.ts:83:14
 
     case 'milliseconds':
     default:
-      return a.getTime() === b.getTime();
+      return false;
   }
 }
killedBy: compare milliseconds precision (default) should return true for identical dates
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/date/compare.ts:83:14
 
     case 'milliseconds':
     default:
-      return a.getTime() === b.getTime();
+      return a.getTime() !== b.getTime();
   }
 }
killedBy: compare milliseconds precision (default) should return true for identical dates
statusReason: expected false to be true // Object.is equality
