[Killed] BooleanLiteral
helpers/date/difference.ts:52:37
  * @since 2.0.0
  */
 export function difference(dateA: DateLike, dateB: DateLike, options: DateDifferenceOptions = {}): number {
-  const { unit = 'days', absolute = true } = options;
+  const { unit = 'days', absolute = false } = options;
 
   const a = ensureDate(dateA);
killedBy: difference days (default) should return absolute value by default
statusReason: expected -9 to be close to 9, received difference is 18, but expected 0.5

[Killed] ConditionalExpression
helpers/date/difference.ts:57:7
   const a = ensureDate(dateA);
   const b = ensureDate(dateB);
 
-  if (a === null || b === null) {
+  if (true) {
     return NaN;
   }
killedBy: difference days (default) should return 0 for same date
statusReason: expected NaN to be +0 // Object.is equality

[Killed] EqualityOperator
helpers/date/difference.ts:57:21
   const a = ensureDate(dateA);
   const b = ensureDate(dateB);
 
-  if (a === null || b === null) {
+  if (a === null || b !== null) {
     return NaN;
   }
killedBy: difference days (default) should return 0 for same date
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:61:18
     return NaN;
   }
 
-  const diffMs = b.getTime() - a.getTime();
+  const diffMs = b.getTime() + a.getTime();
 
   let result: number;
killedBy: difference days (default) should return 0 for same date
statusReason: expected 38716 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/date/difference.ts:65:5
 
   let result: number;
   switch (unit) {
-    case 'milliseconds':
-      result = diffMs;
-      break;
+    case 'milliseconds':
     case 'seconds':
       result = diffMs / 1000;
killedBy: difference units should return difference in milliseconds
statusReason: expected 1 to be 1000 // Object.is equality

[Killed] StringLiteral
helpers/date/difference.ts:65:10
 
   let result: number;
   switch (unit) {
-    case 'milliseconds':
+    case "":
       result = diffMs;
       break;
killedBy: difference units should return difference in milliseconds
statusReason: expected 0.000011574074074074073 to be 1000 // Object.is equality

[Killed] ConditionalExpression
helpers/date/difference.ts:68:5
     case 'milliseconds':
       result = diffMs;
       break;
-    case 'seconds':
-      result = diffMs / 1000;
-      break;
+    case 'seconds':
     case 'minutes':
       result = diffMs / (1000 * 60);
killedBy: difference — contract 1 minute in seconds → 60
statusReason: expected 1 to be 60 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:69:16
       result = diffMs;
       break;
     case 'seconds':
-      result = diffMs / 1000;
+      result = diffMs * 1000;
       break;
     case 'minutes':
killedBy: difference units should return difference in seconds
statusReason: expected 60000000 to be 60 // Object.is equality

[Killed] ConditionalExpression
helpers/date/difference.ts:71:5
     case 'seconds':
       result = diffMs / 1000;
       break;
-    case 'minutes':
-      result = diffMs / (1000 * 60);
-      break;
+    case 'minutes':
     case 'hours':
       result = diffMs / (1000 * 60 * 60);
killedBy: difference units should return difference in minutes
statusReason: expected 2 to be 120 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:72:16
       result = diffMs / 1000;
       break;
     case 'minutes':
-      result = diffMs / (1000 * 60);
+      result = diffMs * (1000 * 60);
       break;
     case 'hours':
killedBy: difference units should return difference in minutes
statusReason: expected 432000000000 to be 120 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:72:26
       result = diffMs / 1000;
       break;
     case 'minutes':
-      result = diffMs / (1000 * 60);
+      result = diffMs / (1000 / 60);
       break;
     case 'hours':
killedBy: difference units should return difference in minutes
statusReason: expected 431999.99999999994 to be 120 // Object.is equality

[Killed] ConditionalExpression
helpers/date/difference.ts:74:5
     case 'minutes':
       result = diffMs / (1000 * 60);
       break;
-    case 'hours':
-      result = diffMs / (1000 * 60 * 60);
-      break;
+    case 'hours':
     case 'days':
     default:
killedBy: difference units should return difference in hours
statusReason: expected 0.10416666666666667 to be 2.5 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:75:26
       result = diffMs / (1000 * 60);
       break;
     case 'hours':
-      result = diffMs / (1000 * 60 * 60);
+      result = diffMs / (1000 / 60 * 60);
       break;
     case 'days':
killedBy: difference units should return difference in hours
statusReason: expected 8999.999999999998 to be 2.5 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:75:26
       result = diffMs / (1000 * 60);
       break;
     case 'hours':
-      result = diffMs / (1000 * 60 * 60);
+      result = diffMs / (1000 * 60 / 60);
       break;
     case 'days':
killedBy: difference units should return difference in hours
statusReason: expected 9000 to be 2.5 // Object.is equality

[Killed] ConditionalExpression
helpers/date/difference.ts:78:5
       result = diffMs / (1000 * 60 * 60);
       break;
     case 'days':
-    default:
-      result = diffMs / (1000 * 60 * 60 * 24);
-      break;
+    default:
   }
 
killedBy: difference days (default) should return 0 for same date
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:79:26
       break;
     case 'days':
     default:
-      result = diffMs / (1000 * 60 * 60 * 24);
+      result = diffMs / (1000 * 60 / 60 * 24);
       break;
   }
killedBy: difference days (default) should return difference in days
statusReason: expected 32400 to be close to 9, received difference is 32391, but expected 0.5

[Killed] ArithmeticOperator
helpers/date/difference.ts:79:16
       break;
     case 'days':
     default:
-      result = diffMs / (1000 * 60 * 60 * 24);
+      result = diffMs * (1000 * 60 * 60 * 24);
       break;
   }
killedBy: difference days (default) should return difference in days
statusReason: expected 67184640000000000 to be close to 9, received difference is 67184639999999990, but expected 0.5

[Killed] BlockStatement
helpers/date/difference.ts:95:66
  * @deprecated Use {@link difference} instead. `daysDifference` will be removed in v3.
  * @since 2.0.0
  */
-export function daysDifference(date1: Date, date2: Date): number {
-  const oneDay = 24 * 60 * 60 * 1000;
-  return Math.round(Math.abs((date1.getTime() - date2.getTime()) / oneDay));
-}
+export function daysDifference(date1: Date, date2: Date): number {}
 
killedBy: daysDifference should return 0 for same date
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:96:18
  * @since 2.0.0
  */
 export function daysDifference(date1: Date, date2: Date): number {
-  const oneDay = 24 * 60 * 60 * 1000;
+  const oneDay = 24 / 60 * 60 * 1000;
   return Math.round(Math.abs((date1.getTime() - date2.getTime()) / oneDay));
 }
killedBy: daysDifference should return 1 for consecutive days
statusReason: expected 3600 to be 1 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:96:18
  * @since 2.0.0
  */
 export function daysDifference(date1: Date, date2: Date): number {
-  const oneDay = 24 * 60 * 60 * 1000;
+  const oneDay = 24 * 60 * 60 / 1000;
   return Math.round(Math.abs((date1.getTime() - date2.getTime()) / oneDay));
 }
killedBy: daysDifference should return 1 for consecutive days
statusReason: expected 1000000 to be 1 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:97:30
  */
 export function daysDifference(date1: Date, date2: Date): number {
   const oneDay = 24 * 60 * 60 * 1000;
-  return Math.round(Math.abs((date1.getTime() - date2.getTime()) / oneDay));
+  return Math.round(Math.abs((date1.getTime() - date2.getTime()) * oneDay));
 }
 
killedBy: daysDifference should return 1 for consecutive days
statusReason: expected 7464960000000000 to be 1 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/difference.ts:97:31
  */
 export function daysDifference(date1: Date, date2: Date): number {
   const oneDay = 24 * 60 * 60 * 1000;
-  return Math.round(Math.abs((date1.getTime() - date2.getTime()) / oneDay));
+  return Math.round(Math.abs((date1.getTime() + date2.getTime()) / oneDay));
 }
 
killedBy: daysDifference should return 0 for same date
statusReason: expected 38717 to be +0 // Object.is equality
