[Killed] BlockStatement
helpers/date/ensureDate.ts:14:75
  * Type guard that checks whether a value satisfies the {@link EpochMilliseconds}
  * structural interface (e.g. `Temporal.Instant`, `Temporal.ZonedDateTime`).
  */
-function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    'epochMilliseconds' in value &&
-    typeof (value as EpochMilliseconds).epochMilliseconds === 'number'
-  );
-}
+function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {}
 
 /**
killedBy: ensureDate edge cases should handle objects with epochMilliseconds (Temporal-like)
statusReason: expected null to be an instance of Date

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:16:5
  */
 function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    'epochMilliseconds' in value &&
-    typeof (value as EpochMilliseconds).epochMilliseconds === 'number'
+    false
   );
 }
killedBy: ensureDate edge cases should handle objects with epochMilliseconds (Temporal-like)
statusReason: expected null to be an instance of Date

[Killed] EqualityOperator
helpers/date/ensureDate.ts:16:5
  */
 function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {
   return (
-    typeof value === 'object' &&
+    typeof value !== 'object' &&
     value !== null &&
     'epochMilliseconds' in value &&
killedBy: isWithinRange returns true when date is within range
statusReason: Cannot use 'in' operator to search for 'epochMilliseconds' in 2025-06-15

[Killed] EqualityOperator
helpers/date/ensureDate.ts:17:5
 function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {
   return (
     typeof value === 'object' &&
-    value !== null &&
+    value === null &&
     'epochMilliseconds' in value &&
     typeof (value as EpochMilliseconds).epochMilliseconds === 'number'
killedBy: ensureDate — property-based epochMilliseconds objects always return a Date with matching time
statusReason: Property failed after 1 tests
{ seed: -1014976805, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
helpers/date/ensureDate.ts:17:5
 function hasEpochMilliseconds(value: unknown): value is EpochMilliseconds {
   return (
     typeof value === 'object' &&
-    value !== null &&
+    true &&
     'epochMilliseconds' in value &&
     typeof (value as EpochMilliseconds).epochMilliseconds === 'number'

[Killed] EqualityOperator
helpers/date/ensureDate.ts:19:5
     typeof value === 'object' &&
     value !== null &&
     'epochMilliseconds' in value &&
-    typeof (value as EpochMilliseconds).epochMilliseconds === 'number'
+    typeof (value as EpochMilliseconds).epochMilliseconds !== 'number'
   );
 }
killedBy: ensureDate — property-based epochMilliseconds objects always return a Date with matching time
statusReason: Property failed after 1 tests
{ seed: -1929905751, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
helpers/date/ensureDate.ts:19:5
     typeof value === 'object' &&
     value !== null &&
     'epochMilliseconds' in value &&
-    typeof (value as EpochMilliseconds).epochMilliseconds === 'number'
+    true
   );
 }

[Killed] EqualityOperator
helpers/date/ensureDate.ts:49:7
  * @since 2.0.0
  */
 export function ensureDate(input: DateLike | null | undefined): Date | null {
-  if (input === null || input === undefined || input === '' || input === 0) {
+  if (input !== null || input === undefined || input === '' || input === 0) {
     return null;
   }
killedBy: eachDay — property-based length equals (end - start) in days + 1
statusReason: Property failed after 1 tests
{ seed: -1433686515, path: "0:0:0", endOnFailure: true }
Counterexample: [new Date("2024-01-01T00:00:00.000Z"),new Date("2024-01-01T00:00:00.000Z")]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:49:7
  * @since 2.0.0
  */
 export function ensureDate(input: DateLike | null | undefined): Date | null {
-  if (input === null || input === undefined || input === '' || input === 0) {
+  if (true) {
     return null;
   }
killedBy: ensureDate valid inputs should handle valid date strings
statusReason: expected null to be an instance of Date

[Killed] BlockStatement
helpers/date/ensureDate.ts:53:30
     return null;
   }
 
-  if (input instanceof Date) {
-    return isNaN(input.getTime()) ? null : input;
-  }
+  if (input instanceof Date) {}
 
   if (hasEpochMilliseconds(input)) {
killedBy: startOf — property-based startOf("day") always has 00:00:00.000
statusReason: Property failed after 1 tests
{ seed: 1138075236, path: "0:0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:53:7
     return null;
   }
 
-  if (input instanceof Date) {
+  if (false) {
     return isNaN(input.getTime()) ? null : input;
   }
killedBy: eachDay — property-based length equals (end - start) in days + 1
statusReason: Property failed after 1 tests
{ seed: -989123203, path: "0:0:0", endOnFailure: true }
Counterexample: [new Date("2024-01-01T00:00:00.000Z"),new Date("2024-01-01T00:00:00.000Z")]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/ensureDate.ts:57:36
     return isNaN(input.getTime()) ? null : input;
   }
 
-  if (hasEpochMilliseconds(input)) {
-    const date = new Date(input.epochMilliseconds);
-    return isNaN(date.getTime()) ? null : date;
-  }
+  if (hasEpochMilliseconds(input)) {}
 
   if (typeof input === 'number') {
killedBy: ensureDate — property-based epochMilliseconds objects always return a Date with matching time
statusReason: Property failed after 1 tests
{ seed: 1637049600, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:57:7
     return isNaN(input.getTime()) ? null : input;
   }
 
-  if (hasEpochMilliseconds(input)) {
+  if (false) {
     const date = new Date(input.epochMilliseconds);
     return isNaN(date.getTime()) ? null : date;
killedBy: ensureDate — property-based epochMilliseconds objects always return a Date with matching time
statusReason: Property failed after 1 tests
{ seed: -1949152797, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/date/ensureDate.ts:62:7
     return isNaN(date.getTime()) ? null : date;
   }
 
-  if (typeof input === 'number') {
+  if (typeof input !== 'number') {
     const normalized = normalizeTimestamp(input);
     const date = new Date(normalized);
killedBy: startOf / endOf — contract endOf with timestamp DateLike
statusReason: expected undefined to be 23 // Object.is equality

[Killed] ConditionalExpression
helpers/date/ensureDate.ts:68:7
     return isNaN(date.getTime()) ? null : date;
   }
 
-  if (typeof input === 'string') {
+  if (true) {
     const date = new Date(input);
     return isNaN(date.getTime()) ? null : date;
killedBy: ensureDate edge cases should handle unexpected input types gracefully
statusReason: expected 1970-01-01T00:00:00.001Z to be null

[Killed] BlockStatement
helpers/date/ensureDate.ts:68:34
     return isNaN(date.getTime()) ? null : date;
   }
 
-  if (typeof input === 'string') {
-    const date = new Date(input);
-    return isNaN(date.getTime()) ? null : date;
-  }
+  if (typeof input === 'string') {}
 
   return null;
killedBy: startOf / endOf — contract startOf with string DateLike
statusReason: expected undefined to be +0 // Object.is equality
