[Killed] BlockStatement
helpers/date/format.ts:20:58
  * toISO8601(1737290400000) // '2025-01-19T12:00:00.000Z'
  * @since 2.0.0
  */
-export function toISO8601(date: DateLike): string | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  return d.toISOString();
-}
+export function toISO8601(date: DateLike): string | null {}
 
 /**
killedBy: toISO8601 — property-based valid Date inputs always return a non-null string matching ISO format
statusReason: Property failed after 1 tests
{ seed: 1472686342, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/date/format.ts:40:25
  */
 export function toRFC3339(
   date: DateLike,
-  includeMilliseconds = false
+  includeMilliseconds = true
 ): string | null {
   const d = ensureDate(date);
killedBy: toRFC3339 should convert a Date object to RFC 3339 format without milliseconds by default
statusReason: expected '2025-01-19T12:30:45.123Z' to be '2025-01-19T12:30:45Z' // Object.is equality

[Killed] BlockStatement
helpers/date/format.ts:41:18
 export function toRFC3339(
   date: DateLike,
   includeMilliseconds = false
-): string | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-
-  const iso = d.toISOString();
-  if (includeMilliseconds) {
-    return iso;
-  }
-  // Remove milliseconds: 2025-01-19T12:30:45.123Z -> 2025-01-19T12:30:45Z
-  return iso.replace(/\.\d{3}Z$/, 'Z');
-}
+): string | null {}
 
 /**
killedBy: toRFC3339 — property-based valid Date inputs return non-null string matching RFC3339 format
statusReason: Property failed after 1 tests
{ seed: -1099189268, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z"),false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/format.ts:46:7
   if (!d) return null;
 
   const iso = d.toISOString();
-  if (includeMilliseconds) {
+  if (false) {
     return iso;
   }
killedBy: toRFC3339 — contract with milliseconds: .sss present in output
statusReason: expected '2025-01-19T12:30:45Z' to be '2025-01-19T12:30:45.123Z' // Object.is equality

[Killed] BlockStatement
helpers/date/format.ts:46:28
   if (!d) return null;
 
   const iso = d.toISOString();
-  if (includeMilliseconds) {
-    return iso;
-  }
+  if (includeMilliseconds) {}
   // Remove milliseconds: 2025-01-19T12:30:45.123Z -> 2025-01-19T12:30:45Z
   return iso.replace(/\.\d{3}Z$/, 'Z');
killedBy: toRFC3339 should include milliseconds when requested
statusReason: expected '2025-01-19T12:30:45Z' to be '2025-01-19T12:30:45.123Z' // Object.is equality

[Survived] Regex
helpers/date/format.ts:50:22
     return iso;
   }
   // Remove milliseconds: 2025-01-19T12:30:45.123Z -> 2025-01-19T12:30:45Z
-  return iso.replace(/\.\d{3}Z$/, 'Z');
+  return iso.replace(/\.\d{3}Z/, 'Z');
 }
 

[Killed] StringLiteral
helpers/date/format.ts:67:24
   const d = ensureDate(date);
   if (!d) return null;
 
-  const days = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+  const days = ['Sun', "", 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
   const months = [
     'Jan',
killedBy: toRFC2822 should handle different days of the week
statusReason: expected ', 20 Jan 2025 12:00:00 +0000' to be 'Mon, 20 Jan 2025 12:00:00 +0000' // Object.is equality

[Killed] StringLiteral
helpers/date/format.ts:67:59
   const d = ensureDate(date);
   if (!d) return null;
 
-  const days = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+  const days = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', ""];
   const months = [
     'Jan',
killedBy: toRFC2822 — property-based valid Date inputs return non-null string matching RFC2822 format
statusReason: Property failed after 6 tests
{ seed: -1482183570, path: "5:20:0:1:1:1:2:2:1:0:2:0:0:1:0", endOnFailure: true }
Counterexample: [new Date("2405-02-26T00:00:00.000Z")]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/date/format.ts:70:5
   const days = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
   const months = [
     'Jan',
-    'Feb',
+    "",
     'Mar',
     'Apr',
killedBy: toRFC2822 — property-based valid Date inputs return non-null string matching RFC2822 format
statusReason: Property failed after 4 tests
{ seed: 206095612, path: "3:2:10:3:2:2:0:1:0:2:7:2:0:1:0:0:0:0", endOnFailure: true }
Counterexample: [new Date("7876-02-01T00:00:00.000Z")]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/date/format.ts:75:5
     'Apr',
     'May',
     'Jun',
-    'Jul',
+    "",
     'Aug',
     'Sep',
killedBy: toRFC2822 — property-based valid Date inputs return non-null string matching RFC2822 format
statusReason: Property failed after 17 tests
{ seed: -487174466, path: "16:7:1:7:0:2:0:0:1:1:4:2:1:0:1:0:2", endOnFailure: true }
Counterexample: [new Date("2484-07-01T00:00:00.000Z")]
Shrunk 16 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/date/format.ts:78:5
     'Jul',
     'Aug',
     'Sep',
-    'Oct',
+    "",
     'Nov',
     'Dec',
killedBy: toRFC2822 — property-based valid Date inputs return non-null string matching RFC2822 format
statusReason: Property failed after 21 tests
{ seed: 1206336929, path: "20:17:1:1:1:0:3:4:0:2:1:1:0:0:1:1", endOnFailure: true }
Counterexample: [new Date("8356-10-01T00:00:00.000Z")]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
