[Killed] BlockStatement
helpers/date/is.ts:23:70
  * isSameDay(1737244800000, '2025-01-19')                     // => true
  * @since 2.0.0
  */
-export function isSameDay(date1: DateLike, date2: DateLike): boolean {
-  const a = ensureDate(date1);
-  const b = ensureDate(date2);
-  if (a === null || b === null) return false;
-
-  return (
-    a.getFullYear() === b.getFullYear() &&
-    a.getMonth() === b.getMonth() &&
-    a.getDate() === b.getDate()
-  );
-}
+export function isSameDay(date1: DateLike, date2: DateLike): boolean {}
 
 /**
killedBy: isSameDay should return true for same day with same time
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:26:21
 export function isSameDay(date1: DateLike, date2: DateLike): boolean {
   const a = ensureDate(date1);
   const b = ensureDate(date2);
-  if (a === null || b === null) return false;
+  if (a === null || false) return false;
 
   return (
killedBy: isSameDay — contract invalid input → false
statusReason: Cannot read properties of null (reading 'getFullYear')

[Killed] ConditionalExpression
helpers/date/is.ts:26:7
 export function isSameDay(date1: DateLike, date2: DateLike): boolean {
   const a = ensureDate(date1);
   const b = ensureDate(date2);
-  if (a === null || b === null) return false;
+  if (false) return false;
 
   return (
killedBy: isSameDay — contract invalid input → false
statusReason: Cannot read properties of null (reading 'getFullYear')

[Killed] LogicalOperator
helpers/date/is.ts:29:5
   if (a === null || b === null) return false;
 
   return (
-    a.getFullYear() === b.getFullYear() &&
-    a.getMonth() === b.getMonth() &&
-    a.getDate() === b.getDate()
+    a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth() || a.getDate() === b.getDate()
   );
 }
killedBy: isSameDay should return false for different days
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/date/is.ts:29:5
   if (a === null || b === null) return false;
 
   return (
-    a.getFullYear() === b.getFullYear() &&
-    a.getMonth() === b.getMonth() &&
+    a.getFullYear() === b.getFullYear() || a.getMonth() === b.getMonth() &&
     a.getDate() === b.getDate()
   );
killedBy: isSameDay should return false for same month and day but different year
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/date/is.ts:30:5
 
   return (
     a.getFullYear() === b.getFullYear() &&
-    a.getMonth() === b.getMonth() &&
+    a.getMonth() !== b.getMonth() &&
     a.getDate() === b.getDate()
   );
killedBy: isSameDay should return true for same day with same time
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:30:5
 
   return (
     a.getFullYear() === b.getFullYear() &&
-    a.getMonth() === b.getMonth() &&
+    true &&
     a.getDate() === b.getDate()
   );
killedBy: isSameDay should return false for same year and day but different month
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/date/is.ts:31:5
   return (
     a.getFullYear() === b.getFullYear() &&
     a.getMonth() === b.getMonth() &&
-    a.getDate() === b.getDate()
+    a.getDate() !== b.getDate()
   );
 }
killedBy: isSameDay should return true for same day with same time
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:31:5
   return (
     a.getFullYear() === b.getFullYear() &&
     a.getMonth() === b.getMonth() &&
-    a.getDate() === b.getDate()
+    true
   );
 }
killedBy: isSameDay should return false for different days
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/date/is.ts:48:72
  * isSameMonth('2025-01-31', '2025-02-01') // => false
  * @since 2.0.0
  */
-export function isSameMonth(date1: DateLike, date2: DateLike): boolean {
-  const a = ensureDate(date1);
-  const b = ensureDate(date2);
-  if (a === null || b === null) return false;
-
-  return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
-}
+export function isSameMonth(date1: DateLike, date2: DateLike): boolean {}
 
 /**
killedBy: isSameMonth should return true for dates in the same month
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
helpers/date/is.ts:51:40
 export function isSameMonth(date1: DateLike, date2: DateLike): boolean {
   const a = ensureDate(date1);
   const b = ensureDate(date2);
-  if (a === null || b === null) return false;
+  if (a === null || b === null) return true;
 
   return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
killedBy: isSameMonth should return false for invalid inputs
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/date/is.ts:51:7
 export function isSameMonth(date1: DateLike, date2: DateLike): boolean {
   const a = ensureDate(date1);
   const b = ensureDate(date2);
-  if (a === null || b === null) return false;
+  if (a !== null || b === null) return false;
 
   return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
killedBy: isSameMonth should return true for dates in the same month
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:53:10
   const b = ensureDate(date2);
   if (a === null || b === null) return false;
 
-  return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
+  return false;
 }
 
killedBy: isSameMonth should return true for dates in the same month
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:53:49
   const b = ensureDate(date2);
   if (a === null || b === null) return false;
 
-  return a.getFullYear() === b.getFullYear() && a.getMonth() === b.getMonth();
+  return a.getFullYear() === b.getFullYear() && true;
 }
 
killedBy: isSameMonth should return false for dates in different months
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/date/is.ts:69:71
  * isSameYear('2024-12-31', '2025-01-01') // => false
  * @since 2.0.0
  */
-export function isSameYear(date1: DateLike, date2: DateLike): boolean {
-  const a = ensureDate(date1);
-  const b = ensureDate(date2);
-  if (a === null || b === null) return false;
-
-  return a.getFullYear() === b.getFullYear();
-}
+export function isSameYear(date1: DateLike, date2: DateLike): boolean {}
 
killedBy: isSameYear should return true for dates in the same year
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:72:7
 export function isSameYear(date1: DateLike, date2: DateLike): boolean {
   const a = ensureDate(date1);
   const b = ensureDate(date2);
-  if (a === null || b === null) return false;
+  if (true) return false;
 
   return a.getFullYear() === b.getFullYear();
killedBy: isSameYear should return true for dates in the same year
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:74:10
   const b = ensureDate(date2);
   if (a === null || b === null) return false;
 
-  return a.getFullYear() === b.getFullYear();
+  return false;
 }
 
killedBy: isSameYear should return true for dates in the same year
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/is.ts:74:10
   const b = ensureDate(date2);
   if (a === null || b === null) return false;
 
-  return a.getFullYear() === b.getFullYear();
+  return true;
 }
 
killedBy: isSameYear should return false for dates in different years
statusReason: expected true to be false // Object.is equality
