[Killed] BlockStatement
helpers/date/safeDate.ts:18:75
  * @deprecated Use {@link ensureDate} instead. `safeDate` will be removed in v3.
  * @since 1.9.0
  */
-export function safeDate(input: DateLike | null | undefined): Date | null {
-  return ensureDate(input);
-}
+export function safeDate(input: DateLike | null | undefined): Date | null {}
 
 /**
killedBy: safeDate (deprecated) delegates to ensureDate for valid input
statusReason: expected undefined to be an instance of Date

[Killed] BlockStatement
helpers/date/safeDate.ts:30:84
  * @deprecated Use {@link toISO8601} from `format.ts` instead. `dateToISOString` will be removed in v3.
  * @since 1.9.0
  */
-export function dateToISOString(input: DateLike | null | undefined): string | null {
-  const date = ensureDate(input);
-  return date ? date.toISOString() : null;
-}
+export function dateToISOString(input: DateLike | null | undefined): string | null {}
 
killedBy: dateToISOString (deprecated) returns ISO string for valid input
statusReason: expected undefined to be '2025-01-19T12:00:00.000Z' // Object.is equality
