[Killed] BlockStatement
helpers/date/sequence.ts:26:65
  * @see Temporal alternative: iterate with `plainDate.add({ days: 1 })`
  * @since 2.0.0
  */
-export function eachDay(start: DateLike, end: DateLike): Date[] {
-  const s = ensureDate(start);
-  const e = ensureDate(end);
-  if (!s || !e) return [];
-
-  const result: Date[] = [];
-  const current = new Date(s);
-  current.setHours(0, 0, 0, 0);
-
-  const endTime = new Date(e);
-  endTime.setHours(0, 0, 0, 0);
-
-  while (current.getTime() <= endTime.getTime()) {
-    result.push(new Date(current));
-    current.setDate(current.getDate() + 1);
-  }
-
-  return result;
-}
+export function eachDay(start: DateLike, end: DateLike): Date[] {}
 
 /**
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
helpers/date/sequence.ts:29:7
 export function eachDay(start: DateLike, end: DateLike): Date[] {
   const s = ensureDate(start);
   const e = ensureDate(end);
-  if (!s || !e) return [];
+  if (true) return [];
 
   const result: Date[] = [];
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: expected [] to have a length of 3 but got +0

[Killed] BooleanLiteral
helpers/date/sequence.ts:29:7
 export function eachDay(start: DateLike, end: DateLike): Date[] {
   const s = ensureDate(start);
   const e = ensureDate(end);
-  if (!s || !e) return [];
+  if (s || !e) return [];
 
   const result: Date[] = [];
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: expected [] to have a length of 3 but got +0

[Killed] ArrayDeclaration
helpers/date/sequence.ts:31:26
   const e = ensureDate(end);
   if (!s || !e) return [];
 
-  const result: Date[] = [];
+  const result: Date[] = ["Stryker was here"];
   const current = new Date(s);
   current.setHours(0, 0, 0, 0);
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: expected [ 'Stryker was here', …(3) ] to have a length of 3 but got 4

[Killed] MethodExpression
helpers/date/sequence.ts:33:3
 
   const result: Date[] = [];
   const current = new Date(s);
-  current.setHours(0, 0, 0, 0);
+  current.setMinutes(0, 0, 0, 0);
 
   const endTime = new Date(e);
killedBy: eachDay normalizes time to 00:00:00.000
statusReason: expected 14 to be +0 // Object.is equality

[Survived] MethodExpression
helpers/date/sequence.ts:36:3
   current.setHours(0, 0, 0, 0);
 
   const endTime = new Date(e);
-  endTime.setHours(0, 0, 0, 0);
+  endTime.setMinutes(0, 0, 0, 0);
 
   while (current.getTime() <= endTime.getTime()) {

[Killed] EqualityOperator
helpers/date/sequence.ts:38:10
   const endTime = new Date(e);
   endTime.setHours(0, 0, 0, 0);
 
-  while (current.getTime() <= endTime.getTime()) {
+  while (current.getTime() < endTime.getTime()) {
     result.push(new Date(current));
     current.setDate(current.getDate() + 1);
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: expected [ 2025-01-01T00:00:00.000Z, …(1) ] to have a length of 3 but got 2

[Killed] EqualityOperator
helpers/date/sequence.ts:38:10
   const endTime = new Date(e);
   endTime.setHours(0, 0, 0, 0);
 
-  while (current.getTime() <= endTime.getTime()) {
+  while (current.getTime() > endTime.getTime()) {
     result.push(new Date(current));
     current.setDate(current.getDate() + 1);
killedBy: eachDay returns each day between two dates (inclusive)
statusReason: expected [] to have a length of 3 but got +0

[Timeout] ArithmeticOperator
helpers/date/sequence.ts:40:21
 
   while (current.getTime() <= endTime.getTime()) {
     result.push(new Date(current));
-    current.setDate(current.getDate() + 1);
+    current.setDate(current.getDate() - 1);
   }
 

[Timeout] MethodExpression
helpers/date/sequence.ts:40:5
 
   while (current.getTime() <= endTime.getTime()) {
     result.push(new Date(current));
-    current.setDate(current.getDate() + 1);
+    current.setTime(current.getDate() + 1);
   }
 

[Killed] BlockStatement
helpers/date/sequence.ts:64:67
  * @see Temporal alternative: iterate with `plainDate.add({ months: 1 })`
  * @since 2.0.0
  */
-export function eachMonth(start: DateLike, end: DateLike): Date[] {
-  const s = ensureDate(start);
-  const e = ensureDate(end);
-  if (!s || !e) return [];
-
-  const result: Date[] = [];
-  const current = new Date(s.getFullYear(), s.getMonth(), 1);
-  const endMonth = new Date(e.getFullYear(), e.getMonth(), 1);
-
-  while (current.getTime() <= endMonth.getTime()) {
-    result.push(new Date(current));
-    current.setMonth(current.getMonth() + 1);
-  }
-
-  return result;
-}
+export function eachMonth(start: DateLike, end: DateLike): Date[] {}
 
killedBy: eachMonth — property-based all dates are the 1st of their month
statusReason: Property failed after 1 tests
{ seed: -667222396, path: "0:0:0", endOnFailure: true }
Counterexample: [new Date("2024-01-01T00:00:00.000Z"),new Date("2024-01-01T00:00:00.000Z")]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/date/sequence.ts:73:10
   const current = new Date(s.getFullYear(), s.getMonth(), 1);
   const endMonth = new Date(e.getFullYear(), e.getMonth(), 1);
 
-  while (current.getTime() <= endMonth.getTime()) {
+  while (current.getTime() < endMonth.getTime()) {
     result.push(new Date(current));
     current.setMonth(current.getMonth() + 1);
killedBy: eachMonth — property-based length equals the number of months in the range
statusReason: Property failed after 1 tests
{ seed: 54276345, path: "0:0:0", endOnFailure: true }
Counterexample: [new Date("2024-01-01T00:00:00.000Z"),new Date("2024-01-01T00:00:00.000Z")]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/date/sequence.ts:73:10
   const current = new Date(s.getFullYear(), s.getMonth(), 1);
   const endMonth = new Date(e.getFullYear(), e.getMonth(), 1);
 
-  while (current.getTime() <= endMonth.getTime()) {
+  while (current.getTime() > endMonth.getTime()) {
     result.push(new Date(current));
     current.setMonth(current.getMonth() + 1);
killedBy: eachMonth — property-based length equals the number of months in the range
statusReason: Property failed after 1 tests
{ seed: 267870063, path: "0:0:0", endOnFailure: true }
Counterexample: [new Date("2024-01-01T00:00:00.000Z"),new Date("2024-01-01T00:00:00.000Z")]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Timeout] ArithmeticOperator
helpers/date/sequence.ts:75:22
 
   while (current.getTime() <= endMonth.getTime()) {
     result.push(new Date(current));
-    current.setMonth(current.getMonth() + 1);
+    current.setMonth(current.getMonth() - 1);
   }
 

[Timeout] MethodExpression
helpers/date/sequence.ts:75:5
 
   while (current.getTime() <= endMonth.getTime()) {
     result.push(new Date(current));
-    current.setMonth(current.getMonth() + 1);
+    current.setFullYear(current.getMonth() + 1);
   }
 
