[Killed] BlockStatement
helpers/date/startOf.ts:36:75
  * @see Temporal alternative: `plainDateTime.with({ day: 1, hour: 0, ... })`
  * @since 2.0.0
  */
-export function startOf(date: DateLike, unit: DateTruncUnit): Date | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  const result = new Date(d);
-
-  switch (unit) {
-    case 'day': {
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
-    case 'month': {
-      result.setDate(1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
-    case 'year': {
-      result.setMonth(0, 1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
-  }
-}
+export function startOf(date: DateLike, unit: DateTruncUnit): Date | null {}
 
 /**
killedBy: startOf day should set to start of day
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:42:5
   const result = new Date(d);
 
   switch (unit) {
-    case 'day': {
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'day':
     case 'month': {
       result.setDate(1);
killedBy: startOf day should preserve date
statusReason: expected 1 to be 15 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:42:17
   const result = new Date(d);
 
   switch (unit) {
-    case 'day': {
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'day': {}
     case 'month': {
       result.setDate(1);
killedBy: startOf day should preserve date
statusReason: expected 1 to be 15 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:43:7
 
   switch (unit) {
     case 'day': {
-      result.setHours(0, 0, 0, 0);
+      result.setMinutes(0, 0, 0, 0);
       return result;
     }
killedBy: startOf day should set to start of day
statusReason: expected 14 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:46:5
       result.setHours(0, 0, 0, 0);
       return result;
     }
-    case 'month': {
-      result.setDate(1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'month':
     case 'year': {
       result.setMonth(0, 1);
killedBy: startOf month should preserve month and year
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:46:19
       result.setHours(0, 0, 0, 0);
       return result;
     }
-    case 'month': {
-      result.setDate(1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'month': {}
     case 'year': {
       result.setMonth(0, 1);
killedBy: startOf month should preserve month and year
statusReason: expected +0 to be 5 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:47:7
       return result;
     }
     case 'month': {
-      result.setDate(1);
+      result.setTime(1);
       result.setHours(0, 0, 0, 0);
       return result;
killedBy: startOf month should preserve month and year
statusReason: expected +0 to be 5 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:48:7
     }
     case 'month': {
       result.setDate(1);
-      result.setHours(0, 0, 0, 0);
+      result.setMinutes(0, 0, 0, 0);
       return result;
     }
killedBy: startOf month should set to first day and start of day
statusReason: expected 14 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:51:5
       result.setHours(0, 0, 0, 0);
       return result;
     }
-    case 'year': {
-      result.setMonth(0, 1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'year':
   }
 }
killedBy: startOf year should set to January 1st, start of day
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:51:18
       result.setHours(0, 0, 0, 0);
       return result;
     }
-    case 'year': {
-      result.setMonth(0, 1);
-      result.setHours(0, 0, 0, 0);
-      return result;
-    }
+    case 'year': {}
   }
 }
killedBy: startOf year should set to January 1st, start of day
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:52:7
       return result;
     }
     case 'year': {
-      result.setMonth(0, 1);
+      result.setFullYear(0, 1);
       result.setHours(0, 0, 0, 0);
       return result;
killedBy: startOf year should set to January 1st, start of day
statusReason: expected 1 to be +0 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:53:7
     }
     case 'year': {
       result.setMonth(0, 1);
-      result.setHours(0, 0, 0, 0);
+      result.setMinutes(0, 0, 0, 0);
       return result;
     }
killedBy: startOf year should set to January 1st, start of day
statusReason: expected 14 to be +0 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:79:73
  * @see Temporal alternative: `plainDateTime.with({ day: d.daysInMonth, hour: 23, ... })`
  * @since 2.0.0
  */
-export function endOf(date: DateLike, unit: DateTruncUnit): Date | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  const result = new Date(d);
-
-  switch (unit) {
-    case 'day': {
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
-    case 'month': {
-      result.setMonth(result.getMonth() + 1, 0);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
-    case 'year': {
-      result.setMonth(11, 31);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
-  }
-}
+export function endOf(date: DateLike, unit: DateTruncUnit): Date | null {}
 
killedBy: endOf day should set to end of day
statusReason: expected undefined to be 23 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:85:17
   const result = new Date(d);
 
   switch (unit) {
-    case 'day': {
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'day': {}
     case 'month': {
       result.setMonth(result.getMonth() + 1, 0);
killedBy: endOf day should preserve date
statusReason: expected 30 to be 15 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:85:5
   const result = new Date(d);
 
   switch (unit) {
-    case 'day': {
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'day':
     case 'month': {
       result.setMonth(result.getMonth() + 1, 0);
killedBy: endOf day should preserve date
statusReason: expected 30 to be 15 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:86:7
 
   switch (unit) {
     case 'day': {
-      result.setHours(23, 59, 59, 999);
+      result.setMinutes(23, 59, 59, 999);
       return result;
     }
killedBy: endOf day should set to end of day
statusReason: expected 14 to be 23 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:89:19
       result.setHours(23, 59, 59, 999);
       return result;
     }
-    case 'month': {
-      result.setMonth(result.getMonth() + 1, 0);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'month': {}
     case 'year': {
       result.setMonth(11, 31);
killedBy: endOf month should set to last day of month, end of day
statusReason: expected 31 to be 30 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:89:5
       result.setHours(23, 59, 59, 999);
       return result;
     }
-    case 'month': {
-      result.setMonth(result.getMonth() + 1, 0);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'month':
     case 'year': {
       result.setMonth(11, 31);
killedBy: endOf month should set to last day of month, end of day
statusReason: expected 31 to be 30 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/startOf.ts:90:23
       return result;
     }
     case 'month': {
-      result.setMonth(result.getMonth() + 1, 0);
+      result.setMonth(result.getMonth() - 1, 0);
       result.setHours(23, 59, 59, 999);
       return result;
killedBy: endOf month should handle February in leap year
statusReason: expected 31 to be 29 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:90:7
       return result;
     }
     case 'month': {
-      result.setMonth(result.getMonth() + 1, 0);
+      result.setFullYear(result.getMonth() + 1, 0);
       result.setHours(23, 59, 59, 999);
       return result;
killedBy: endOf month should set to last day of month, end of day
statusReason: expected 15 to be 30 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:91:7
     }
     case 'month': {
       result.setMonth(result.getMonth() + 1, 0);
-      result.setHours(23, 59, 59, 999);
+      result.setMinutes(23, 59, 59, 999);
       return result;
     }
killedBy: endOf month should set to last day of month, end of day
statusReason: expected 14 to be 23 // Object.is equality

[Killed] ConditionalExpression
helpers/date/startOf.ts:94:5
       result.setHours(23, 59, 59, 999);
       return result;
     }
-    case 'year': {
-      result.setMonth(11, 31);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'year':
   }
 }
killedBy: endOf year should set to December 31st, end of day
statusReason: expected undefined to be 11 // Object.is equality

[Killed] BlockStatement
helpers/date/startOf.ts:94:18
       result.setHours(23, 59, 59, 999);
       return result;
     }
-    case 'year': {
-      result.setMonth(11, 31);
-      result.setHours(23, 59, 59, 999);
-      return result;
-    }
+    case 'year': {}
   }
 }
killedBy: endOf year should set to December 31st, end of day
statusReason: expected undefined to be 11 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:95:7
       return result;
     }
     case 'year': {
-      result.setMonth(11, 31);
+      result.setFullYear(11, 31);
       result.setHours(23, 59, 59, 999);
       return result;
killedBy: endOf year should set to December 31st, end of day
statusReason: expected 7 to be 11 // Object.is equality

[Killed] MethodExpression
helpers/date/startOf.ts:96:7
     }
     case 'year': {
       result.setMonth(11, 31);
-      result.setHours(23, 59, 59, 999);
+      result.setMinutes(23, 59, 59, 999);
       return result;
     }
killedBy: endOf year should set to December 31st, end of day
statusReason: expected 14 to be 23 // Object.is equality
