[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:26:16
 
 /** Internal thresholds expressed in milliseconds. */
 const SECOND = 1_000;
-const MINUTE = 60 * SECOND;
+const MINUTE = 60 / SECOND;
 const HOUR = 60 * MINUTE;
 const DAY = 24 * HOUR;
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '12 months ago' to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:27:14
 /** Internal thresholds expressed in milliseconds. */
 const SECOND = 1_000;
 const MINUTE = 60 * SECOND;
-const HOUR = 60 * MINUTE;
+const HOUR = 60 / MINUTE;
 const DAY = 24 * HOUR;
 const MONTH = 30 * DAY;
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '3,425 years ago' to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:28:13
 const SECOND = 1_000;
 const MINUTE = 60 * SECOND;
 const HOUR = 60 * MINUTE;
-const DAY = 24 * HOUR;
+const DAY = 24 / HOUR;
 const MONTH = 30 * DAY;
 const YEAR = 365 * DAY;
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '12,328,767 years ago' to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:29:15
 const MINUTE = 60 * SECOND;
 const HOUR = 60 * MINUTE;
 const DAY = 24 * HOUR;
-const MONTH = 30 * DAY;
+const MONTH = 30 / DAY;
 const YEAR = 365 * DAY;
 
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '86,400,000,000 months ago' to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:30:14
 const HOUR = 60 * MINUTE;
 const DAY = 24 * HOUR;
 const MONTH = 30 * DAY;
-const YEAR = 365 * DAY;
+const YEAR = 365 / DAY;
 
 /**
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '7,101,369,863 years ago' to be '30 seconds ago' // Object.is equality

[Killed] StringLiteral
helpers/date/timeAgo.ts:42:11
   { unit: 'day', ms: DAY },
   { unit: 'hour', ms: HOUR },
   { unit: 'minute', ms: MINUTE },
-  { unit: 'second', ms: SECOND },
+  { unit: "", ms: SECOND },
 ];
 
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: Invalid unit argument for Intl.RelativeTimeFormat.prototype.format() ''

[Killed] BlockStatement
helpers/date/timeAgo.ts:72:18
 export function timeAgo(
   date: DateLike,
   options: TimeAgoOptions = {}
-): string | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-
-  const nowDate = options.now ? ensureDate(options.now) : new Date();
-  if (!nowDate) return null;
-
-  const diffMs = d.getTime() - nowDate.getTime();
-  const absDiff = Math.abs(diffMs);
-
-  const rtf = new Intl.RelativeTimeFormat(options.locale ?? 'en', {
-    numeric: options.numeric ?? 'auto',
-  });
-
-  for (const { unit, ms } of UNITS) {
-    if (absDiff >= ms) {
-      const value = Math.round(diffMs / ms);
-      return rtf.format(value, unit);
-    }
-  }
-
-  // Less than 1 second — "now" / "just now" depending on numeric style
-  return rtf.format(0, 'second');
-}
+): string | null {}
 
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected undefined to be '30 seconds ago' // Object.is equality

[Killed] ConditionalExpression
helpers/date/timeAgo.ts:77:7
   if (!d) return null;
 
   const nowDate = options.now ? ensureDate(options.now) : new Date();
-  if (!nowDate) return null;
+  if (false) return null;
 
   const diffMs = d.getTime() - nowDate.getTime();
killedBy: timeAgo — edge cases returns null for invalid now
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] BooleanLiteral
helpers/date/timeAgo.ts:77:7
   if (!d) return null;
 
   const nowDate = options.now ? ensureDate(options.now) : new Date();
-  if (!nowDate) return null;
+  if (nowDate) return null;
 
   const diffMs = d.getTime() - nowDate.getTime();
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected null to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:79:18
   const nowDate = options.now ? ensureDate(options.now) : new Date();
   if (!nowDate) return null;
 
-  const diffMs = d.getTime() - nowDate.getTime();
+  const diffMs = d.getTime() + nowDate.getTime();
   const absDiff = Math.abs(diffMs);
 
killedBy: timeAgo — property-based past dates produce "ago" in English
statusReason: Property failed after 1 tests
{ seed: 1980168646, path: "0:0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/date/timeAgo.ts:82:43
   const diffMs = d.getTime() - nowDate.getTime();
   const absDiff = Math.abs(diffMs);
 
-  const rtf = new Intl.RelativeTimeFormat(options.locale ?? 'en', {
+  const rtf = new Intl.RelativeTimeFormat(options.locale && 'en', {
     numeric: options.numeric ?? 'auto',
   });
killedBy: timeAgo — locale support formats in French
statusReason: expected '5 days ago' to match /jour/

[Killed] ObjectLiteral
helpers/date/timeAgo.ts:82:67
   const diffMs = d.getTime() - nowDate.getTime();
   const absDiff = Math.abs(diffMs);
 
-  const rtf = new Intl.RelativeTimeFormat(options.locale ?? 'en', {
-    numeric: options.numeric ?? 'auto',
-  });
+  const rtf = new Intl.RelativeTimeFormat(options.locale ?? 'en', {});
 
   for (const { unit, ms } of UNITS) {
killedBy: timeAgo — edge cases returns "now" for identical dates with numeric auto
statusReason: expected 'in 0 seconds' to be 'now' // Object.is equality

[Killed] LogicalOperator
helpers/date/timeAgo.ts:83:14
   const absDiff = Math.abs(diffMs);
 
   const rtf = new Intl.RelativeTimeFormat(options.locale ?? 'en', {
-    numeric: options.numeric ?? 'auto',
+    numeric: options.numeric && 'auto',
   });
 
killedBy: timeAgo — property-based past dates produce "ago" in English
statusReason: Property failed after 6 tests
{ seed: 255714895, path: "5:12:0:0:4:1:2:2:5:0:1:0:1:0", endOnFailure: true }
Counterexample: [new Date("2024-12-05T12:00:00.000Z")]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/timeAgo.ts:86:37
     numeric: options.numeric ?? 'auto',
   });
 
-  for (const { unit, ms } of UNITS) {
-    if (absDiff >= ms) {
-      const value = Math.round(diffMs / ms);
-      return rtf.format(value, unit);
-    }
-  }
+  for (const { unit, ms } of UNITS) {}
 
   // Less than 1 second — "now" / "just now" depending on numeric style
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected 'in 0 seconds' to be '30 seconds ago' // Object.is equality

[Killed] ConditionalExpression
helpers/date/timeAgo.ts:87:9
   });
 
   for (const { unit, ms } of UNITS) {
-    if (absDiff >= ms) {
+    if (false) {
       const value = Math.round(diffMs / ms);
       return rtf.format(value, unit);
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected 'in 0 seconds' to be '30 seconds ago' // Object.is equality

[Killed] ConditionalExpression
helpers/date/timeAgo.ts:87:9
   });
 
   for (const { unit, ms } of UNITS) {
-    if (absDiff >= ms) {
+    if (true) {
       const value = Math.round(diffMs / ms);
       return rtf.format(value, unit);
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '0 years ago' to be '30 seconds ago' // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timeAgo.ts:88:32
 
   for (const { unit, ms } of UNITS) {
     if (absDiff >= ms) {
-      const value = Math.round(diffMs / ms);
+      const value = Math.round(diffMs * ms);
       return rtf.format(value, unit);
     }
killedBy: timeAgo — past dates returns "X seconds ago" for < 1 minute
statusReason: expected '30,000,000 seconds ago' to be '30 seconds ago' // Object.is equality
