[Killed] BlockStatement
helpers/date/timestamp.ts:16:66
  * @returns True if timestamp appears to be in seconds
  * @since 1.9.0
  */
-export function isTimestampInSeconds(timestamp: number): boolean {
-  // Timestamps before year 2001 in milliseconds are less than 10^10
-  // Use Math.abs to correctly handle negative timestamps (before epoch)
-  return Math.abs(timestamp) < 10000000000;
-}
+export function isTimestampInSeconds(timestamp: number): boolean {}
 
 /**
killedBy: ensureDate valid inputs should handle second timestamps
statusReason: expected 1642694400 to be 1642694400000 // Object.is equality

[Killed] ConditionalExpression
helpers/date/timestamp.ts:19:10
 export function isTimestampInSeconds(timestamp: number): boolean {
   // Timestamps before year 2001 in milliseconds are less than 10^10
   // Use Math.abs to correctly handle negative timestamps (before epoch)
-  return Math.abs(timestamp) < 10000000000;
+  return false;
 }
 
killedBy: ensureDate — contract unix timestamp in seconds → Date (normalized to ms)
statusReason: expected 1000000000 to be 1000000000000 // Object.is equality

[Killed] EqualityOperator
helpers/date/timestamp.ts:19:10
 export function isTimestampInSeconds(timestamp: number): boolean {
   // Timestamps before year 2001 in milliseconds are less than 10^10
   // Use Math.abs to correctly handle negative timestamps (before epoch)
-  return Math.abs(timestamp) < 10000000000;
+  return Math.abs(timestamp) >= 10000000000;
 }
 
killedBy: range — contract clampDate with timestamp DateLike
statusReason: expected '2025-12-31T00:00:00.000Z' to contain '2025-01-01'

[Killed] BlockStatement
helpers/date/timestamp.ts:28:63
  * @returns Timestamp in milliseconds
  * @since 1.9.0
  */
-export function normalizeTimestamp(timestamp: number): number {
-  return isTimestampInSeconds(timestamp) ? timestamp * 1000 : timestamp;
-}
+export function normalizeTimestamp(timestamp: number): number {}
 
 /**
killedBy: ensureDate — property-based valid ms timestamps (>=10^10) always return a Date
statusReason: Property failed after 1 tests
{ seed: 640907859, path: "0:0", endOnFailure: true }
Counterexample: [10000000000]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/timestamp.ts:29:44
  * @since 1.9.0
  */
 export function normalizeTimestamp(timestamp: number): number {
-  return isTimestampInSeconds(timestamp) ? timestamp * 1000 : timestamp;
+  return isTimestampInSeconds(timestamp) ? timestamp / 1000 : timestamp;
 }
 
killedBy: ensureDate valid inputs should handle second timestamps
statusReason: expected 1642694 to be 1642694400000 // Object.is equality

[Killed] BlockStatement
helpers/date/timestamp.ts:46:58
  *
  * @since 2.0.0
  */
-export function toSeconds(date: DateLike): number | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  return Math.floor(d.getTime() / 1000);
-}
+export function toSeconds(date: DateLike): number | null {}
 
 /**
killedBy: toSeconds / toMillis — property-based toSeconds × 1000 ≤ toMillis (floor truncation)
statusReason: Property failed after 1 tests
{ seed: -749653030, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/timestamp.ts:49:21
 export function toSeconds(date: DateLike): number | null {
   const d = ensureDate(date);
   if (!d) return null;
-  return Math.floor(d.getTime() / 1000);
+  return Math.floor(d.getTime() * 1000);
 }
 
killedBy: toSeconds / toMillis — property-based toSeconds × 1000 ≤ toMillis (floor truncation)
statusReason: Property failed after 1 tests
{ seed: 894094321, path: "0:1:0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.001Z")]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/timestamp.ts:66:57
  *
  * @since 2.0.0
  */
-export function toMillis(date: DateLike): number | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-  return d.getTime();
-}
+export function toMillis(date: DateLike): number | null {}
 
 /**
killedBy: toSeconds / toMillis — property-based toMillis returns the same value as Date.getTime()
statusReason: Property failed after 1 tests
{ seed: 511826105, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/timestamp.ts:88:59
  *
  * @since 2.0.0
  */
-export function fromSeconds(seconds: number): Date | null {
-  if (!Number.isFinite(seconds)) return null;
-  return new Date(seconds * 1000);
-}
+export function fromSeconds(seconds: number): Date | null {}
 
 /**
killedBy: fromSeconds / fromMillis — property-based fromSeconds round-trips with toSeconds
statusReason: Property failed after 1 tests
{ seed: -585066022, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/timestamp.ts:89:7
  * @since 2.0.0
  */
 export function fromSeconds(seconds: number): Date | null {
-  if (!Number.isFinite(seconds)) return null;
+  if (true) return null;
   return new Date(seconds * 1000);
 }
killedBy: fromSeconds creates a Date from epoch seconds
statusReason: expected null to deeply equal 2025-01-19T12:00:00.000Z

[Killed] BooleanLiteral
helpers/date/timestamp.ts:89:7
  * @since 2.0.0
  */
 export function fromSeconds(seconds: number): Date | null {
-  if (!Number.isFinite(seconds)) return null;
+  if (Number.isFinite(seconds)) return null;
   return new Date(seconds * 1000);
 }
killedBy: fromSeconds / fromMillis — property-based fromSeconds round-trips with toSeconds
statusReason: Property failed after 1 tests
{ seed: 1403781011, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/timestamp.ts:90:19
  */
 export function fromSeconds(seconds: number): Date | null {
   if (!Number.isFinite(seconds)) return null;
-  return new Date(seconds * 1000);
+  return new Date(seconds / 1000);
 }
 
killedBy: fromSeconds / fromMillis — property-based fromSeconds round-trips with toSeconds
statusReason: Property failed after 1 tests
{ seed: -2057489373, path: "0:1:0:0:0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/timestamp.ts:109:53
  *
  * @since 2.0.0
  */
-export function fromMillis(ms: number): Date | null {
-  if (!Number.isFinite(ms)) return null;
-  return new Date(ms);
-}
+export function fromMillis(ms: number): Date | null {}
 
killedBy: fromMillis creates a Date from epoch millis
statusReason: expected undefined to deeply equal 2025-01-19T12:00:00.000Z

[Killed] BooleanLiteral
helpers/date/timestamp.ts:110:7
  * @since 2.0.0
  */
 export function fromMillis(ms: number): Date | null {
-  if (!Number.isFinite(ms)) return null;
+  if (Number.isFinite(ms)) return null;
   return new Date(ms);
 }
killedBy: fromSeconds / fromMillis — property-based fromMillis round-trips with toMillis
statusReason: Property failed after 1 tests
{ seed: -1199909722, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/timestamp.ts:110:7
  * @since 2.0.0
  */
 export function fromMillis(ms: number): Date | null {
-  if (!Number.isFinite(ms)) return null;
+  if (true) return null;
   return new Date(ms);
 }
killedBy: fromSeconds / fromMillis — property-based fromMillis round-trips with toMillis
statusReason: Property failed after 1 tests
{ seed: -1420904165, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
