[Killed] BlockStatement
helpers/date/timezone.ts:35:43
  * @see Temporal alternative: `Temporal.TimeZone.from(id)`
  * @since 2.0.0
  */
-export function listTimezones(): string[] {
-  return Intl.supportedValuesOf('timeZone');
-}
+export function listTimezones(): string[] {}
 
 /**
killedBy: listTimezones returns an array of strings
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/date/timezone.ts:36:33
  * @since 2.0.0
  */
 export function listTimezones(): string[] {
-  return Intl.supportedValuesOf('timeZone');
+  return Intl.supportedValuesOf("");
 }
 
killedBy: listTimezones returns an array of strings
statusReason: Invalid key :

[Killed] StringLiteral
helpers/date/timezone.ts:72:12
       timeZone: tz,
       year: 'numeric',
       month: '2-digit',
-      day: '2-digit',
+      day: "",
       hour: '2-digit',
       minute: '2-digit',
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected null to be -300 // Object.is equality

[Killed] BooleanLiteral
helpers/date/timezone.ts:76:15
       hour: '2-digit',
       minute: '2-digit',
       second: '2-digit',
-      hour12: false,
+      hour12: true,
     });
 
killedBy: getTimezoneOffset returns 60 for Paris in winter (CET)
statusReason: expected -660 to be 60 // Object.is equality

[Killed] ArrowFunction
helpers/date/timezone.ts:80:17
     });
 
     const parts = formatter.formatToParts(d);
-    const get = (type: Intl.DateTimeFormatPartTypes): string =>
-      parts.find((p) => p.type === type)!.value;
+    const get = () => undefined;
 
     const year = Number(get('year'));
killedBy: getTimezoneOffset — property-based UTC always returns 0
statusReason: Property failed after 1 tests
{ seed: 909358814, path: "0:0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/date/timezone.ts:81:25
 
     const parts = formatter.formatToParts(d);
     const get = (type: Intl.DateTimeFormatPartTypes): string =>
-      parts.find((p) => p.type === type)!.value;
+      parts.find((p) => true)!.value;
 
     const year = Number(get('year'));
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected -65245619 to be -300 // Object.is equality

[Killed] ConditionalExpression
helpers/date/timezone.ts:81:25
 
     const parts = formatter.formatToParts(d);
     const get = (type: Intl.DateTimeFormatPartTypes): string =>
-      parts.find((p) => p.type === type)!.value;
+      parts.find((p) => false)!.value;
 
     const year = Number(get('year'));
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected null to be -300 // Object.is equality

[Killed] StringLiteral
helpers/date/timezone.ts:84:30
       parts.find((p) => p.type === type)!.value;
 
     const year = Number(get('year'));
-    const month = Number(get('month'));
+    const month = Number(get(""));
     const day = Number(get('day'));
     // hour12:false + en-US can produce "24" for midnight → normalise
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected null to be -300 // Object.is equality

[Killed] StringLiteral
helpers/date/timezone.ts:85:28
 
     const year = Number(get('year'));
     const month = Number(get('month'));
-    const day = Number(get('day'));
+    const day = Number(get(""));
     // hour12:false + en-US can produce "24" for midnight → normalise
     const hour = Number(get('hour')) % 24;
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected null to be -300 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timezone.ts:87:18
     const month = Number(get('month'));
     const day = Number(get('day'));
     // hour12:false + en-US can produce "24" for midnight → normalise
-    const hour = Number(get('hour')) % 24;
+    const hour = Number(get('hour')) * 24;
     const minute = Number(get('minute'));
     const second = Number(get('second'));
killedBy: getTimezoneOffset — property-based UTC always returns 0
statusReason: Property failed after 2 tests
{ seed: -793283244, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:2:0:0:2:1:0:0:2:2", endOnFailure: true }
Counterexample: [new Date("2000-01-01T01:00:00.000Z")]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/timezone.ts:92:39
     const second = Number(get('second'));
 
     // Build a UTC timestamp from the local parts
-    const localAsUtc = Date.UTC(year, month - 1, day, hour, minute, second);
+    const localAsUtc = Date.UTC(year, month + 1, day, hour, minute, second);
     // Truncate d to second precision for a clean comparison
     const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
killedBy: getTimezoneOffset — property-based UTC always returns 0
statusReason: Property failed after 1 tests
{ seed: -1456001341, path: "0:0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/date/timezone.ts:94:30
     // Build a UTC timestamp from the local parts
     const localAsUtc = Date.UTC(year, month - 1, day, hour, minute, second);
     // Truncate d to second precision for a clean comparison
-    const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
+    const utcMs = Math.floor(d.getTime() * 1_000) * 1_000;
 
     return Math.round((localAsUtc - utcMs) / 60_000);
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected -28954771045500 to be -300 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timezone.ts:94:19
     // Build a UTC timestamp from the local parts
     const localAsUtc = Date.UTC(year, month - 1, day, hour, minute, second);
     // Truncate d to second precision for a clean comparison
-    const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
+    const utcMs = Math.floor(d.getTime() / 1_000) / 1_000;
 
     return Math.round((localAsUtc - utcMs) / 60_000);
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected 28954471 to be -300 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timezone.ts:96:23
     // Truncate d to second precision for a clean comparison
     const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
 
-    return Math.round((localAsUtc - utcMs) / 60_000);
+    return Math.round((localAsUtc - utcMs) * 60_000);
   } catch {
     // Invalid timezone identifier
killedBy: getTimezoneOffset returns -300 for New York in winter (EST)
statusReason: expected -1080000000000 to be -300 // Object.is equality

[Killed] ArithmeticOperator
helpers/date/timezone.ts:96:24
     // Truncate d to second precision for a clean comparison
     const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
 
-    return Math.round((localAsUtc - utcMs) / 60_000);
+    return Math.round((localAsUtc + utcMs) / 60_000);
   } catch {
     // Invalid timezone identifier
killedBy: getTimezoneOffset — property-based UTC always returns 0
statusReason: Property failed after 1 tests
{ seed: -833459200, path: "0:0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/date/timezone.ts:97:11
     const utcMs = Math.floor(d.getTime() / 1_000) * 1_000;
 
     return Math.round((localAsUtc - utcMs) / 60_000);
-  } catch {
-    // Invalid timezone identifier
-    return null;
-  }
+  } catch {}
 }
 
killedBy: getTimezoneOffset returns null for invalid timezone
statusReason: expected undefined to be null

[Killed] BlockStatement
helpers/date/timezone.ts:129:18
   date: DateLike,
   tz: string,
   options: FormatInTimezoneOptions = {}
-): string | null {
-  const d = ensureDate(date);
-  if (!d) return null;
-
-  const { locale = 'en-US', formatOptions = {} } = options;
-
-  try {
-    const formatter = new Intl.DateTimeFormat(locale, {
-      ...formatOptions,
-      timeZone: tz,
-    });
-    return formatter.format(d);
-  } catch {
-    return null;
-  }
-}
+): string | null {}
 
killedBy: formatInTimezone formats a date in Asia/Tokyo (default en-US)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
helpers/date/timezone.ts:135:7
 
   const { locale = 'en-US', formatOptions = {} } = options;
 
-  try {
-    const formatter = new Intl.DateTimeFormat(locale, {
-      ...formatOptions,
-      timeZone: tz,
-    });
-    return formatter.format(d);
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: formatInTimezone formats a date in Asia/Tokyo (default en-US)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ObjectLiteral
helpers/date/timezone.ts:136:55
   const { locale = 'en-US', formatOptions = {} } = options;
 
   try {
-    const formatter = new Intl.DateTimeFormat(locale, {
-      ...formatOptions,
-      timeZone: tz,
-    });
+    const formatter = new Intl.DateTimeFormat(locale, {});
     return formatter.format(d);
   } catch {
killedBy: timezone — contract invalid inputs return null
statusReason: expected '1/19/2025' to be null

[Killed] BlockStatement
helpers/date/timezone.ts:141:11
       timeZone: tz,
     });
     return formatter.format(d);
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: formatInTimezone returns null for invalid timezone
statusReason: expected undefined to be null
