[Killed] BlockStatement
helpers/date/validate.ts:28:59
  *
  * @since 2.0.0
  */
-export function isValidDateString(input: string): boolean {
-  if (!input) return false;
-  return !isNaN(new Date(input).getTime());
-}
+export function isValidDateString(input: string): boolean {}
 
killedBy: isValidDateString valid ISO 8601 strings YYYY-MM-DD
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
helpers/date/validate.ts:29:7
  * @since 2.0.0
  */
 export function isValidDateString(input: string): boolean {
-  if (!input) return false;
+  if (input) return false;
   return !isNaN(new Date(input).getTime());
 }
killedBy: isValidDateString valid ISO 8601 strings YYYY-MM-DD
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/validate.ts:29:7
  * @since 2.0.0
  */
 export function isValidDateString(input: string): boolean {
-  if (!input) return false;
+  if (true) return false;
   return !isNaN(new Date(input).getTime());
 }
killedBy: isValidDateString valid ISO 8601 strings YYYY-MM-DD
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/date/validate.ts:30:10
  */
 export function isValidDateString(input: string): boolean {
   if (!input) return false;
-  return !isNaN(new Date(input).getTime());
+  return isNaN(new Date(input).getTime());
 }
 
killedBy: isValidDateString valid ISO 8601 strings YYYY-MM-DD
statusReason: expected false to be true // Object.is equality
