[Killed] BlockStatement
helpers/date/weekday.ts:78:12
 export function isWeekend(
   date: DateLike,
   weekendDays: readonly WeekDay[] = DEFAULT_WEEKEND
-): boolean {
-  const d = ensureDate(date);
-  if (!d) return false;
-  return weekendDays.includes(d.getDay() as WeekDay);
-}
+): boolean {}
 
 /**
killedBy: isWeekend — default weekend returns true for Saturday
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/weekday.ts:80:7
   weekendDays: readonly WeekDay[] = DEFAULT_WEEKEND
 ): boolean {
   const d = ensureDate(date);
-  if (!d) return false;
+  if (true) return false;
   return weekendDays.includes(d.getDay() as WeekDay);
 }
killedBy: isWeekend — default weekend returns true for Saturday
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/date/weekday.ts:80:7
   weekendDays: readonly WeekDay[] = DEFAULT_WEEKEND
 ): boolean {
   const d = ensureDate(date);
-  if (!d) return false;
+  if (false) return false;
   return weekendDays.includes(d.getDay() as WeekDay);
 }
killedBy: isWeekend — edge cases returns false for invalid input
statusReason: Cannot read properties of null (reading 'getDay')

[Killed] BlockStatement
helpers/date/weekday.ts:114:12
 export function isBusinessDay(
   date: DateLike,
   weekendDays: readonly WeekDay[] = DEFAULT_WEEKEND
-): boolean {
-  const d = ensureDate(date);
-  if (!d) return false;
-  return !weekendDays.includes(d.getDay() as WeekDay);
-}
+): boolean {}
 
killedBy: isWeekend / isBusinessDay — property-based with empty weekendDays, isBusinessDay is always true
statusReason: Property failed after 1 tests
{ seed: 1569043352, path: "0", endOnFailure: true }
Counterexample: [new Date("2000-01-01T00:00:00.000Z")]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/date/weekday.ts:116:7
   weekendDays: readonly WeekDay[] = DEFAULT_WEEKEND
 ): boolean {
   const d = ensureDate(date);
-  if (!d) return false;
+  if (d) return false;
   return !weekendDays.includes(d.getDay() as WeekDay);
 }
killedBy: isBusinessDay — default weekend returns true for Monday
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/date/weekday.ts:117:10
 ): boolean {
   const d = ensureDate(date);
   if (!d) return false;
-  return !weekendDays.includes(d.getDay() as WeekDay);
+  return weekendDays.includes(d.getDay() as WeekDay);
 }
 
killedBy: isBusinessDay — default weekend returns true for Monday
statusReason: expected false to be true // Object.is equality
