[Killed] BlockStatement
helpers/function/compose.ts:32:87
 export function compose<A, B, C, D, E, F, G>(fn6: (f: F) => G, fn5: (e: E) => F, fn4: (d: D) => E, fn3: (c: C) => D, fn2: (b: B) => C, fn1: (a: A) => B): (a: A) => G;
 export function compose<A, B, C, D, E, F, G, H>(fn7: (g: G) => H, fn6: (f: F) => G, fn5: (e: E) => F, fn4: (d: D) => E, fn3: (c: C) => D, fn2: (b: B) => C, fn1: (a: A) => B): (a: A) => H;
-export function compose(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduceRight((acc, fn) => fn(acc), x);
-}
+export function compose(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {}
 
killedBy: compose applies functions right-to-left
statusReason: compose(...) is not a function

[Killed] ArrowFunction
helpers/function/compose.ts:33:42
 export function compose<A, B, C, D, E, F, G, H>(fn7: (g: G) => H, fn6: (f: F) => G, fn5: (e: E) => F, fn4: (d: D) => E, fn3: (c: C) => D, fn2: (b: B) => C, fn1: (a: A) => B): (a: A) => H;
 export function compose(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduceRight((acc, fn) => fn(acc), x);
+  return (x: unknown) => fns.reduceRight(() => undefined, x);
 }
 
killedBy: compose applies functions right-to-left
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArrowFunction
helpers/function/compose.ts:33:10
 export function compose<A, B, C, D, E, F, G, H>(fn7: (g: G) => H, fn6: (f: F) => G, fn5: (e: E) => F, fn4: (d: D) => E, fn3: (c: C) => D, fn2: (b: B) => C, fn1: (a: A) => B): (a: A) => H;
 export function compose(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduceRight((acc, fn) => fn(acc), x);
+  return () => undefined;
 }
 
killedBy: compose applies functions right-to-left
statusReason: expected undefined to be 8 // Object.is equality
