[Killed] BlockStatement
helpers/function/curry.ts:28:69
 export function curry<A, B, C, R>(fn: (a: A, b: B, c: C) => R): (a: A) => (b: B) => (c: C) => R;
 export function curry<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R): (a: A) => (b: B) => (c: C) => (d: D) => R;
 export function curry<A, B, C, D, E, R>(fn: (a: A, b: B, c: C, d: D, e: E) => R): (a: A) => (b: B) => (c: C) => (d: D) => (e: E) => R;
-export function curry(fn: (...args: unknown[]) => unknown): unknown {
-  function curried(...args: unknown[]): unknown {
-    if (args.length >= fn.length) return fn(...args);
-    return (...more: unknown[]) => curried(...args, ...more);
-  }
-  return curried;
-}
+export function curry(fn: (...args: unknown[]) => unknown): unknown {}
 
killedBy: curry arity 1: returns the function unchanged (wraps identity)
statusReason: curried is not a function

[Killed] BlockStatement
helpers/function/curry.ts:29:49
 export function curry<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R): (a: A) => (b: B) => (c: C) => (d: D) => R;
 export function curry<A, B, C, D, E, R>(fn: (a: A, b: B, c: C, d: D, e: E) => R): (a: A) => (b: B) => (c: C) => (d: D) => (e: E) => R;
 export function curry(fn: (...args: unknown[]) => unknown): unknown {
-  function curried(...args: unknown[]): unknown {
-    if (args.length >= fn.length) return fn(...args);
-    return (...more: unknown[]) => curried(...args, ...more);
-  }
+  function curried(...args: unknown[]): unknown {}
   return curried;
 }
killedBy: curry arity 1: returns the function unchanged (wraps identity)
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
helpers/function/curry.ts:30:9
 export function curry<A, B, C, D, E, R>(fn: (a: A, b: B, c: C, d: D, e: E) => R): (a: A) => (b: B) => (c: C) => (d: D) => (e: E) => R;
 export function curry(fn: (...args: unknown[]) => unknown): unknown {
   function curried(...args: unknown[]): unknown {
-    if (args.length >= fn.length) return fn(...args);
+    if (true) return fn(...args);
     return (...more: unknown[]) => curried(...args, ...more);
   }
killedBy: curry arity 2: returns a function after first call
statusReason: expected 'number' to be 'function' // Object.is equality

[Killed] EqualityOperator
helpers/function/curry.ts:30:9
 export function curry<A, B, C, D, E, R>(fn: (a: A, b: B, c: C, d: D, e: E) => R): (a: A) => (b: B) => (c: C) => (d: D) => (e: E) => R;
 export function curry(fn: (...args: unknown[]) => unknown): unknown {
   function curried(...args: unknown[]): unknown {
-    if (args.length >= fn.length) return fn(...args);
+    if (args.length > fn.length) return fn(...args);
     return (...more: unknown[]) => curried(...args, ...more);
   }
killedBy: curry arity 1: returns the function unchanged (wraps identity)
statusReason: expected [Function] to be 10 // Object.is equality

[Killed] ArrowFunction
helpers/function/curry.ts:31:12
 export function curry(fn: (...args: unknown[]) => unknown): unknown {
   function curried(...args: unknown[]): unknown {
     if (args.length >= fn.length) return fn(...args);
-    return (...more: unknown[]) => curried(...args, ...more);
+    return () => undefined;
   }
   return curried;
killedBy: curry arity 2: returns a function after first call
statusReason: expected undefined to be 8 // Object.is equality
