[Killed] BlockStatement
helpers/function/debounce.ts:17:25
 export function debounce<A extends unknown[], R>(
   func: (...args: A) => R,
   delay: number
-): (...args: A) => void {
-  let timeoutId: ReturnType<typeof setTimeout> | null = null;
-
-  return (...args: A) => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
-    timeoutId = setTimeout(() => func(...args), delay);
-  };
-}
+): (...args: A) => void {}
 
killedBy: debounce — contract calling multiple times rapidly → only last call executes after delay
statusReason: debounced is not a function

[Killed] BlockStatement
helpers/function/debounce.ts:20:26
 ): (...args: A) => void {
   let timeoutId: ReturnType<typeof setTimeout> | null = null;
 
-  return (...args: A) => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
-    timeoutId = setTimeout(() => func(...args), delay);
-  };
+  return (...args: A) => {};
 }
 
killedBy: debounce — contract calling multiple times rapidly → only last call executes after delay
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
helpers/function/debounce.ts:21:9
   let timeoutId: ReturnType<typeof setTimeout> | null = null;
 
   return (...args: A) => {
-    if (timeoutId) {
+    if (false) {
       clearTimeout(timeoutId);
     }
killedBy: debounce — contract calling multiple times rapidly → only last call executes after delay
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] BlockStatement
helpers/function/debounce.ts:21:20
   let timeoutId: ReturnType<typeof setTimeout> | null = null;
 
   return (...args: A) => {
-    if (timeoutId) {
-      clearTimeout(timeoutId);
-    }
+    if (timeoutId) {}
     timeoutId = setTimeout(() => func(...args), delay);
   };
killedBy: debounce — contract calling multiple times rapidly → only last call executes after delay
statusReason: expected "vi.fn()" to be called 1 times, but got 3 times

[Killed] ArrowFunction
helpers/function/debounce.ts:24:28
     if (timeoutId) {
       clearTimeout(timeoutId);
     }
-    timeoutId = setTimeout(() => func(...args), delay);
+    timeoutId = setTimeout(() => undefined, delay);
   };
 }
killedBy: debounce — contract calling multiple times rapidly → only last call executes after delay
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
