[Killed] BlockStatement
helpers/function/flip.ts:26:37
  */
 export function flip<A, B, Rest extends unknown[], R>(
   fn: (a: A, b: B, ...rest: Rest) => R,
-): (b: B, a: A, ...rest: Rest) => R {
-  return (b: B, a: A, ...rest: Rest) => fn(a, b, ...rest);
-}
+): (b: B, a: A, ...rest: Rest) => R {}
 
killedBy: flip swaps the first two arguments
statusReason: flip(...) is not a function

[Killed] ArrowFunction
helpers/function/flip.ts:27:10
 export function flip<A, B, Rest extends unknown[], R>(
   fn: (a: A, b: B, ...rest: Rest) => R,
 ): (b: B, a: A, ...rest: Rest) => R {
-  return (b: B, a: A, ...rest: Rest) => fn(a, b, ...rest);
+  return () => undefined;
 }
 
killedBy: flip swaps the first two arguments
statusReason: expected undefined to be 7 // Object.is equality
