[Killed] BlockStatement
helpers/function/identity.ts:22:42
  * ```
  * @since 2.0.0
  */
-export function identity<T>(value: T): T {
-  return value;
-}
+export function identity<T>(value: T): T {}
 
killedBy: identity — property-based always returns the exact same number
statusReason: Property failed after 1 tests
{ seed: 1272022177, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
