[Killed] BlockStatement
helpers/function/negate.ts:24:28
  */
 export function negate<T extends unknown[]>(
   predicate: (...args: T) => boolean,
-): (...args: T) => boolean {
-  return (...args: T) => !predicate(...args);
-}
+): (...args: T) => boolean {}
 
killedBy: negate returns true when predicate returns false
statusReason: negate(...) is not a function

[Killed] ArrowFunction
helpers/function/negate.ts:25:10
 export function negate<T extends unknown[]>(
   predicate: (...args: T) => boolean,
 ): (...args: T) => boolean {
-  return (...args: T) => !predicate(...args);
+  return () => undefined;
 }
 
killedBy: negate returns true when predicate returns false
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
helpers/function/negate.ts:25:26
 export function negate<T extends unknown[]>(
   predicate: (...args: T) => boolean,
 ): (...args: T) => boolean {
-  return (...args: T) => !predicate(...args);
+  return (...args: T) => predicate(...args);
 }
 
killedBy: negate returns true when predicate returns false
statusReason: expected false to be true // Object.is equality
