[Killed] BlockStatement
helpers/function/partial.ts:29:122
 export function partial<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R, a: A): (b: B, c: C, d: D) => R;
 export function partial<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R, a: A, b: B): (c: C, d: D) => R;
 export function partial<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R, a: A, b: B, c: C): (d: D) => R;
-export function partial(fn: (...args: unknown[]) => unknown, ...partialArgs: unknown[]): (...rest: unknown[]) => unknown {
-  return (...rest: unknown[]) => fn(...partialArgs, ...rest);
-}
+export function partial(fn: (...args: unknown[]) => unknown, ...partialArgs: unknown[]): (...rest: unknown[]) => unknown {}
 
killedBy: partial pre-fills a single argument
statusReason: double is not a function

[Killed] ArrowFunction
helpers/function/partial.ts:30:10
 export function partial<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R, a: A, b: B): (c: C, d: D) => R;
 export function partial<A, B, C, D, R>(fn: (a: A, b: B, c: C, d: D) => R, a: A, b: B, c: C): (d: D) => R;
 export function partial(fn: (...args: unknown[]) => unknown, ...partialArgs: unknown[]): (...rest: unknown[]) => unknown {
-  return (...rest: unknown[]) => fn(...partialArgs, ...rest);
+  return () => undefined;
 }
 
killedBy: partial pre-fills a single argument
statusReason: expected undefined to be 10 // Object.is equality
