[Killed] BlockStatement
helpers/function/pipe.ts:33:84
 export function pipe<A, B, C, D, E, F, G>(fn1: (a: A) => B, fn2: (b: B) => C, fn3: (c: C) => D, fn4: (d: D) => E, fn5: (e: E) => F, fn6: (f: F) => G): (a: A) => G;
 export function pipe<A, B, C, D, E, F, G, H>(fn1: (a: A) => B, fn2: (b: B) => C, fn3: (c: C) => D, fn4: (d: D) => E, fn5: (e: E) => F, fn6: (f: F) => G, fn7: (g: G) => H): (a: A) => H;
-export function pipe(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduce((acc, fn) => fn(acc), x);
-}
+export function pipe(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {}
 
killedBy: compose is the reverse of pipe
statusReason: expected undefined to be defined

[Killed] ArrowFunction
helpers/function/pipe.ts:34:10
 export function pipe<A, B, C, D, E, F, G, H>(fn1: (a: A) => B, fn2: (b: B) => C, fn3: (c: C) => D, fn4: (d: D) => E, fn5: (e: E) => F, fn6: (f: F) => G, fn7: (g: G) => H): (a: A) => H;
 export function pipe(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduce((acc, fn) => fn(acc), x);
+  return () => undefined;
 }
 
killedBy: pipe applies functions left-to-right
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArrowFunction
helpers/function/pipe.ts:34:37
 export function pipe<A, B, C, D, E, F, G, H>(fn1: (a: A) => B, fn2: (b: B) => C, fn3: (c: C) => D, fn4: (d: D) => E, fn5: (e: E) => F, fn6: (f: F) => G, fn7: (g: G) => H): (a: A) => H;
 export function pipe(...fns: ((x: unknown) => unknown)[]): (x: unknown) => unknown {
-  return (x: unknown) => fns.reduce((acc, fn) => fn(acc), x);
+  return (x: unknown) => fns.reduce(() => undefined, x);
 }
 
killedBy: pipe applies functions left-to-right
statusReason: expected undefined to be 8 // Object.is equality
