[Killed] BlockStatement
helpers/function/returnOrThrowError.ts:17:86
  * @returns A defined value or an error.
  * @since 1.0.0
  */
-export function returnOrThrowError<T>(value: T | undefined | null, error: string): T {
-  if (isNullish(value)) {
-    throw new Error(error);
-  }
-  return value;
-}
+export function returnOrThrowError<T>(value: T | undefined | null, error: string): T {}
 
killedBy: returnOrThrowError — property-based for any non-null/non-undefined value, returns it unchanged
statusReason: Property failed after 1 tests
{ seed: -67597934, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/function/returnOrThrowError.ts:18:7
  * @since 1.0.0
  */
 export function returnOrThrowError<T>(value: T | undefined | null, error: string): T {
-  if (isNullish(value)) {
+  if (true) {
     throw new Error(error);
   }
killedBy: returnOrThrowError — property-based for any non-null/non-undefined value, returns it unchanged
statusReason: Property failed after 1 tests
{ seed: -2139882524, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/function/returnOrThrowError.ts:18:7
  * @since 1.0.0
  */
 export function returnOrThrowError<T>(value: T | undefined | null, error: string): T {
-  if (isNullish(value)) {
+  if (false) {
     throw new Error(error);
   }
killedBy: returnOrThrowError — contract null → throws Error
statusReason: expected [Function] to throw an error
