[Killed] BlockStatement
helpers/function/throttle.ts:17:25
 export function throttle<A extends unknown[], R>(
   func: (...args: A) => R,
   wait: number
-): (...args: A) => void {
-  let lastCallTime = 0;
-  let timeoutId: ReturnType<typeof setTimeout> | null = null;
-
-  return (...args: A) => {
-    const now = Date.now();
-
-    if (now - lastCallTime >= wait) {
-      lastCallTime = now;
-      func(...args);
-    } else if (!timeoutId) {
-      timeoutId = setTimeout(() => {
-        lastCallTime = Date.now();
-        timeoutId = null;
-        func(...args);
-      }, wait - (now - lastCallTime));
-    }
-  };
-}
+): (...args: A) => void {}
 
killedBy: throttle should throttle function calls
statusReason: throttledFunc is not a function

[Killed] BlockStatement
helpers/function/throttle.ts:21:26
   let lastCallTime = 0;
   let timeoutId: ReturnType<typeof setTimeout> | null = null;
 
-  return (...args: A) => {
-    const now = Date.now();
-
-    if (now - lastCallTime >= wait) {
-      lastCallTime = now;
-      func(...args);
-    } else if (!timeoutId) {
-      timeoutId = setTimeout(() => {
-        lastCallTime = Date.now();
-        timeoutId = null;
-        func(...args);
-      }, wait - (now - lastCallTime));
-    }
-  };
+  return (...args: A) => {};
 }
 
killedBy: throttle should throttle function calls
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/function/throttle.ts:24:9
   return (...args: A) => {
     const now = Date.now();
 
-    if (now - lastCallTime >= wait) {
+    if (true) {
       lastCallTime = now;
       func(...args);
killedBy: throttle should throttle function calls
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
helpers/function/throttle.ts:24:37
   return (...args: A) => {
     const now = Date.now();
 
-    if (now - lastCallTime >= wait) {
-      lastCallTime = now;
-      func(...args);
-    } else if (!timeoutId) {
+    if (now - lastCallTime >= wait) {} else if (!timeoutId) {
       timeoutId = setTimeout(() => {
         lastCallTime = Date.now();
killedBy: throttle should throttle function calls
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/function/throttle.ts:27:16
     if (now - lastCallTime >= wait) {
       lastCallTime = now;
       func(...args);
-    } else if (!timeoutId) {
+    } else if (false) {
       timeoutId = setTimeout(() => {
         lastCallTime = Date.now();
killedBy: throttle should throttle function calls
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
helpers/function/throttle.ts:27:16
     if (now - lastCallTime >= wait) {
       lastCallTime = now;
       func(...args);
-    } else if (!timeoutId) {
+    } else if (true) {
       timeoutId = setTimeout(() => {
         lastCallTime = Date.now();
killedBy: throttle should throttle function calls
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
helpers/function/throttle.ts:28:36
       lastCallTime = now;
       func(...args);
     } else if (!timeoutId) {
-      timeoutId = setTimeout(() => {
-        lastCallTime = Date.now();
-        timeoutId = null;
-        func(...args);
-      }, wait - (now - lastCallTime));
+      timeoutId = setTimeout(() => {}, wait - (now - lastCallTime));
     }
   };
killedBy: throttle should throttle function calls
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
helpers/function/throttle.ts:32:18
         lastCallTime = Date.now();
         timeoutId = null;
         func(...args);
-      }, wait - (now - lastCallTime));
+      }, wait - (now + lastCallTime));
     }
   };
killedBy: throttle — contract multiple calls within wait → only first and last (trailing) execute
statusReason: expected "vi.fn()" to be called 2 times, but got 3 times

[Killed] ArithmeticOperator
helpers/function/throttle.ts:32:10
         lastCallTime = Date.now();
         timeoutId = null;
         func(...args);
-      }, wait - (now - lastCallTime));
+      }, wait + (now - lastCallTime));
     }
   };
killedBy: throttle should schedule trailing call with correct remaining delay
statusReason: expected 1 to be 2 // Object.is equality
