[Killed] EqualityOperator
helpers/id/uuid7.ts:8:17
  */
 
 const HEX: string[] = [];
-for (let i = 0; i < 256; i++) {
+for (let i = 0; i >= 256; i++) {
   HEX.push(i.toString(16).padStart(2, '0'));
 }
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: 416123926, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/id/uuid7.ts:8:17
  */
 
 const HEX: string[] = [];
-for (let i = 0; i < 256; i++) {
+for (let i = 0; false; i++) {
   HEX.push(i.toString(16).padStart(2, '0'));
 }
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: -256239725, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/id/uuid7.ts:9:39
 
 const HEX: string[] = [];
 for (let i = 0; i < 256; i++) {
-  HEX.push(i.toString(16).padStart(2, '0'));
+  HEX.push(i.toString(16).padStart(2, ""));
 }
 
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: -1624001571, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:29:15
   const ms = Date.now();
 
   // 48-bit timestamp (big-endian)
-  bytes[0] = (ms / 0x10000000000) & 0xff;
+  bytes[0] = (ms * 0x10000000000) & 0xff;
   bytes[1] = (ms / 0x100000000) & 0xff;
   bytes[2] = (ms / 0x1000000) & 0xff;
killedBy: uuid7 — contract timestamp is encoded in the first 48 bits (first 12 hex chars)
statusReason: expected 679369036734 to be greater than or equal to 1778880664510

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:30:15
 
   // 48-bit timestamp (big-endian)
   bytes[0] = (ms / 0x10000000000) & 0xff;
-  bytes[1] = (ms / 0x100000000) & 0xff;
+  bytes[1] = (ms * 0x100000000) & 0xff;
   bytes[2] = (ms / 0x1000000) & 0xff;
   bytes[3] = (ms / 0x10000) & 0xff;
killedBy: uuid7 — contract timestamp is encoded in the first 48 bits (first 12 hex chars)
statusReason: expected 1100275831933 to be greater than or equal to 1778880664701

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:31:15
   // 48-bit timestamp (big-endian)
   bytes[0] = (ms / 0x10000000000) & 0xff;
   bytes[1] = (ms / 0x100000000) & 0xff;
-  bytes[2] = (ms / 0x1000000) & 0xff;
+  bytes[2] = (ms * 0x1000000) & 0xff;
   bytes[3] = (ms / 0x10000) & 0xff;
   bytes[4] = (ms / 0x100) & 0xff;
killedBy: uuid7 — contract timestamp is encoded in the first 48 bits (first 12 hex chars)
statusReason: expected 1778125690309 to be greater than or equal to 1778880665029

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:32:15
   bytes[0] = (ms / 0x10000000000) & 0xff;
   bytes[1] = (ms / 0x100000000) & 0xff;
   bytes[2] = (ms / 0x1000000) & 0xff;
-  bytes[3] = (ms / 0x10000) & 0xff;
+  bytes[3] = (ms * 0x10000) & 0xff;
   bytes[4] = (ms / 0x100) & 0xff;
   bytes[5] = ms & 0xff;
killedBy: uuid7 — contract timestamp is encoded in the first 48 bits (first 12 hex chars)
statusReason: expected 1778871490229 to be greater than or equal to 1778880665269

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:33:15
   bytes[1] = (ms / 0x100000000) & 0xff;
   bytes[2] = (ms / 0x1000000) & 0xff;
   bytes[3] = (ms / 0x10000) & 0xff;
-  bytes[4] = (ms / 0x100) & 0xff;
+  bytes[4] = (ms * 0x100) & 0xff;
   bytes[5] = ms & 0xff;
 
killedBy: uuid7 — contract timestamp is encoded in the first 48 bits (first 12 hex chars)
statusReason: expected 1778880610471 to be greater than or equal to 1778880665511

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:43:5
   bytes[8] = (bytes[8] & 0x3f) | 0x80;
 
   return (
-    HEX[bytes[0]] +
-    HEX[bytes[1]] +
-    HEX[bytes[2]] +
-    HEX[bytes[3]] +
-    '-' +
-    HEX[bytes[4]] +
-    HEX[bytes[5]] +
-    '-' +
-    HEX[bytes[6]] +
-    HEX[bytes[7]] +
-    '-' +
-    HEX[bytes[8]] +
-    HEX[bytes[9]] +
+    HEX[bytes[0]] + HEX[bytes[1]] + HEX[bytes[2]] + HEX[bytes[3]] + '-' + HEX[bytes[4]] + HEX[bytes[5]] + '-' + HEX[bytes[6]] + HEX[bytes[7]] + '-' + HEX[bytes[8]] - HEX[bytes[9]] +
     '-' +
     HEX[bytes[10]] +
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: -1142736070, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/id/uuid7.ts:43:5
   bytes[8] = (bytes[8] & 0x3f) | 0x80;
 
   return (
-    HEX[bytes[0]] +
-    HEX[bytes[1]] +
-    HEX[bytes[2]] +
-    HEX[bytes[3]] +
-    '-' +
-    HEX[bytes[4]] +
-    HEX[bytes[5]] +
-    '-' +
-    HEX[bytes[6]] +
-    HEX[bytes[7]] +
+    HEX[bytes[0]] + HEX[bytes[1]] + HEX[bytes[2]] + HEX[bytes[3]] + '-' + HEX[bytes[4]] + HEX[bytes[5]] + '-' + HEX[bytes[6]] - HEX[bytes[7]] +
     '-' +
     HEX[bytes[8]] +
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: -517321123, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/id/uuid7.ts:56:5
     '-' +
     HEX[bytes[8]] +
     HEX[bytes[9]] +
-    '-' +
+    "" +
     HEX[bytes[10]] +
     HEX[bytes[11]] +
killedBy: uuid7 — property-based always produces a string matching the UUID v7 format
statusReason: Property failed after 1 tests
{ seed: -1499174331, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
