[Killed] BlockStatement
helpers/markdown/escape.ts:44:70
  * // => 'foo \\| bar'
  * @since next
  */
-export function escape(str: string, options?: EscapeOptions): string {
-  let result = str.replace(/[\\`*_{}[\]()#+\-.!]/g, '\\$&');
-  if (options?.cell) {
-    result = result.replace(/\|/g, '\\|').replace(/\n/g, ' ');
-  }
-  return result;
-}
+export function escape(str: string, options?: EscapeOptions): string {}
 
killedBy: escape escapes asterisks
statusReason: expected undefined to be '\*\*bold\*\*' // Object.is equality

[Killed] ConditionalExpression
helpers/markdown/escape.ts:46:7
  */
 export function escape(str: string, options?: EscapeOptions): string {
   let result = str.replace(/[\\`*_{}[\]()#+\-.!]/g, '\\$&');
-  if (options?.cell) {
+  if (false) {
     result = result.replace(/\|/g, '\\|').replace(/\n/g, ' ');
   }
killedBy: escape cell: true escapes pipe characters
statusReason: expected 'foo | bar' to be 'foo \| bar' // Object.is equality

[Killed] BlockStatement
helpers/markdown/escape.ts:46:22
  */
 export function escape(str: string, options?: EscapeOptions): string {
   let result = str.replace(/[\\`*_{}[\]()#+\-.!]/g, '\\$&');
-  if (options?.cell) {
-    result = result.replace(/\|/g, '\\|').replace(/\n/g, ' ');
-  }
+  if (options?.cell) {}
   return result;
 }
killedBy: escape cell: true escapes pipe characters
statusReason: expected 'foo | bar' to be 'foo \| bar' // Object.is equality

[Killed] StringLiteral
helpers/markdown/escape.ts:47:58
 export function escape(str: string, options?: EscapeOptions): string {
   let result = str.replace(/[\\`*_{}[\]()#+\-.!]/g, '\\$&');
   if (options?.cell) {
-    result = result.replace(/\|/g, '\\|').replace(/\n/g, ' ');
+    result = result.replace(/\|/g, '\\|').replace(/\n/g, "");
   }
   return result;
killedBy: escape cell: true replaces newlines with spaces
statusReason: expected 'line1line2' to be 'line1 line2' // Object.is equality
