[Killed] BlockStatement
helpers/number/clamp.ts:15:72
  * @returns Clamped value
  * @since 1.9.0
  */
-export function clamp(value: number, min: number, max: number): number {
-  return Math.min(Math.max(value, min), max);
-}
+export function clamp(value: number, min: number, max: number): number {}
 
killedBy: clamp — property-based result is always >= min
statusReason: Property failed after 1 tests
{ seed: 861744191, path: "0:0:0:0", endOnFailure: true }
Counterexample: [0,0,0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/number/clamp.ts:16:19
  * @since 1.9.0
  */
 export function clamp(value: number, min: number, max: number): number {
-  return Math.min(Math.max(value, min), max);
+  return Math.min(Math.min(value, min), max);
 }
 
killedBy: clamp — property-based result is always >= min
statusReason: Property failed after 2 tests
{ seed: 936687687, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:0:2:0:0:0:1:0:0:1", endOnFailure: true }
Counterexample: [-1.401298464324817e-45,0,0]
Shrunk 36 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/number/clamp.ts:16:10
  * @since 1.9.0
  */
 export function clamp(value: number, min: number, max: number): number {
-  return Math.min(Math.max(value, min), max);
+  return Math.max(Math.max(value, min), max);
 }
 
killedBy: clamp — property-based result is always <= max
statusReason: Property failed after 4 tests
{ seed: 217935629, path: "3:0:1:0:0:2:1:1:1", endOnFailure: true }
Counterexample: [0,-1.401298464324817e-45,-1.401298464324817e-45]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
