[Killed] BlockStatement
helpers/number/formatSize.ts:27:51
  * formatSize(1_073_741_824)   // '1.0GB'
  * @since next
  */
-export function formatSize(bytes: number): string {
-  let size = bytes;
-  let unitIndex = 0;
-
-  while (size >= 1024 && unitIndex < UNITS.length - 1) {
-    size /= 1024;
-    unitIndex++;
-  }
-
-  return `${size.toFixed(1)}${UNITS[unitIndex]}`;
-}
+export function formatSize(bytes: number): string {}
 
killedBy: formatSize — property-based always returns a string ending with a known unit
statusReason: Property failed after 1 tests
{ seed: -473815924, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/number/formatSize.ts:31:10
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < UNITS.length - 1) {
+  while (size >= 1024 || unitIndex < UNITS.length - 1) {
     size /= 1024;
     unitIndex++;
killedBy: formatSize — property-based result for values < 1024 always ends with "B" (no prefix)
statusReason: Property failed after 1 tests
{ seed: -1222501799, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/number/formatSize.ts:31:26
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < UNITS.length - 1) {
+  while (size >= 1024 && unitIndex >= UNITS.length - 1) {
     size /= 1024;
     unitIndex++;
killedBy: formatSize — property-based result for values >= 1024 and < 1_048_576 ends with "KB"
statusReason: Property failed after 1 tests
{ seed: 1493892917, path: "0:0", endOnFailure: true }
Counterexample: [1024]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
helpers/number/formatSize.ts:32:5
   let unitIndex = 0;
 
   while (size >= 1024 && unitIndex < UNITS.length - 1) {
-    size /= 1024;
+    size *= 1024;
     unitIndex++;
   }
killedBy: formatSize — property-based always returns a string ending with a known unit
statusReason: Property failed after 3 tests
{ seed: -504870017, path: "2:1:0:0:0:0:0:0:0:0:1:0:0:0:2:1:3:0:1:0:2:0:0:3:2:0", endOnFailure: true }
Counterexample: [909494702]
Shrunk 25 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UpdateOperator
helpers/number/formatSize.ts:33:5
 
   while (size >= 1024 && unitIndex < UNITS.length - 1) {
     size /= 1024;
-    unitIndex++;
+    unitIndex--;
   }
 
killedBy: formatSize — property-based always returns a string ending with a known unit
statusReason: Property failed after 2 tests
{ seed: 469996813, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:0:1:0:1", endOnFailure: true }
Counterexample: [1024]
Shrunk 34 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/number/formatSize.ts:36:10
     unitIndex++;
   }
 
-  return `${size.toFixed(1)}${UNITS[unitIndex]}`;
+  return ``;
 }
 
killedBy: formatSize — property-based always returns a string ending with a known unit
statusReason: Property failed after 1 tests
{ seed: -1689478580, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
