[Killed] BlockStatement
helpers/number/inRange.ts:36:105
  * inRange(10, 1, 10, { inclusive: 'max' })  // => true
  * @since next
  */
-export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {
-  const { inclusive = 'both' } = options;
-  const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
-  const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
-  return minOk && maxOk;
-}
+export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {}
 
killedBy: inRange default (inclusive: both) returns true for value inside range
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/number/inRange.ts:38:78
  */
 export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {
   const { inclusive = 'both' } = options;
-  const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
+  const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : false;
   const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
   return minOk && maxOk;
killedBy: inRange inclusive: none returns true for value strictly inside range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/number/inRange.ts:38:63
  */
 export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {
   const { inclusive = 'both' } = options;
-  const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
+  const minOk = inclusive === 'both' || inclusive === 'min' ? value < min : value > min;
   const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
   return minOk && maxOk;
killedBy: inRange default (inclusive: both) returns true for value inside range
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/number/inRange.ts:39:41
 export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {
   const { inclusive = 'both' } = options;
   const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
-  const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
+  const maxOk = inclusive === 'both' || inclusive !== 'max' ? value <= max : value < max;
   return minOk && maxOk;
 }
killedBy: inRange inclusive: none returns false for value at max
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/number/inRange.ts:39:63
 export function inRange(value: number, min: number, max: number, options: InRangeOptions = {}): boolean {
   const { inclusive = 'both' } = options;
   const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
-  const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
+  const maxOk = inclusive === 'both' || inclusive === 'max' ? value > max : value < max;
   return minOk && maxOk;
 }
killedBy: inRange default (inclusive: both) returns true for value inside range
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/number/inRange.ts:40:10
   const { inclusive = 'both' } = options;
   const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
   const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
-  return minOk && maxOk;
+  return true;
 }
 
killedBy: inRange default (inclusive: both) returns false for value below min
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/number/inRange.ts:40:10
   const { inclusive = 'both' } = options;
   const minOk = inclusive === 'both' || inclusive === 'min' ? value >= min : value > min;
   const maxOk = inclusive === 'both' || inclusive === 'max' ? value <= max : value < max;
-  return minOk && maxOk;
+  return minOk || maxOk;
 }
 
killedBy: inRange default (inclusive: both) returns false for value below min
statusReason: expected true to be false // Object.is equality
