[Killed] BlockStatement
helpers/number/lerp.ts:25:69
  * lerp(0, 100, 0.25); // 25
  * @since next
  */
-export function lerp(start: number, end: number, t: number): number {
-  if (t === 0) return start;
-  if (t === 1) return end;
-  if (Object.is(start, end)) return start;
-  return start + (end - start) * t;
-}
+export function lerp(start: number, end: number, t: number): number {}
 
killedBy: lerp (property-based) lerp(a, b, 0) === a for any finite a, b
statusReason: Property failed after 1 tests
{ seed: 1863448835, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/number/lerp.ts:26:7
  * @since next
  */
 export function lerp(start: number, end: number, t: number): number {
-  if (t === 0) return start;
+  if (true) return start;
   if (t === 1) return end;
   if (Object.is(start, end)) return start;
killedBy: lerp (property-based) lerp is symmetric: lerp(a,b,t) ≈ lerp(b,a,1-t)
statusReason: Property failed after 1 tests
{ seed: 764833988, path: "0:3:1:6:0:1:1:0:0:0:1:0:0:1:0:1:0:1:1", endOnFailure: true }
Counterexample: [0.000050000002374872565,0,0]
Shrunk 18 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/number/lerp.ts:26:7
  * @since next
  */
 export function lerp(start: number, end: number, t: number): number {
-  if (t === 0) return start;
+  if (t !== 0) return start;
   if (t === 1) return end;
   if (Object.is(start, end)) return start;
killedBy: lerp (property-based) lerp(a, b, 0) === a for any finite a, b
statusReason: Property failed after 34 tests
{ seed: -1338188983, path: "33:31", endOnFailure: true }
Counterexample: [Number.POSITIVE_INFINITY,0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/number/lerp.ts:27:7
  */
 export function lerp(start: number, end: number, t: number): number {
   if (t === 0) return start;
-  if (t === 1) return end;
+  if (true) return end;
   if (Object.is(start, end)) return start;
   return start + (end - start) * t;
killedBy: lerp (property-based) lerp is symmetric: lerp(a,b,t) ≈ lerp(b,a,1-t)
statusReason: Property failed after 2 tests
{ seed: -19009658, path: "1:0:3:1:6:0:1:1:0:0:0:1:0:0:0:2:3:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [0,0.000050000002374872565,1.401298464324817e-45]
Shrunk 44 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/number/lerp.ts:27:7
  */
 export function lerp(start: number, end: number, t: number): number {
   if (t === 0) return start;
-  if (t === 1) return end;
+  if (t !== 1) return end;
   if (Object.is(start, end)) return start;
   return start + (end - start) * t;
killedBy: lerp (property-based) lerp is symmetric: lerp(a,b,t) ≈ lerp(b,a,1-t)
statusReason: Property failed after 1 tests
{ seed: -2110332633, path: "0:0:3:1:6:0:1:1:0:0:0:1:0:0:1:1:0:0:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [0,0.000050000002374872565,1.401298464324817e-45]
Shrunk 47 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/number/lerp.ts:28:7
 export function lerp(start: number, end: number, t: number): number {
   if (t === 0) return start;
   if (t === 1) return end;
-  if (Object.is(start, end)) return start;
+  if (false) return start;
   return start + (end - start) * t;
 }
killedBy: lerp (property-based) lerp(a, a, t) === a for any a and t (no movement)
statusReason: Property failed after 15 tests
{ seed: -134761165, path: "14:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [-0,1.401298464324817e-45]
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/number/lerp.ts:28:7
 export function lerp(start: number, end: number, t: number): number {
   if (t === 0) return start;
   if (t === 1) return end;
-  if (Object.is(start, end)) return start;
+  if (true) return start;
   return start + (end - start) * t;
 }
killedBy: lerp (property-based) lerp is symmetric: lerp(a,b,t) ≈ lerp(b,a,1-t)
statusReason: Property failed after 5 tests
{ seed: 224627048, path: "4:0:3:1:6:0:1:1:0:0:0:1:0:0:0:2:0:3:2:3:1:4:1:2:7:4:3:1", endOnFailure: true }
Counterexample: [0,0.000050000002374872565,5.551115784870273e-17]
Shrunk 27 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/lerp.ts:29:10
   if (t === 0) return start;
   if (t === 1) return end;
   if (Object.is(start, end)) return start;
-  return start + (end - start) * t;
+  return start - (end - start) * t;
 }
 
killedBy: lerp (property-based) lerp(a, b, t) is between a and b when t is in [0, 1]
statusReason: Property failed after 8 tests
{ seed: 1978297812, path: "7:0:2:0:0:1:1:0:1:0:2:2:1:3:1:0:2:0", endOnFailure: true }
Counterexample: [0,1.6618576736959767e-8,0.060173626989126205]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/lerp.ts:29:19
   if (t === 0) return start;
   if (t === 1) return end;
   if (Object.is(start, end)) return start;
-  return start + (end - start) * t;
+  return start + (end + start) * t;
 }
 
killedBy: lerp (property-based) lerp(a, b, t) is between a and b when t is in [0, 1]
statusReason: Property failed after 12 tests
{ seed: 1081291567, path: "11:1:2:4:3:1:0:1:0:1:0:0:0:1:1:0:1:1:0:18:4:2:1", endOnFailure: true }
Counterexample: [-0.000015556637663394213,0,0.00006428124470403418]
Shrunk 22 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
