[Killed] BlockStatement
helpers/number/mean.ts:21:56
  * mean([])            // => NaN
  * @since next
  */
-export function mean(array: readonly number[]): number {
-  if (array.length === 0) return NaN;
-  return array.reduce((acc, n) => acc + n, 0) / array.length;
-}
+export function mean(array: readonly number[]): number {}
 
killedBy: mean — property-based mean([x]) === x for any number
statusReason: Property failed after 1 tests
{ seed: -997129358, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/number/mean.ts:22:7
  * @since next
  */
 export function mean(array: readonly number[]): number {
-  if (array.length === 0) return NaN;
+  if (true) return NaN;
   return array.reduce((acc, n) => acc + n, 0) / array.length;
 }
killedBy: mean — property-based mean([x]) === x for any number
statusReason: Property failed after 1 tests
{ seed: -1408652556, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/number/mean.ts:22:7
  * @since next
  */
 export function mean(array: readonly number[]): number {
-  if (array.length === 0) return NaN;
+  if (array.length !== 0) return NaN;
   return array.reduce((acc, n) => acc + n, 0) / array.length;
 }
killedBy: mean — property-based mean([x]) === x for any number
statusReason: Property failed after 1 tests
{ seed: 1865473743, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/mean.ts:23:35
  */
 export function mean(array: readonly number[]): number {
   if (array.length === 0) return NaN;
-  return array.reduce((acc, n) => acc + n, 0) / array.length;
+  return array.reduce((acc, n) => acc - n, 0) / array.length;
 }
 
killedBy: mean — property-based mean([x]) === x for any number
statusReason: Property failed after 1 tests
{ seed: 579175568, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-1.401298464324817e-45]
Shrunk 29 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/number/mean.ts:23:23
  */
 export function mean(array: readonly number[]): number {
   if (array.length === 0) return NaN;
-  return array.reduce((acc, n) => acc + n, 0) / array.length;
+  return array.reduce(() => undefined, 0) / array.length;
 }
 
killedBy: mean — property-based mean([x]) === x for any number
statusReason: Property failed after 1 tests
{ seed: 1322294173, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
