[Killed] BlockStatement
helpers/number/random.ts:14:65
  * @returns Random number between min and max
  * @since 1.9.0
  */
-export function randomBetween(min: number, max: number): number {
-  return Math.random() * (max - min) + min;
-}
+export function randomBetween(min: number, max: number): number {}
 
 /**
killedBy: randomBetween — property-based result is always >= min and <= max
statusReason: Property failed after 1 tests
{ seed: -1228203253, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/random.ts:15:10
  * @since 1.9.0
  */
 export function randomBetween(min: number, max: number): number {
-  return Math.random() * (max - min) + min;
+  return Math.random() / (max - min) + min;
 }
 
killedBy: randomBetween — property-based result is always >= min and <= max
statusReason: Property failed after 2 tests
{ seed: 2035142132, path: "1:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/random.ts:15:27
  * @since 1.9.0
  */
 export function randomBetween(min: number, max: number): number {
-  return Math.random() * (max - min) + min;
+  return Math.random() * (max + min) + min;
 }
 
killedBy: randomBetween — property-based result is always >= min and <= max
statusReason: Property failed after 2 tests
{ seed: 550669262, path: "1:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: [-1.401298464324817e-45,0]
Shrunk 31 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/number/random.ts:25:68
  * @returns Random integer between min and max
  * @since 1.9.0
  */
-export function randomIntBetween(min: number, max: number): number {
-  return Math.floor(Math.random() * (max - min + 1)) + min;
-}
+export function randomIntBetween(min: number, max: number): number {}
 
killedBy: randomIntBetween — property-based result is always an integer
statusReason: Property failed after 1 tests
{ seed: -440539557, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/random.ts:26:10
  * @since 1.9.0
  */
 export function randomIntBetween(min: number, max: number): number {
-  return Math.floor(Math.random() * (max - min + 1)) + min;
+  return Math.floor(Math.random() * (max - min + 1)) - min;
 }
 
killedBy: randomIntBetween — property-based result is always within [min, max]
statusReason: Property failed after 3 tests
{ seed: 516276754, path: "2:0:1:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [0,-1]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/random.ts:26:38
  * @since 1.9.0
  */
 export function randomIntBetween(min: number, max: number): number {
-  return Math.floor(Math.random() * (max - min + 1)) + min;
+  return Math.floor(Math.random() * (max + min + 1)) + min;
 }
 
killedBy: randomIntBetween — property-based result is always within [min, max]
statusReason: Property failed after 2 tests
{ seed: -823421963, path: "1:2:1:1:1", endOnFailure: true }
Counterexample: [1,1]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
