[Killed] BlockStatement
helpers/number/roundTo.ts:14:66
  * @returns Rounded number
  * @since 1.9.0
  */
-export function roundTo(value: number, decimals: number): number {
-  const multiplier = Math.pow(10, decimals);
-  return Math.round(value * multiplier) / multiplier;
-}
+export function roundTo(value: number, decimals: number): number {}
 
killedBy: roundTo — property-based result has at most `decimals` decimal places
statusReason: Property failed after 1 tests
{ seed: -578166795, path: "0:0:0", endOnFailure: true }
Counterexample: [0,0]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/roundTo.ts:16:10
  */
 export function roundTo(value: number, decimals: number): number {
   const multiplier = Math.pow(10, decimals);
-  return Math.round(value * multiplier) / multiplier;
+  return Math.round(value * multiplier) * multiplier;
 }
 
killedBy: roundTo — property-based roundTo(integer, n) === integer for any n >= 0
statusReason: Property failed after 1 tests
{ seed: 1133581875, path: "0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:2:1:1", endOnFailure: true }
Counterexample: [-1,1]
Shrunk 17 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/number/roundTo.ts:16:21
  */
 export function roundTo(value: number, decimals: number): number {
   const multiplier = Math.pow(10, decimals);
-  return Math.round(value * multiplier) / multiplier;
+  return Math.round(value / multiplier) / multiplier;
 }
 
killedBy: roundTo — property-based roundTo(integer, n) === integer for any n >= 0
statusReason: Property failed after 1 tests
{ seed: -834756095, path: "0:1:0:0:2:1:1", endOnFailure: true }
Counterexample: [-1,1]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
