[Killed] BlockStatement
helpers/object/compact.ts:19:118
 export function compact<T extends Record<string, unknown>>(obj: T): Partial<T>;
 export function compact(obj: undefined): undefined;
 export function compact(obj: null): null;
-export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
-  const result: Partial<T> = {};
-  for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (obj[key]) {
-      result[key] = obj[key];
-    }
-  }
-  return result;
-}
+export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {}
 
killedBy: compact — property-based all values in result are truthy
statusReason: Property failed after 1 tests
{ seed: -796817498, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":undefined,"b":undefined,"c":0}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/compact.ts:20:7
 export function compact(obj: undefined): undefined;
 export function compact(obj: null): null;
 export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
killedBy: compact — contract undefined → undefined
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
helpers/object/compact.ts:20:7
 export function compact(obj: undefined): undefined;
 export function compact(obj: null): null;
 export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false || obj === null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
killedBy: compact — contract undefined → undefined
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
helpers/object/compact.ts:22:54
 export function compact<T extends Record<string, unknown>>(obj: T | undefined | null): Partial<T> | undefined | null {
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
-  for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (obj[key]) {
-      result[key] = obj[key];
-    }
-  }
+  for (const key of Object.keys(obj) as (keyof T)[]) {}
   return result;
 }
killedBy: compact — contract removes all falsy values
statusReason: expected {} to deeply equal { b: 1, f: 'hello' }

[Killed] ConditionalExpression
helpers/object/compact.ts:23:9
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (obj[key]) {
+    if (false) {
       result[key] = obj[key];
     }
killedBy: compact — contract removes all falsy values
statusReason: expected {} to deeply equal { b: 1, f: 'hello' }

[Killed] ConditionalExpression
helpers/object/compact.ts:23:9
   if (obj === undefined || obj === null) return obj;
   const result: Partial<T> = {};
   for (const key of Object.keys(obj) as (keyof T)[]) {
-    if (obj[key]) {
+    if (true) {
       result[key] = obj[key];
     }
killedBy: compact — property-based all values in result are truthy
statusReason: Property failed after 3 tests
{ seed: -439695651, path: "2:0", endOnFailure: true }
Counterexample: [{"a":0,"b":null,"c":null}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
