[Killed] StringLiteral
helpers/object/deepClone.ts:7:58
  * SPDX-License-Identifier: LGPL-3.0-or-later
  */
 
-const UNSAFE_KEYS = new Set(['__proto__', 'constructor', 'prototype']);
+const UNSAFE_KEYS = new Set(['__proto__', 'constructor', ""]);
 
 /**
killedBy: deepClone security edge cases should strip prototype key from cloned object
statusReason: expected { prototype: { exploit: true }, …(1) } to not have property "prototype"

[Survived] StringLiteral
helpers/object/deepClone.ts:7:30
  * SPDX-License-Identifier: LGPL-3.0-or-later
  */
 
-const UNSAFE_KEYS = new Set(['__proto__', 'constructor', 'prototype']);
+const UNSAFE_KEYS = new Set(["", 'constructor', 'prototype']);
 
 /**

[Killed] BlockStatement
helpers/object/deepClone.ts:15:41
  * @returns Deep cloned object
  * @since 1.9.0
  */
-export function deepClone<T>(obj: T): T {
-  if (obj === null || typeof obj !== "object") {
-    return obj;
-  }
-
-  if (obj instanceof Date) {
-    return new Date(obj.getTime()) as T;
-  }
-
-  if (Array.isArray(obj)) {
-    return obj.map(item => deepClone(item)) as T;
-  }
-
-  const cloned = {} as T;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = deepClone(obj[key]);
-    }
-  }
-
-  return cloned;
-}
+export function deepClone<T>(obj: T): T {}
 
killedBy: deepClone should clone primitive values
statusReason: expected undefined to be 42 // Object.is equality

[Killed] ConditionalExpression
helpers/object/deepClone.ts:16:7
  * @since 1.9.0
  */
 export function deepClone<T>(obj: T): T {
-  if (obj === null || typeof obj !== "object") {
+  if (true) {
     return obj;
   }
killedBy: deepClone should deep clone objects
statusReason: expected { a: 1, b: { c: 2 } } not to be { a: 1, b: { c: 2 } } // Object.is equality

[Killed] BlockStatement
helpers/object/deepClone.ts:16:48
  * @since 1.9.0
  */
 export function deepClone<T>(obj: T): T {
-  if (obj === null || typeof obj !== "object") {
-    return obj;
-  }
+  if (obj === null || typeof obj !== "object") {}
 
   if (obj instanceof Date) {
killedBy: deepClone should clone primitive values
statusReason: expected {} to be 42 // Object.is equality

[Killed] ConditionalExpression
helpers/object/deepClone.ts:20:7
     return obj;
   }
 
-  if (obj instanceof Date) {
+  if (false) {
     return new Date(obj.getTime()) as T;
   }
killedBy: deepClone should clone dates
statusReason: expected {} to deeply equal 2026-05-15T21:31:33.545Z

[Killed] BlockStatement
helpers/object/deepClone.ts:20:28
     return obj;
   }
 
-  if (obj instanceof Date) {
-    return new Date(obj.getTime()) as T;
-  }
+  if (obj instanceof Date) {}
 
   if (Array.isArray(obj)) {
killedBy: deepClone should clone dates
statusReason: expected {} to deeply equal 2026-05-15T21:31:33.785Z

[Killed] BlockStatement
helpers/object/deepClone.ts:24:27
     return new Date(obj.getTime()) as T;
   }
 
-  if (Array.isArray(obj)) {
-    return obj.map(item => deepClone(item)) as T;
-  }
+  if (Array.isArray(obj)) {}
 
   const cloned = {} as T;
killedBy: deepClone should deep clone arrays
statusReason: expected { '0': 1, …(2) } to deeply equal [ 1, [ 2, 3 ], { a: 4 } ]

[Killed] BlockStatement
helpers/object/deepClone.ts:29:26
   }
 
   const cloned = {} as T;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = deepClone(obj[key]);
-    }
-  }
+  for (const key in obj) {}
 
   return cloned;
killedBy: deepClone should deep clone objects
statusReason: expected {} to deeply equal { a: 1, b: { c: 2 } }

[Killed] LogicalOperator
helpers/object/deepClone.ts:30:9
 
   const cloned = {} as T;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
+    if (Object.prototype.hasOwnProperty.call(obj, key) || !UNSAFE_KEYS.has(key)) {
       cloned[key] = deepClone(obj[key]);
     }
killedBy: deepClone should handle objects with inherited properties
statusReason: expected 'value' to be undefined

[Killed] BlockStatement
helpers/object/deepClone.ts:30:82
 
   const cloned = {} as T;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {
-      cloned[key] = deepClone(obj[key]);
-    }
+    if (Object.prototype.hasOwnProperty.call(obj, key) && !UNSAFE_KEYS.has(key)) {}
   }
 
killedBy: deepClone should deep clone objects
statusReason: expected {} to deeply equal { a: 1, b: { c: 2 } }
