[Killed] LogicalOperator
helpers/object/diff.ts:74:17
   objB: object | undefined | null,
   options: DiffOptions = {},
 ): true | false | DiffResult {
-  const depth = options.depth ?? Infinity;
+  const depth = options.depth && Infinity;
 
   // Quick reference equality check
killedBy: diff depth option depth: 1 recurses one level only
statusReason: expected { nested: { b: { c: false } } } to deeply equal { nested: { b: false } }

[Killed] BlockStatement
helpers/object/diff.ts:77:22
   const depth = options.depth ?? Infinity;
 
   // Quick reference equality check
-  if (objA === objB) {
-    return true;
-  }
+  if (objA === objB) {}
 
   // Handle null/undefined cases
killedBy: diff should handle null and undefined
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/object/diff.ts:77:7
   const depth = options.depth ?? Infinity;
 
   // Quick reference equality check
-  if (objA === objB) {
+  if (objA !== objB) {
     return true;
   }
killedBy: diff should return differences for different values
statusReason: expected true to deeply equal { b: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:78:12
 
   // Quick reference equality check
   if (objA === objB) {
-    return true;
+    return false;
   }
 
killedBy: diff should return true for same reference
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:82:23
   }
 
   // Handle null/undefined cases
-  if (objA == null || objB == null) {
+  if (objA == null || false) {
     return false;
   }
killedBy: diff should return false when objA is valid object and objB is null
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
helpers/object/diff.ts:82:7
   }
 
   // Handle null/undefined cases
-  if (objA == null || objB == null) {
+  if (objA == null && objB == null) {
     return false;
   }
killedBy: diff should handle different object types
statusReason: Cannot convert undefined or null to object

[Killed] BooleanLiteral
helpers/object/diff.ts:83:12
 
   // Handle null/undefined cases
   if (objA == null || objB == null) {
-    return false;
+    return true;
   }
 
killedBy: diff should handle null and undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:87:7
   }
 
   // Handle Date objects
-  if (objA instanceof Date && objB instanceof Date) {
+  if (false) {
     return compareDate(objA, objB);
   }
killedBy: diff should handle special objects by reference only
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:87:7
   }
 
   // Handle Date objects
-  if (objA instanceof Date && objB instanceof Date) {
+  if (true) {
     return compareDate(objA, objB);
   }
killedBy: diff should return true for identical objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:92:7
   }
 
   // Handle Arrays at root level
-  if (Array.isArray(objA) && Array.isArray(objB)) {
+  if (false) {
     return arrayDeepEquals(objA, objB);
   }
killedBy: diff should handle arrays using equalsShallow
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:92:7
   }
 
   // Handle Arrays at root level
-  if (Array.isArray(objA) && Array.isArray(objB)) {
+  if (true) {
     return arrayDeepEquals(objA, objB);
   }
killedBy: diff should return true for identical objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:95:7
   if (Array.isArray(objA) && Array.isArray(objB)) {
     return arrayDeepEquals(objA, objB);
   }
-  if (Array.isArray(objA) || Array.isArray(objB)) {
+  if (false) {
     return false;
   }
killedBy: diff should handle different object types
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:95:7
   if (Array.isArray(objA) && Array.isArray(objB)) {
     return arrayDeepEquals(objA, objB);
   }
-  if (Array.isArray(objA) || Array.isArray(objB)) {
+  if (true) {
     return false;
   }
killedBy: diff should return true for identical objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/object/diff.ts:96:12
     return arrayDeepEquals(objA, objB);
   }
   if (Array.isArray(objA) || Array.isArray(objB)) {
-    return false;
+    return true;
   }
 
killedBy: diff should handle different object types
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/object/diff.ts:100:7
   }
 
   // Handle special objects - compare by reference only
-  if (isSpecialObject(objA) || isSpecialObject(objB)) {
+  if (isSpecialObject(objA) && isSpecialObject(objB)) {
     return objA === objB;
   }
killedBy: diff should not treat Date + non-Date as two Dates at root
statusReason: expected { a: 'onlyB' } to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:100:7
   }
 
   // Handle special objects - compare by reference only
-  if (isSpecialObject(objA) || isSpecialObject(objB)) {
+  if (true) {
     return objA === objB;
   }
killedBy: diff should return true for identical objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:101:12
 
   // Handle special objects - compare by reference only
   if (isSpecialObject(objA) || isSpecialObject(objB)) {
-    return objA === objB;
+    return true;
   }
 
killedBy: diff should handle special objects by reference only
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/object/diff.ts:101:12
 
   // Handle special objects - compare by reference only
   if (isSpecialObject(objA) || isSpecialObject(objB)) {
-    return objA === objB;
+    return objA !== objB;
   }
 
killedBy: diff should handle special objects by reference only
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:120:9
     const hasA = Object.prototype.hasOwnProperty.call(objA, key);
     const hasB = Object.prototype.hasOwnProperty.call(objB, key);
 
-    if (!hasA && hasB) {
+    if (true) {
       differences[key] = 'onlyB';
       continue;
killedBy: object/equalsDeep — property-based clones are deeply equal
statusReason: Property failed after 1 tests
{ seed: 605357965, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/diff.ts:120:9
     const hasA = Object.prototype.hasOwnProperty.call(objA, key);
     const hasB = Object.prototype.hasOwnProperty.call(objB, key);
 
-    if (!hasA && hasB) {
+    if (false) {
       differences[key] = 'onlyB';
       continue;
killedBy: diff should detect properties only in second object
statusReason: expected { c: false } to deeply equal { c: 'onlyB' }

[Killed] StringLiteral
helpers/object/diff.ts:121:26
     const hasB = Object.prototype.hasOwnProperty.call(objB, key);
 
     if (!hasA && hasB) {
-      differences[key] = 'onlyB';
+      differences[key] = "";
       continue;
     }
killedBy: diff should detect properties only in second object
statusReason: expected { c: '' } to deeply equal { c: 'onlyB' }

[Killed] ConditionalExpression
helpers/object/diff.ts:124:9
       differences[key] = 'onlyB';
       continue;
     }
-    if (hasA && !hasB) {
+    if (true) {
       differences[key] = 'onlyA';
       continue;
killedBy: diff should return true for identical objects
statusReason: expected { a: 'onlyA', b: 'onlyA' } to be true // Object.is equality

[Killed] BooleanLiteral
helpers/object/diff.ts:124:17
       differences[key] = 'onlyB';
       continue;
     }
-    if (hasA && !hasB) {
+    if (hasA && hasB) {
       differences[key] = 'onlyA';
       continue;
killedBy: diff should return true for identical objects
statusReason: expected { a: 'onlyA', b: 'onlyA' } to be true // Object.is equality

[Killed] BlockStatement
helpers/object/diff.ts:132:28
     const valueA = (objA as Record<string, unknown>)[key];
     const valueB = (objB as Record<string, unknown>)[key];
 
-    if (valueA === valueB) {
-      continue;
-    }
+    if (valueA === valueB) {}
 
     if (Array.isArray(valueA) && Array.isArray(valueB)) {
killedBy: diff should return true for identical objects
statusReason: expected { a: false, b: false } to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:132:9
     const valueA = (objA as Record<string, unknown>)[key];
     const valueB = (objB as Record<string, unknown>)[key];
 
-    if (valueA === valueB) {
+    if (false) {
       continue;
     }
killedBy: object/equalsDeep — property-based clones are deeply equal
statusReason: Property failed after 1 tests
{ seed: 1538907517, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/object/diff.ts:136:57
       continue;
     }
 
-    if (Array.isArray(valueA) && Array.isArray(valueB)) {
-      if (!arrayDeepEquals(valueA, valueB)) {
-        differences[key] = false;
-      }
-      continue;
-    }
+    if (Array.isArray(valueA) && Array.isArray(valueB)) {}
     if (Array.isArray(valueA) || Array.isArray(valueB)) {
       differences[key] = false;
killedBy: diff should return true for identical arrays
statusReason: expected { arr: false } to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/diff.ts:136:9
       continue;
     }
 
-    if (Array.isArray(valueA) && Array.isArray(valueB)) {
+    if (false) {
       if (!arrayDeepEquals(valueA, valueB)) {
         differences[key] = false;
killedBy: diff should return true for identical arrays
statusReason: expected { arr: false } to be true // Object.is equality

[Killed] BlockStatement
helpers/object/diff.ts:137:45
     }
 
     if (Array.isArray(valueA) && Array.isArray(valueB)) {
-      if (!arrayDeepEquals(valueA, valueB)) {
-        differences[key] = false;
-      }
+      if (!arrayDeepEquals(valueA, valueB)) {}
       continue;
     }
killedBy: diff should handle arrays by returning false for differences
statusReason: expected true to deeply equal { arr: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:137:11
     }
 
     if (Array.isArray(valueA) && Array.isArray(valueB)) {
-      if (!arrayDeepEquals(valueA, valueB)) {
+      if (false) {
         differences[key] = false;
       }
killedBy: diff should handle arrays by returning false for differences
statusReason: expected true to deeply equal { arr: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:138:28
 
     if (Array.isArray(valueA) && Array.isArray(valueB)) {
       if (!arrayDeepEquals(valueA, valueB)) {
-        differences[key] = false;
+        differences[key] = true;
       }
       continue;
killedBy: diff should handle arrays by returning false for differences
statusReason: expected { arr: true } to deeply equal { arr: false }

[Killed] LogicalOperator
helpers/object/diff.ts:142:9
       }
       continue;
     }
-    if (Array.isArray(valueA) || Array.isArray(valueB)) {
+    if (Array.isArray(valueA) && Array.isArray(valueB)) {
       differences[key] = false;
       continue;
killedBy: diff should handle nested objects returning false (incompatible types)
statusReason: expected { nested: { a: 'onlyA' } } to deeply equal { nested: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:142:9
       }
       continue;
     }
-    if (Array.isArray(valueA) || Array.isArray(valueB)) {
+    if (false) {
       differences[key] = false;
       continue;
killedBy: diff should handle nested objects returning false (incompatible types)
statusReason: expected { nested: { a: 'onlyA' } } to deeply equal { nested: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:143:26
       continue;
     }
     if (Array.isArray(valueA) || Array.isArray(valueB)) {
-      differences[key] = false;
+      differences[key] = true;
       continue;
     }
killedBy: diff should handle property where one value is array and other is not
statusReason: expected { x: true } to deeply equal { x: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:147:9
       continue;
     }
 
-    if (valueA instanceof Date && valueB instanceof Date) {
+    if (true) {
       if (!compareDate(valueA, valueB)) {
         differences[key] = false;
killedBy: diff should handle nested objects recursively
statusReason: expected { nested: false } to deeply equal { nested: { y: false } }

[Killed] ConditionalExpression
helpers/object/diff.ts:147:9
       continue;
     }
 
-    if (valueA instanceof Date && valueB instanceof Date) {
+    if (false) {
       if (!compareDate(valueA, valueB)) {
         differences[key] = false;
killedBy: diff should handle dates in object properties correctly
statusReason: expected { created: false } to be true // Object.is equality

[Killed] BlockStatement
helpers/object/diff.ts:148:41
     }
 
     if (valueA instanceof Date && valueB instanceof Date) {
-      if (!compareDate(valueA, valueB)) {
-        differences[key] = false;
-      }
+      if (!compareDate(valueA, valueB)) {}
       continue;
     }
killedBy: diff should handle dates in object properties correctly
statusReason: expected true to deeply equal { created: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:148:11
     }
 
     if (valueA instanceof Date && valueB instanceof Date) {
-      if (!compareDate(valueA, valueB)) {
+      if (false) {
         differences[key] = false;
       }
killedBy: diff should handle dates in object properties correctly
statusReason: expected true to deeply equal { created: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:149:28
 
     if (valueA instanceof Date && valueB instanceof Date) {
       if (!compareDate(valueA, valueB)) {
-        differences[key] = false;
+        differences[key] = true;
       }
       continue;
killedBy: diff should handle dates in object properties correctly
statusReason: expected { created: true } to deeply equal { created: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:153:9
       }
       continue;
     }
-    if (valueA instanceof Date || valueB instanceof Date) {
+    if (true) {
       differences[key] = false;
       continue;
killedBy: diff should handle nested objects recursively
statusReason: expected { nested: false } to deeply equal { nested: { y: false } }

[Survived] LogicalOperator
helpers/object/diff.ts:153:9
       }
       continue;
     }
-    if (valueA instanceof Date || valueB instanceof Date) {
+    if (valueA instanceof Date && valueB instanceof Date) {
       differences[key] = false;
       continue;

[Killed] BooleanLiteral
helpers/object/diff.ts:154:26
       continue;
     }
     if (valueA instanceof Date || valueB instanceof Date) {
-      differences[key] = false;
+      differences[key] = true;
       continue;
     }
killedBy: diff should handle property where one value is Date and other is not
statusReason: expected { d: true } to deeply equal { d: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:158:9
       continue;
     }
 
-    if (isSpecialObject(valueA) || isSpecialObject(valueB)) {
+    if (false) {
       // valueA === valueB already handled above, so any special-object pair
       // that reaches here must differ.
killedBy: diff should handle special objects in properties
statusReason: expected { fn: false } to deeply equal { fn: false, regex: false }

[Killed] BlockStatement
helpers/object/diff.ts:158:61
       continue;
     }
 
-    if (isSpecialObject(valueA) || isSpecialObject(valueB)) {
-      // valueA === valueB already handled above, so any special-object pair
-      // that reaches here must differ.
-      differences[key] = false;
-      continue;
-    }
+    if (isSpecialObject(valueA) || isSpecialObject(valueB)) {}
 
     const bothPlainObjects =
killedBy: diff should handle special objects in properties
statusReason: expected { fn: false } to deeply equal { fn: false, regex: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:161:26
     if (isSpecialObject(valueA) || isSpecialObject(valueB)) {
       // valueA === valueB already handled above, so any special-object pair
       // that reaches here must differ.
-      differences[key] = false;
+      differences[key] = true;
       continue;
     }
killedBy: diff should handle special objects in properties
statusReason: expected { fn: true, regex: true } to deeply equal { fn: false, regex: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:166:7
     }
 
     const bothPlainObjects =
-      valueA !== null && valueB !== null &&
-      typeof valueA === 'object' && typeof valueB === 'object';
+      true && typeof valueB === 'object';
 
     if (!bothPlainObjects) {
killedBy: diff should handle mixed types in properties
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
helpers/object/diff.ts:166:7
     }
 
     const bothPlainObjects =
-      valueA !== null && valueB !== null &&
-      typeof valueA === 'object' && typeof valueB === 'object';
+      true;
 
     if (!bothPlainObjects) {
killedBy: diff should return differences for different values
statusReason: expected true to deeply equal { b: false }

[Killed] ConditionalExpression
helpers/object/diff.ts:167:7
 
     const bothPlainObjects =
       valueA !== null && valueB !== null &&
-      typeof valueA === 'object' && typeof valueB === 'object';
+      true && typeof valueB === 'object';
 
     if (!bothPlainObjects) {
killedBy: diff should handle property with undefined vs object (kills L94 mutations)
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
helpers/object/diff.ts:167:37
 
     const bothPlainObjects =
       valueA !== null && valueB !== null &&
-      typeof valueA === 'object' && typeof valueB === 'object';
+      typeof valueA === 'object' && typeof valueB !== 'object';
 
     if (!bothPlainObjects) {
killedBy: diff should handle nested objects recursively
statusReason: expected { nested: false } to deeply equal { nested: { y: false } }

[Killed] ConditionalExpression
helpers/object/diff.ts:169:9
       valueA !== null && valueB !== null &&
       typeof valueA === 'object' && typeof valueB === 'object';
 
-    if (!bothPlainObjects) {
+    if (true) {
       differences[key] = false;
       continue;
killedBy: diff should handle nested objects recursively
statusReason: expected { nested: false } to deeply equal { nested: { y: false } }

[Killed] BlockStatement
helpers/object/diff.ts:169:28
       valueA !== null && valueB !== null &&
       typeof valueA === 'object' && typeof valueB === 'object';
 
-    if (!bothPlainObjects) {
-      differences[key] = false;
-      continue;
-    }
+    if (!bothPlainObjects) {}
 
     if (depth <= 0) {
killedBy: diff should return differences for different values
statusReason: expected true to deeply equal { b: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:170:26
       typeof valueA === 'object' && typeof valueB === 'object';
 
     if (!bothPlainObjects) {
-      differences[key] = false;
+      differences[key] = true;
       continue;
     }
killedBy: diff should return differences for different values
statusReason: expected { b: true } to deeply equal { b: false }

[Killed] EqualityOperator
helpers/object/diff.ts:174:9
       continue;
     }
 
-    if (depth <= 0) {
+    if (depth > 0) {
       // depth budget exhausted \u2192 strict-equal nested objects only match by reference
       differences[key] = false;
killedBy: diff should handle nested objects recursively
statusReason: expected { nested: false } to deeply equal { nested: { y: false } }

[Killed] BlockStatement
helpers/object/diff.ts:174:21
       continue;
     }
 
-    if (depth <= 0) {
-      // depth budget exhausted \u2192 strict-equal nested objects only match by reference
-      differences[key] = false;
-      continue;
-    }
+    if (depth <= 0) {}
 
     const nested = diffPlainObjects(valueA as object, valueB as object, depth - 1);
killedBy: diff depth option depth: 0 — nested plain objects with same shape return false (no recursion)
statusReason: expected true to deeply equal { nested: false }

[Killed] BooleanLiteral
helpers/object/diff.ts:176:26
 
     if (depth <= 0) {
       // depth budget exhausted \u2192 strict-equal nested objects only match by reference
-      differences[key] = false;
+      differences[key] = true;
       continue;
     }
killedBy: diff depth option depth: 0 — nested plain objects with same shape return false (no recursion)
statusReason: expected { nested: true } to deeply equal { nested: false }

[Killed] ArithmeticOperator
helpers/object/diff.ts:180:73
       continue;
     }
 
-    const nested = diffPlainObjects(valueA as object, valueB as object, depth - 1);
+    const nested = diffPlainObjects(valueA as object, valueB as object, depth + 1);
     if (nested !== true) {
       differences[key] = nested;
killedBy: diff depth option depth: 1 recurses one level only
statusReason: expected { nested: { b: { c: false } } } to deeply equal { nested: { b: false } }

[Killed] EqualityOperator
helpers/object/diff.ts:181:9
     }
 
     const nested = diffPlainObjects(valueA as object, valueB as object, depth - 1);
-    if (nested !== true) {
+    if (nested === true) {
       differences[key] = nested;
     }
killedBy: diff should handle nested objects recursively
statusReason: expected true to deeply equal { nested: { y: false } }

[Killed] ConditionalExpression
helpers/object/diff.ts:181:9
     }
 
     const nested = diffPlainObjects(valueA as object, valueB as object, depth - 1);
-    if (nested !== true) {
+    if (false) {
       differences[key] = nested;
     }
killedBy: diff should handle nested objects recursively
statusReason: expected true to deeply equal { nested: { y: false } }

[Killed] EqualityOperator
helpers/object/diff.ts:186:10
     }
   }
 
-  return Object.keys(differences).length > 0 ? differences : true;
+  return Object.keys(differences).length <= 0 ? differences : true;
 }
 
killedBy: diff should return true for identical objects
statusReason: expected {} to be true // Object.is equality

[Killed] EqualityOperator
helpers/object/diff.ts:186:10
     }
   }
 
-  return Object.keys(differences).length > 0 ? differences : true;
+  return Object.keys(differences).length >= 0 ? differences : true;
 }
 
killedBy: diff should return true for identical objects
statusReason: expected {} to be true // Object.is equality
