[Killed] BlockStatement
helpers/object/equalsDeep.ts:27:12
 export function equalsDeep(
   objA: object | undefined | null,
   objB: object | undefined | null,
-): boolean {
-  return diff(objA, objB) === true;
-}
+): boolean {}
 
killedBy: object/equalsDeep — property-based reflexive: equalsDeep(obj, obj) === true
statusReason: Property failed after 1 tests
{ seed: 1101709555, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/equalsDeep.ts:28:10
   objA: object | undefined | null,
   objB: object | undefined | null,
 ): boolean {
-  return diff(objA, objB) === true;
+  return false;
 }
 
killedBy: object/equalsDeep — property-based reflexive: equalsDeep(obj, obj) === true
statusReason: Property failed after 1 tests
{ seed: -844235558, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/object/equalsDeep.ts:28:10
   objA: object | undefined | null,
   objB: object | undefined | null,
 ): boolean {
-  return diff(objA, objB) === true;
+  return diff(objA, objB) !== true;
 }
 
killedBy: object/equalsDeep — property-based reflexive: equalsDeep(obj, obj) === true
statusReason: Property failed after 1 tests
{ seed: -654689234, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
