[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:28:7
  * @since 2.0.0
  */
 export function equalsShallow(objA: unknown, objB: unknown): boolean {
-  if (objA === objB) {
+  if (true) {
     return true;
   }
killedBy: object/equalsShallow returns false for differing primitive values
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:28:7
  * @since 2.0.0
  */
 export function equalsShallow(objA: unknown, objB: unknown): boolean {
-  if (objA === objB) {
+  if (false) {
     return true;
   }
killedBy: object/equalsShallow falls back to === for primitives
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/object/equalsShallow.ts:32:5
     return true;
   }
   if (
-    objA === null || objB === null ||
-    typeof objA !== 'object' || typeof objB !== 'object'
+    (objA === null || objB === null || typeof objA !== 'object') && typeof objB !== 'object'
   ) {
     return false;
killedBy: object/equalsShallow handles null and undefined via ===
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:32:5
     return true;
   }
   if (
-    objA === null || objB === null ||
-    typeof objA !== 'object' || typeof objB !== 'object'
+    true
   ) {
     return false;
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/object/equalsShallow.ts:33:5
   }
   if (
     objA === null || objB === null ||
-    typeof objA !== 'object' || typeof objB !== 'object'
+    typeof objA === 'object' || typeof objB !== 'object'
   ) {
     return false;
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/object/equalsShallow.ts:33:33
   }
   if (
     objA === null || objB === null ||
-    typeof objA !== 'object' || typeof objB !== 'object'
+    typeof objA !== 'object' || typeof objB === 'object'
   ) {
     return false;
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/object/equalsShallow.ts:34:5
   if (
     objA === null || objB === null ||
     typeof objA !== 'object' || typeof objB !== 'object'
-  ) {
-    return false;
-  }
+  ) {}
   const a = objA as Record<string, unknown>;
   const b = objB as Record<string, unknown>;
killedBy: object/equalsShallow falls back to === for primitives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:39:7
   }
   const a = objA as Record<string, unknown>;
   const b = objB as Record<string, unknown>;
-  if (Array.isArray(objA) || Array.isArray(objB)) {
+  if (true) {
     return false;
   }
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:39:7
   }
   const a = objA as Record<string, unknown>;
   const b = objB as Record<string, unknown>;
-  if (Array.isArray(objA) || Array.isArray(objB)) {
+  if (false) {
     return false;
   }
killedBy: object/equalsShallow arrays always return false (use array/equalsShallow for array comparison)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/object/equalsShallow.ts:43:47
     return false;
   }
   const keysA = Object.keys(a);
-  if (keysA.length !== Object.keys(b).length) {
-    return false;
-  }
+  if (keysA.length !== Object.keys(b).length) {}
   for (const key of keysA) {
     if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] !== b[key]) {
killedBy: object/equalsShallow returns false when keys differ
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:43:7
     return false;
   }
   const keysA = Object.keys(a);
-  if (keysA.length !== Object.keys(b).length) {
+  if (false) {
     return false;
   }
killedBy: object/equalsShallow returns false when keys differ
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/object/equalsShallow.ts:44:12
   }
   const keysA = Object.keys(a);
   if (keysA.length !== Object.keys(b).length) {
-    return false;
+    return true;
   }
   for (const key of keysA) {
killedBy: object/equalsShallow returns false when keys differ
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/object/equalsShallow.ts:46:28
   if (keysA.length !== Object.keys(b).length) {
     return false;
   }
-  for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] !== b[key]) {
-      return false;
-    }
-  }
+  for (const key of keysA) {}
   return true;
 }
killedBy: object/equalsShallow returns false for differing primitive values
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/object/equalsShallow.ts:47:9
     return false;
   }
   for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] !== b[key]) {
+    if (true) {
       return false;
     }
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/object/equalsShallow.ts:47:58
     return false;
   }
   for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] !== b[key]) {
+    if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] === b[key]) {
       return false;
     }
killedBy: object/equalsShallow returns true for objects with identical keys and primitive values
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/object/equalsShallow.ts:48:14
   }
   for (const key of keysA) {
     if (!Object.prototype.hasOwnProperty.call(b, key) || a[key] !== b[key]) {
-      return false;
+      return true;
     }
   }
killedBy: object/equalsShallow returns false for differing primitive values
statusReason: expected true to be false // Object.is equality
