[Killed] BlockStatement
helpers/object/get.ts:15:95
  * @returns The value at the path or default value
  * @since 1.9.0
  */
-export function get<T = unknown>(obj: unknown, path: string, defaultValue?: T): T | undefined {
-  const keys = path.split('.');
-  let result: unknown = obj;
-
-  for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return defaultValue;
-    }
-    result = (result as Record<string, unknown>)[key];
-  }
-
-  return result !== undefined ? result as T | undefined : defaultValue;
-}
+export function get<T = unknown>(obj: unknown, path: string, defaultValue?: T): T | undefined {}
 
killedBy: set — property-based get(set(obj, path, value), path) === value for single-level paths
statusReason: Property failed after 1 tests
{ seed: -221135283, path: "0:0:0:0", endOnFailure: true }
Counterexample: [" ",0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/object/get.ts:19:27
   const keys = path.split('.');
   let result: unknown = obj;
 
-  for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return defaultValue;
-    }
-    result = (result as Record<string, unknown>)[key];
-  }
+  for (const key of keys) {}
 
   return result !== undefined ? result as T | undefined : defaultValue;
killedBy: set — property-based get(set(obj, path, value), path) === value for single-level paths
statusReason: Property failed after 1 tests
{ seed: -444989996, path: "0:0:0:0", endOnFailure: true }
Counterexample: [" ",0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/object/get.ts:20:55
   let result: unknown = obj;
 
   for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
-      return defaultValue;
-    }
+    if (result == null || typeof result !== 'object') {}
     result = (result as Record<string, unknown>)[key];
   }
killedBy: get — contract missing path → defaultValue
statusReason: Cannot read properties of undefined (reading 'c')

[Killed] EqualityOperator
helpers/object/get.ts:20:9
   let result: unknown = obj;
 
   for (const key of keys) {
-    if (result == null || typeof result !== 'object') {
+    if (result != null || typeof result !== 'object') {
       return defaultValue;
     }
killedBy: set — property-based get(set(obj, path, value), path) === value for single-level paths
statusReason: Property failed after 1 tests
{ seed: -785087147, path: "0:0:0:0", endOnFailure: true }
Counterexample: [" ",0]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/get.ts:26:10
     result = (result as Record<string, unknown>)[key];
   }
 
-  return result !== undefined ? result as T | undefined : defaultValue;
+  return true ? result as T | undefined : defaultValue;
 }
 
killedBy: get should return default value for non-existent path
statusReason: expected undefined to be 'default' // Object.is equality

[Killed] ConditionalExpression
helpers/object/get.ts:26:10
     result = (result as Record<string, unknown>)[key];
   }
 
-  return result !== undefined ? result as T | undefined : defaultValue;
+  return false ? result as T | undefined : defaultValue;
 }
 
killedBy: get — property-based get(obj, key) === obj[key] for single-key paths
statusReason: Property failed after 1 tests
{ seed: 524399256, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""},"a"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
