[Killed] BlockStatement
helpers/object/groupBy.ts:24:28
 export function groupBy<T, K extends PropertyKey>(
   items: readonly T[],
   keyFn: (item: T) => K
-): Partial<Record<K, T[]>> {
-  const result = {} as Partial<Record<K, T[]>>;
-  for (const item of items) {
-    const key = keyFn(item);
-    if (result[key] === undefined) {
-      result[key] = [];
-    }
-    (result[key] as T[]).push(item);
-  }
-  return result;
-}
+): Partial<Record<K, T[]>> {}
 
killedBy: groupBy groups numbers by parity
statusReason: expected undefined to deeply equal { odd: [ 1, 3 ], even: [ 2, 4 ] }

[Killed] BlockStatement
helpers/object/groupBy.ts:26:29
   keyFn: (item: T) => K
 ): Partial<Record<K, T[]>> {
   const result = {} as Partial<Record<K, T[]>>;
-  for (const item of items) {
-    const key = keyFn(item);
-    if (result[key] === undefined) {
-      result[key] = [];
-    }
-    (result[key] as T[]).push(item);
-  }
+  for (const item of items) {}
   return result;
 }
killedBy: groupBy groups numbers by parity
statusReason: expected {} to deeply equal { odd: [ 1, 3 ], even: [ 2, 4 ] }

[Killed] ConditionalExpression
helpers/object/groupBy.ts:28:9
   const result = {} as Partial<Record<K, T[]>>;
   for (const item of items) {
     const key = keyFn(item);
-    if (result[key] === undefined) {
+    if (true) {
       result[key] = [];
     }
killedBy: groupBy groups numbers by parity
statusReason: expected { odd: [ 3 ], even: [ 4 ] } to deeply equal { odd: [ 1, 3 ], even: [ 2, 4 ] }

[Killed] BlockStatement
helpers/object/groupBy.ts:28:36
   const result = {} as Partial<Record<K, T[]>>;
   for (const item of items) {
     const key = keyFn(item);
-    if (result[key] === undefined) {
-      result[key] = [];
-    }
+    if (result[key] === undefined) {}
     (result[key] as T[]).push(item);
   }
killedBy: groupBy groups numbers by parity
statusReason: Cannot read properties of undefined (reading 'push')
