[Killed] BlockStatement
helpers/object/invert.ts:21:98
  * // => { 1: 'one', 2: 'two' }
  * @since next
  */
-export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V>): Record<V, K> {
-  const result = {} as Record<V, K>;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[obj[key as K]] = key as unknown as K;
-    }
-  }
-  return result;
-}
+export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V>): Record<V, K> {}
 
killedBy: invert swaps keys and values
statusReason: expected undefined to deeply equal { x: 'a', y: 'b', z: 'c' }

[Killed] BlockStatement
helpers/object/invert.ts:23:26
  */
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V>): Record<V, K> {
   const result = {} as Record<V, K>;
-  for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[obj[key as K]] = key as unknown as K;
-    }
-  }
+  for (const key in obj) {}
   return result;
 }
killedBy: invert swaps keys and values
statusReason: expected {} to deeply equal { x: 'a', y: 'b', z: 'c' }

[Killed] ConditionalExpression
helpers/object/invert.ts:24:9
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V>): Record<V, K> {
   const result = {} as Record<V, K>;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
+    if (false) {
       result[obj[key as K]] = key as unknown as K;
     }
killedBy: invert swaps keys and values
statusReason: expected {} to deeply equal { x: 'a', y: 'b', z: 'c' }

[Killed] BlockStatement
helpers/object/invert.ts:24:57
 export function invert<K extends string, V extends PropertyKey>(obj: Record<K, V>): Record<V, K> {
   const result = {} as Record<V, K>;
   for (const key in obj) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[obj[key as K]] = key as unknown as K;
-    }
+    if (Object.prototype.hasOwnProperty.call(obj, key)) {}
   }
   return result;
killedBy: invert swaps keys and values
statusReason: expected {} to deeply equal { x: 'a', y: 'b', z: 'c' }
