[Killed] BlockStatement
helpers/object/map.ts:42:23
   obj: TObj,
   mapValue?: (value: TObj[keyof TObj], key: keyof TObj) => TVal,
   mapKey?: (key: keyof TObj, value: TObj[keyof TObj]) => TKey
-): Record<TKey, TVal> {
-  const result = {} as Record<TKey, TVal>;
-  for (const key of Object.keys(obj) as (keyof TObj)[]) {
-    const value = obj[key];
-    const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
-    result[newKey] = newVal;
-  }
-  return result;
-}
+): Record<TKey, TVal> {}
 
killedBy: map transforms values with mapValue
statusReason: expected undefined to deeply equal { a: 10, b: 20 }

[Killed] BlockStatement
helpers/object/map.ts:44:57
   mapKey?: (key: keyof TObj, value: TObj[keyof TObj]) => TKey
 ): Record<TKey, TVal> {
   const result = {} as Record<TKey, TVal>;
-  for (const key of Object.keys(obj) as (keyof TObj)[]) {
-    const value = obj[key];
-    const newKey = mapKey ? mapKey(key, value) : (key as unknown as TKey);
-    const newVal = mapValue ? mapValue(value, key) : (value as unknown as TVal);
-    result[newKey] = newVal;
-  }
+  for (const key of Object.keys(obj) as (keyof TObj)[]) {}
   return result;
 }
killedBy: map transforms values with mapValue
statusReason: expected {} to deeply equal { a: 10, b: 20 }
