[Killed] BlockStatement
helpers/object/omit.ts:23:34
 export function omit<T extends Record<string, unknown>, K extends keyof T>(
   obj: T | undefined | null,
   keys: readonly K[]
-): Omit<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
-  const result = { ...obj };
-  for (const key of keys) {
-    delete result[key];
-  }
-  return result as Omit<T, K>;
-}
+): Omit<T, K> | undefined | null {}
 
killedBy: omit — property-based result has none of the omitted keys
statusReason: Property failed after 2 tests
{ seed: 310019956, path: "1:0:0:0:1:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false},["c"]]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/omit.ts:24:7
   obj: T | undefined | null,
   keys: readonly K[]
 ): Omit<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false) return obj;
   const result = { ...obj };
   for (const key of keys) {
killedBy: omit — contract undefined → undefined
statusReason: expected {} to be undefined

[Killed] ConditionalExpression
helpers/object/omit.ts:24:7
   obj: T | undefined | null,
   keys: readonly K[]
 ): Omit<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false || obj === null) return obj;
   const result = { ...obj };
   for (const key of keys) {
killedBy: omit — contract undefined → undefined
statusReason: expected {} to be undefined

[Killed] BlockStatement
helpers/object/omit.ts:26:27
 ): Omit<T, K> | undefined | null {
   if (obj === undefined || obj === null) return obj;
   const result = { ...obj };
-  for (const key of keys) {
-    delete result[key];
-  }
+  for (const key of keys) {}
   return result as Omit<T, K>;
 }
killedBy: omit — property-based result has none of the omitted keys
statusReason: Property failed after 1 tests
{ seed: -1702246447, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false},["b"]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
