[Killed] BlockStatement
helpers/object/pick.ts:23:34
 export function pick<T extends Record<string, unknown>, K extends keyof T>(
   obj: T | undefined | null,
   keys: readonly K[]
-): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
-  const result = {} as Pick<T, K>;
-  for (const key of keys) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[key] = obj[key];
-    }
-  }
-  return result;
-}
+): Pick<T, K> | undefined | null {}
 
killedBy: pick — property-based result only has keys from the keys array that exist on obj
statusReason: Property failed after 1 tests
{ seed: -1973122113, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false},[]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/pick.ts:24:7
   obj: T | undefined | null,
   keys: readonly K[]
 ): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
killedBy: pick — contract undefined → undefined
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
helpers/object/pick.ts:24:7
   obj: T | undefined | null,
   keys: readonly K[]
 ): Pick<T, K> | undefined | null {
-  if (obj === undefined || obj === null) return obj;
+  if (false || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
killedBy: pick — contract undefined → undefined
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
helpers/object/pick.ts:26:27
 ): Pick<T, K> | undefined | null {
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
-  for (const key of keys) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
-      result[key] = obj[key];
-    }
-  }
+  for (const key of keys) {}
   return result;
 }
killedBy: pick — property-based pick(obj, Object.keys(obj)) deep-equals obj
statusReason: Property failed after 1 tests
{ seed: 1223419383, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/pick.ts:27:9
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
+    if (true) {
       result[key] = obj[key];
     }
killedBy: pick — contract does not pick inherited keys (uses hasOwnProperty)
statusReason: expected { inherited: 99 } to deeply equal {}

[Killed] ConditionalExpression
helpers/object/pick.ts:27:9
   if (obj === undefined || obj === null) return obj;
   const result = {} as Pick<T, K>;
   for (const key of keys) {
-    if (Object.prototype.hasOwnProperty.call(obj, key)) {
+    if (false) {
       result[key] = obj[key];
     }
killedBy: pick — property-based pick(obj, Object.keys(obj)) deep-equals obj
statusReason: Property failed after 1 tests
{ seed: 443491877, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":""}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
