[Killed] BlockStatement
helpers/object/removeUndefinedNull.ts:43:167
  * @returns A shallow copy of the object without null or undefined values
  * @since 1.0.0
  */
-export function removeUndefinedNull<T extends Record<string, string | number | boolean | null | undefined>>(obj: T | null | undefined): Partial<T> | null | undefined {
-  if (!obj) return obj;
-  const result: Record<string, unknown> = {};
-  for (const [k, v] of Object.entries(obj)) {
-    if (!isNullish(v)) { result[k] = v; }
-  }
-  return result as Partial<T>;
-}
+export function removeUndefinedNull<T extends Record<string, string | number | boolean | null | undefined>>(obj: T | null | undefined): Partial<T> | null | undefined {}
 
 
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: -214424551, path: "0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":undefined,"c":false}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/object/removeUndefinedNull.ts:44:7
  * @since 1.0.0
  */
 export function removeUndefinedNull<T extends Record<string, string | number | boolean | null | undefined>>(obj: T | null | undefined): Partial<T> | null | undefined {
-  if (!obj) return obj;
+  if (obj) return obj;
   const result: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(obj)) {
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: -512498188, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":null,"c":false}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/removeUndefinedNull.ts:44:7
  * @since 1.0.0
  */
 export function removeUndefinedNull<T extends Record<string, string | number | boolean | null | undefined>>(obj: T | null | undefined): Partial<T> | null | undefined {
-  if (!obj) return obj;
+  if (true) return obj;
   const result: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(obj)) {
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: 874741378, path: "0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":null,"c":undefined}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/object/removeUndefinedNull.ts:46:45
 export function removeUndefinedNull<T extends Record<string, string | number | boolean | null | undefined>>(obj: T | null | undefined): Partial<T> | null | undefined {
   if (!obj) return obj;
   const result: Record<string, unknown> = {};
-  for (const [k, v] of Object.entries(obj)) {
-    if (!isNullish(v)) { result[k] = v; }
-  }
+  for (const [k, v] of Object.entries(obj)) {}
   return result as Partial<T>;
 }
killedBy: removeUndefinedNull — property-based all non-null/non-undefined values from input are preserved
statusReason: Property failed after 1 tests
{ seed: -1486455149, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/removeUndefinedNull.ts:47:9
   if (!obj) return obj;
   const result: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(obj)) {
-    if (!isNullish(v)) { result[k] = v; }
+    if (true) { result[k] = v; }
   }
   return result as Partial<T>;
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: 1152449175, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":undefined}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/object/removeUndefinedNull.ts:47:9
   if (!obj) return obj;
   const result: Record<string, unknown> = {};
   for (const [k, v] of Object.entries(obj)) {
-    if (!isNullish(v)) { result[k] = v; }
+    if (false) { result[k] = v; }
   }
   return result as Partial<T>;
killedBy: removeUndefinedNull — property-based all non-null/non-undefined values from input are preserved
statusReason: Property failed after 1 tests
{ seed: 2098092235, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
