[Killed] BlockStatement
helpers/object/safeJsonParse.ts:24:73
  */
 export function safeJsonParse<T>(input: string): T | null;
 export function safeJsonParse<T>(input: string, fallback: T): T;
-export function safeJsonParse<T>(input: string, fallback?: T): T | null {
-  try {
-    return JSON.parse(input) as T;
-  } catch {
-    // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
-    // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
-  }
-}
+export function safeJsonParse<T>(input: string, fallback?: T): T | null {}
 
killedBy: safeJsonParse parses a valid JSON object
statusReason: expected undefined to deeply equal { a: 1 }

[Killed] BlockStatement
helpers/object/safeJsonParse.ts:25:7
 export function safeJsonParse<T>(input: string): T | null;
 export function safeJsonParse<T>(input: string, fallback: T): T;
 export function safeJsonParse<T>(input: string, fallback?: T): T | null {
-  try {
-    return JSON.parse(input) as T;
-  } catch {
+  try {} catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
     // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
killedBy: safeJsonParse parses a valid JSON object
statusReason: expected undefined to deeply equal { a: 1 }

[Killed] BlockStatement
helpers/object/safeJsonParse.ts:27:11
 export function safeJsonParse<T>(input: string, fallback?: T): T | null {
   try {
     return JSON.parse(input) as T;
-  } catch {
-    // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
-    // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
-  }
+  } catch {}
 }
 
killedBy: safeJsonParse returns null by default on invalid JSON
statusReason: expected undefined to be null

[Killed] EqualityOperator
helpers/object/safeJsonParse.ts:30:12
   } catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
     // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
+    return arguments.length >= 2 ? null : (fallback as T);
   }
 }
killedBy: safeJsonParse returns null by default on invalid JSON
statusReason: expected undefined to be null

[Killed] EqualityOperator
helpers/object/safeJsonParse.ts:30:12
   } catch {
     // Distinguish "no fallback provided" (→ null) from "fallback is undefined"
     // (→ undefined as T) to keep runtime behaviour aligned with the overloads.
-    return arguments.length < 2 ? null : (fallback as T);
+    return arguments.length <= 2 ? null : (fallback as T);
   }
 }
killedBy: safeJsonParse returns the fallback on invalid JSON
statusReason: expected null to deeply equal []
