[Killed] BlockStatement
helpers/observable/combineLatest.ts:56:139
  * each input Observable.
  * @since 1.0.0
  */
-export function combineLatest(input: readonly ObservableInput<unknown>[] | Record<string, ObservableInput<unknown>>): Observable<unknown> {
-  if (Array.isArray(input)) {
-    const filtered = input.filter(isDefined);
-    return filtered.length ? combineLatestOperator(filtered) : of([]);
-  } else {
-    const filtered = Object.fromEntries(
-      Object.entries(input).filter(([_, v]) => isDefined(v)),
-    );
-    return Object.keys(filtered).length
-      ? combineLatestOperator(filtered)
-      : of({});
-  }
-}
+export function combineLatest(input: readonly ObservableInput<unknown>[] | Record<string, ObservableInput<unknown>>): Observable<unknown> {}
 
killedBy: combineLatest with array
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] ConditionalExpression
helpers/observable/combineLatest.ts:57:7
  * @since 1.0.0
  */
 export function combineLatest(input: readonly ObservableInput<unknown>[] | Record<string, ObservableInput<unknown>>): Observable<unknown> {
-  if (Array.isArray(input)) {
+  if (true) {
     const filtered = input.filter(isDefined);
     return filtered.length ? combineLatestOperator(filtered) : of([]);
killedBy: combineLatest with object
statusReason: input.filter is not a function

[Killed] ConditionalExpression
helpers/observable/combineLatest.ts:57:7
  * @since 1.0.0
  */
 export function combineLatest(input: readonly ObservableInput<unknown>[] | Record<string, ObservableInput<unknown>>): Observable<unknown> {
-  if (Array.isArray(input)) {
+  if (false) {
     const filtered = input.filter(isDefined);
     return filtered.length ? combineLatestOperator(filtered) : of([]);
killedBy: combineLatest with array
statusReason: expected { '0': 1, '1': 2 } to deeply equal [ 1, 2 ]

[Killed] MethodExpression
helpers/observable/combineLatest.ts:58:22
  */
 export function combineLatest(input: readonly ObservableInput<unknown>[] | Record<string, ObservableInput<unknown>>): Observable<unknown> {
   if (Array.isArray(input)) {
-    const filtered = input.filter(isDefined);
+    const filtered = input;
     return filtered.length ? combineLatestOperator(filtered) : of([]);
   } else {
killedBy: combineLatest with array containing falsy values
statusReason: You provided 'null' where a stream was expected. You can provide an Observable, Promise, ReadableStream, Array, AsyncIterable, or Iterable.

[Killed] BlockStatement
helpers/observable/combineLatest.ts:60:10
   if (Array.isArray(input)) {
     const filtered = input.filter(isDefined);
     return filtered.length ? combineLatestOperator(filtered) : of([]);
-  } else {
-    const filtered = Object.fromEntries(
-      Object.entries(input).filter(([_, v]) => isDefined(v)),
-    );
-    return Object.keys(filtered).length
-      ? combineLatestOperator(filtered)
-      : of({});
-  }
+  } else {}
 }
 
killedBy: combineLatest with object
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
helpers/observable/combineLatest.ts:62:36
     return filtered.length ? combineLatestOperator(filtered) : of([]);
   } else {
     const filtered = Object.fromEntries(
-      Object.entries(input).filter(([_, v]) => isDefined(v)),
+      Object.entries(input).filter(() => undefined),
     );
     return Object.keys(filtered).length
killedBy: combineLatest with object
statusReason: expected {} to deeply equal { a: 1, b: 2 }

[Killed] MethodExpression
helpers/observable/combineLatest.ts:62:7
     return filtered.length ? combineLatestOperator(filtered) : of([]);
   } else {
     const filtered = Object.fromEntries(
-      Object.entries(input).filter(([_, v]) => isDefined(v)),
+      Object.entries(input),
     );
     return Object.keys(filtered).length
killedBy: combineLatest with object containing falsy values
statusReason: You provided 'null' where a stream was expected. You can provide an Observable, Promise, ReadableStream, Array, AsyncIterable, or Iterable.
