[Killed] BlockStatement
helpers/promise/consoleLogPromise.ts:13:71
  * @returns A function that logs and returns the data
  * @since 1.0.0
  */
-export function consoleLogPromise<T>(prefix?: string): (data: T) => T {
-    return (data: T) => {
-        console.log(prefix, data);
-        return data;
-    };
-}
+export function consoleLogPromise<T>(prefix?: string): (data: T) => T {}
 
killedBy: consoleLogPromise — property-based returned function is identity for any value
statusReason: Property failed after 1 tests
{ seed: -663109959, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/consoleLogPromise.ts:14:25
  * @since 1.0.0
  */
 export function consoleLogPromise<T>(prefix?: string): (data: T) => T {
-    return (data: T) => {
-        console.log(prefix, data);
-        return data;
-    };
+    return (data: T) => {};
 }
 
killedBy: consoleLogPromise — property-based returned function is identity for any value
statusReason: Property failed after 1 tests
{ seed: -772718172, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
