[Killed] ArrayDeclaration
helpers/promise/defer.ts:41:38
 export async function defer<T>(
   fn: (defer: (callback: DeferCallback) => void) => Promise<T>,
 ): Promise<T> {
-  const callbacks: DeferCallback[] = [];
+  const callbacks: DeferCallback[] = ["Stryker was here"];
   const addDefer = (cb: DeferCallback): void => {
     callbacks.push(cb);
killedBy: defer returns the resolved value of the main function
statusReason: callbacks[i] is not a function

[Killed] BlockStatement
helpers/promise/defer.ts:42:49
   fn: (defer: (callback: DeferCallback) => void) => Promise<T>,
 ): Promise<T> {
   const callbacks: DeferCallback[] = [];
-  const addDefer = (cb: DeferCallback): void => {
-    callbacks.push(cb);
-  };
+  const addDefer = (cb: DeferCallback): void => {};
 
   let result: T;
killedBy: defer calls a single deferred callback after the main function
statusReason: expected [ 'work' ] to deeply equal [ 'work', 'cleanup' ]

[Killed] BooleanLiteral
helpers/promise/defer.ts:48:15
 
   let result: T;
   let caughtError: unknown;
-  let threw = false;
+  let threw = true;
 
   try {
killedBy: defer returns the resolved value of the main function
statusReason: undefined

[Killed] BlockStatement
helpers/promise/defer.ts:50:7
   let caughtError: unknown;
   let threw = false;
 
-  try {
-    result = await fn(addDefer);
-  } catch (err) {
+  try {} catch (err) {
     caughtError = err;
     threw = true;
killedBy: defer returns the resolved value of the main function
statusReason: expected undefined to be 42 // Object.is equality

[Killed] BlockStatement
helpers/promise/defer.ts:52:17
 
   try {
     result = await fn(addDefer);
-  } catch (err) {
-    caughtError = err;
-    threw = true;
-  }
+  } catch (err) {}
 
   for (let i = callbacks.length - 1; i >= 0; i--) {
killedBy: defer runs callbacks even when the main function throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
helpers/promise/defer.ts:54:13
     result = await fn(addDefer);
   } catch (err) {
     caughtError = err;
-    threw = true;
+    threw = false;
   }
 
killedBy: defer runs callbacks even when the main function throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
helpers/promise/defer.ts:57:38
     threw = true;
   }
 
-  for (let i = callbacks.length - 1; i >= 0; i--) {
+  for (let i = callbacks.length - 1; i > 0; i--) {
     // Sequential LIFO execution is intentional: each cleanup awaits the previous
     // eslint-disable-next-line no-await-in-loop
killedBy: defer calls a single deferred callback after the main function
statusReason: expected [ 'work' ] to deeply equal [ 'work', 'cleanup' ]

[Killed] EqualityOperator
helpers/promise/defer.ts:57:38
     threw = true;
   }
 
-  for (let i = callbacks.length - 1; i >= 0; i--) {
+  for (let i = callbacks.length - 1; i < 0; i--) {
     // Sequential LIFO execution is intentional: each cleanup awaits the previous
     // eslint-disable-next-line no-await-in-loop
killedBy: defer returns the resolved value of the main function
statusReason: callbacks[i] is not a function

[Killed] ConditionalExpression
helpers/promise/defer.ts:63:7
     await callbacks[i]!(threw ? caughtError : undefined);
   }
 
-  if (threw) throw caughtError;
+  if (false) throw caughtError;
   return result!;
 }
killedBy: defer runs callbacks even when the main function throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
helpers/promise/defer.ts:63:7
     await callbacks[i]!(threw ? caughtError : undefined);
   }
 
-  if (threw) throw caughtError;
+  if (true) throw caughtError;
   return result!;
 }
killedBy: defer returns the resolved value of the main function
statusReason: undefined
