[Killed] BlockStatement
helpers/promise/delay.ts:14:68
  * @returns Promise that resolves after delay
  * @since 1.9.0
  */
-export function delay<T = void>(ms: number, value?: T): Promise<T> {
-  return new Promise(resolve => {
-    setTimeout(() => resolve(value as T), ms);
-  });
-}
+export function delay<T = void>(ms: number, value?: T): Promise<T> {}
 
killedBy: delay — contract resolves after the specified milliseconds
statusReason: Cannot read properties of undefined (reading 'then')

[Killed] BlockStatement
helpers/promise/delay.ts:15:33
  * @since 1.9.0
  */
 export function delay<T = void>(ms: number, value?: T): Promise<T> {
-  return new Promise(resolve => {
-    setTimeout(() => resolve(value as T), ms);
-  });
+  return new Promise(resolve => {});
 }
 
killedBy: delay — contract resolves after the specified milliseconds
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
helpers/promise/delay.ts:16:16
  */
 export function delay<T = void>(ms: number, value?: T): Promise<T> {
   return new Promise(resolve => {
-    setTimeout(() => resolve(value as T), ms);
+    setTimeout(() => undefined, ms);
   });
 }
killedBy: delay — contract resolves after the specified milliseconds
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
