[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:13:79
  * @returns A function that returns the data if falsy, or throws
  * @since 1.0.0
  */
-export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-    return (data: unknown) => {
-        if (data) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
-            return data as T;
-        }
-    };
-}
+export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {}
 
killedBy: falsyPromiseOrThrow — property-based any falsy value passes through without throwing
statusReason: Property failed after 1 tests
{ seed: -1921672829, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:14:31
  * @since 1.0.0
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-    return (data: unknown) => {
-        if (data) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
-            return data as T;
-        }
-    };
+    return (data: unknown) => {};
 }
 
killedBy: falsyPromiseOrThrow — property-based any falsy value passes through without throwing
statusReason: Property failed after 1 tests
{ seed: -1285036184, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/falsyPromiseOrThrow.ts:15:13
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
     return (data: unknown) => {
-        if (data) {
+        if (true) {
             // eslint-disable-next-line functional/no-throw-statement
             throw new Error(error);
killedBy: falsyPromiseOrThrow — property-based any falsy value passes through without throwing
statusReason: Property failed after 1 tests
{ seed: -57959448, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:15:19
  */
 export function falsyPromiseOrThrow<T>(error: string): (data: T) => T | never {
     return (data: unknown) => {
-        if (data) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
+        if (data) {} else {
             return data as T;
         }
killedBy: falsyPromiseOrThrow — property-based any truthy value throws
statusReason: Property failed after 1 tests
{ seed: 651108164, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/falsyPromiseOrThrow.ts:18:16
         if (data) {
             // eslint-disable-next-line functional/no-throw-statement
             throw new Error(error);
-        } else {
-            return data as T;
-        }
+        } else {}
     };
 }
killedBy: falsyPromiseOrThrow — property-based any falsy value passes through without throwing
statusReason: Property failed after 1 tests
{ seed: 1088151517, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
