[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:16:27
  */
 export function meaningPromiseOrThrow<T>(
     error: string
-): (data: T) => T | never {
-    return (data: unknown) => {
-        if (
-            data === undefined ||
-            data === null ||
-            data === '' ||
-            isEmptyObject(data) ||
-            // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
-            isEmptyArray(data as any[])
-        ) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
-            return data as T;
-        }
-    };
-}
+): (data: T) => T | never {}
 
 // eslint-disable-next-line @typescript-eslint/ban-types
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: 794454456, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:17:31
 export function meaningPromiseOrThrow<T>(
     error: string
 ): (data: T) => T | never {
-    return (data: unknown) => {
-        if (
-            data === undefined ||
-            data === null ||
-            data === '' ||
-            isEmptyObject(data) ||
-            // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
-            isEmptyArray(data as any[])
-        ) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
-            return data as T;
-        }
-    };
+    return (data: unknown) => {};
 }
 
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: 1193087867, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/promise/meaningPromiseOrThrow.ts:19:13
 ): (data: T) => T | never {
     return (data: unknown) => {
         if (
-            data === undefined ||
-            data === null ||
-            data === '' ||
+            (data === undefined || data === null) && data === '' ||
             isEmptyObject(data) ||
             // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: null
statusReason: expected [Function] to throw error including 'meaningless' but got 'Cannot convert undefined or null to o…'

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:19:13
 ): (data: T) => T | never {
     return (data: unknown) => {
         if (
-            data === undefined ||
-            data === null ||
-            data === '' ||
-            isEmptyObject(data) ||
-            // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
-            isEmptyArray(data as any[])
+            true
         ) {
             // eslint-disable-next-line functional/no-throw-statement
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: 1925537086, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:20:13
     return (data: unknown) => {
         if (
             data === undefined ||
-            data === null ||
+            false ||
             data === '' ||
             isEmptyObject(data) ||
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: null
statusReason: expected [Function] to throw error including 'meaningless' but got 'Cannot convert undefined or null to o…'

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:20:13
     return (data: unknown) => {
         if (
             data === undefined ||
-            data === null ||
+            data !== null ||
             data === '' ||
             isEmptyObject(data) ||
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: -1092726644, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:21:13
         if (
             data === undefined ||
             data === null ||
-            data === '' ||
+            data !== '' ||
             isEmptyObject(data) ||
             // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: -1993722667, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:21:13
         if (
             data === undefined ||
             data === null ||
-            data === '' ||
+            false ||
             isEmptyObject(data) ||
             // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
killedBy: meaningPromiseOrThrow — contract throws for meaningless value:
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:25:11
             isEmptyObject(data) ||
             // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
             isEmptyArray(data as any[])
-        ) {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        } else {
+        ) {} else {
             return data as T;
         }
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: null
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:35:46
 }
 
 // eslint-disable-next-line @typescript-eslint/ban-types
-function isEmptyObject(obj: object): boolean {
-    return (
-        Object.keys(obj).length === 0 &&
-        Object.getPrototypeOf(obj) === Object.prototype
-    );
-}
+function isEmptyObject(obj: object): boolean {}
 
 // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: {}
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:37:9
 // eslint-disable-next-line @typescript-eslint/ban-types
 function isEmptyObject(obj: object): boolean {
     return (
-        Object.keys(obj).length === 0 &&
-        Object.getPrototypeOf(obj) === Object.prototype
+        true
     );
 }
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: 1947831701, path: "0:0", endOnFailure: true }
Counterexample: [1]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:37:9
 // eslint-disable-next-line @typescript-eslint/ban-types
 function isEmptyObject(obj: object): boolean {
     return (
-        Object.keys(obj).length === 0 &&
+        true &&
         Object.getPrototypeOf(obj) === Object.prototype
     );
killedBy: meaningPromiseOrThrow — property-based non-empty objects pass through
statusReason: Property failed after 2 tests
{ seed: -998860139, path: "1", endOnFailure: true }
Counterexample: [{"key":" "}]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/meaningPromiseOrThrow.ts:38:9
 function isEmptyObject(obj: object): boolean {
     return (
         Object.keys(obj).length === 0 &&
-        Object.getPrototypeOf(obj) === Object.prototype
+        true
     );
 }
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: -2136144017, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:38:9
 function isEmptyObject(obj: object): boolean {
     return (
         Object.keys(obj).length === 0 &&
-        Object.getPrototypeOf(obj) === Object.prototype
+        Object.getPrototypeOf(obj) !== Object.prototype
     );
 }
killedBy: meaningPromiseOrThrow — property-based non-meaningless primitive values pass through
statusReason: Property failed after 1 tests
{ seed: -1684754170, path: "0", endOnFailure: true }
Counterexample: [false]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/meaningPromiseOrThrow.ts:43:44
 }
 
 // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
-function isEmptyArray(arr: any[]): boolean {
-    return arr.constructor === Array && arr.length === 0;
-}
+function isEmptyArray(arr: any[]): boolean {}
 
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: undefined
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
helpers/promise/meaningPromiseOrThrow.ts:44:12
 
 // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
 function isEmptyArray(arr: any[]): boolean {
-    return arr.constructor === Array && arr.length === 0;
+    return arr.constructor === Array || arr.length === 0;
 }
 
killedBy: meaningPromiseOrThrow — property-based non-empty arrays pass through
statusReason: Property failed after 1 tests
{ seed: -1699351131, path: "0:0:0", endOnFailure: true }
Counterexample: [[0]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/promise/meaningPromiseOrThrow.ts:44:12
 
 // eslint-disable-next-line functional/prefer-readonly-type, @typescript-eslint/no-explicit-any
 function isEmptyArray(arr: any[]): boolean {
-    return arr.constructor === Array && arr.length === 0;
+    return arr.constructor !== Array && arr.length === 0;
 }
 
killedBy: meaningPromiseOrThrow — contract throws for meaningless value: undefined
statusReason: expected [Function] to throw an error
