[Killed] BlockStatement
helpers/promise/parallel.ts:23:17
 export async function parallel<T>(
   functions: readonly (() => Promise<T>)[],
   limit: number,
-): Promise<T[]> {
-  const results: T[] = [];
-  const clampedLimit = Number.isFinite(limit) ? Math.max(1, Math.floor(limit)) : 1;
-  let nextIndex = 0;
-
-  async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
-    const currentIndex = nextIndex++;
-    results[currentIndex] = await functions[currentIndex]();
-    return runNext();
-  }
-
-  const workers = Array.from(
-    { length: Math.min(clampedLimit, functions.length) },
-    () => runNext(),
-  );
-
-  await Promise.all(workers);
-  return results;
-}
+): Promise<T[]> {}
 
killedBy: parallel should resolve all functions
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ArrayDeclaration
helpers/promise/parallel.ts:24:24
   functions: readonly (() => Promise<T>)[],
   limit: number,
 ): Promise<T[]> {
-  const results: T[] = [];
+  const results: T[] = ["Stryker was here"];
   const clampedLimit = Number.isFinite(limit) ? Math.max(1, Math.floor(limit)) : 1;
   let nextIndex = 0;
killedBy: parallel should handle empty array
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] MethodExpression
helpers/promise/parallel.ts:25:49
   limit: number,
 ): Promise<T[]> {
   const results: T[] = [];
-  const clampedLimit = Number.isFinite(limit) ? Math.max(1, Math.floor(limit)) : 1;
+  const clampedLimit = Number.isFinite(limit) ? Math.min(1, Math.floor(limit)) : 1;
   let nextIndex = 0;
 
killedBy: parallel should clamp limit to at least 1
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
helpers/promise/parallel.ts:28:43
   const clampedLimit = Number.isFinite(limit) ? Math.max(1, Math.floor(limit)) : 1;
   let nextIndex = 0;
 
-  async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
-    const currentIndex = nextIndex++;
-    results[currentIndex] = await functions[currentIndex]();
-    return runNext();
-  }
+  async function runNext(): Promise<void> {}
 
   const workers = Array.from(
killedBy: parallel should resolve all functions
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
helpers/promise/parallel.ts:29:9
   let nextIndex = 0;
 
   async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
+    if (nextIndex > functions.length) return;
     const currentIndex = nextIndex++;
     results[currentIndex] = await functions[currentIndex]();
killedBy: parallel should resolve all functions
statusReason: functions[currentIndex] is not a function

[Killed] ConditionalExpression
helpers/promise/parallel.ts:29:9
   let nextIndex = 0;
 
   async function runNext(): Promise<void> {
-    if (nextIndex >= functions.length) return;
+    if (false) return;
     const currentIndex = nextIndex++;
     results[currentIndex] = await functions[currentIndex]();
killedBy: parallel should resolve all functions
statusReason: functions[currentIndex] is not a function

[Killed] UpdateOperator
helpers/promise/parallel.ts:30:26
 
   async function runNext(): Promise<void> {
     if (nextIndex >= functions.length) return;
-    const currentIndex = nextIndex++;
+    const currentIndex = nextIndex--;
     results[currentIndex] = await functions[currentIndex]();
     return runNext();
killedBy: parallel should resolve all functions
statusReason: functions[currentIndex] is not a function

[Killed] MethodExpression
helpers/promise/parallel.ts:36:15
   }
 
   const workers = Array.from(
-    { length: Math.min(clampedLimit, functions.length) },
+    { length: Math.max(clampedLimit, functions.length) },
     () => runNext(),
   );
killedBy: parallel should respect concurrency limit
statusReason: expected 5 to be less than or equal to 2

[Killed] ArrowFunction
helpers/promise/parallel.ts:37:5
 
   const workers = Array.from(
     { length: Math.min(clampedLimit, functions.length) },
-    () => runNext(),
+    () => undefined,
   );
 
killedBy: parallel should resolve all functions
statusReason: expected [] to deeply equal [ 1, 2, 3 ]
