[Killed] BlockStatement
helpers/promise/retry.ts:19:15
   fn: () => Promise<T>,
   maxAttempts: number = 3,
   delayMs: number = 1000
-): Promise<T> {
-  try {
-    return await fn();
-  } catch (error) {
-    if (maxAttempts <= 1) {
-      throw error;
-    }
-    await new Promise(resolve => setTimeout(resolve, delayMs));
-    return retry(fn, maxAttempts - 1, delayMs);
-  }
-}
+): Promise<T> {}
 
killedBy: retry — property-based if fn always succeeds, returns the correct value
statusReason: Property failed after 1 tests
{ seed: 1224166890, path: "0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/retry.ts:20:7
   maxAttempts: number = 3,
   delayMs: number = 1000
 ): Promise<T> {
-  try {
-    return await fn();
-  } catch (error) {
+  try {} catch (error) {
     if (maxAttempts <= 1) {
       throw error;
killedBy: retry — property-based if fn always succeeds, returns the correct value
statusReason: Property failed after 1 tests
{ seed: -2092447382, path: "0:0:0", endOnFailure: true }
Counterexample: [0,1]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/retry.ts:22:19
 ): Promise<T> {
   try {
     return await fn();
-  } catch (error) {
-    if (maxAttempts <= 1) {
-      throw error;
-    }
-    await new Promise(resolve => setTimeout(resolve, delayMs));
-    return retry(fn, maxAttempts - 1, delayMs);
-  }
+  } catch (error) {}
 }
 
killedBy: retry — property-based if fn always fails, throws after maxAttempts
statusReason: Property failed after 1 tests
{ seed: 308881933, path: "0", endOnFailure: true }
Counterexample: [1]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/retry.ts:23:27
   try {
     return await fn();
   } catch (error) {
-    if (maxAttempts <= 1) {
-      throw error;
-    }
+    if (maxAttempts <= 1) {}
     await new Promise(resolve => setTimeout(resolve, delayMs));
     return retry(fn, maxAttempts - 1, delayMs);
killedBy: retry — property-based if fn always fails, throws after maxAttempts
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
helpers/promise/retry.ts:23:9
   try {
     return await fn();
   } catch (error) {
-    if (maxAttempts <= 1) {
+    if (true) {
       throw error;
     }
killedBy: retry — property-based if fn always fails, throws after maxAttempts
statusReason: Property failed after 2 tests
{ seed: -1553009058, path: "1:1:0", endOnFailure: true }
Counterexample: [2]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/promise/retry.ts:26:23
     if (maxAttempts <= 1) {
       throw error;
     }
-    await new Promise(resolve => setTimeout(resolve, delayMs));
+    await new Promise(() => undefined);
     return retry(fn, maxAttempts - 1, delayMs);
   }
killedBy: retry — property-based if fn always fails, throws after maxAttempts
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArithmeticOperator
helpers/promise/retry.ts:27:22
       throw error;
     }
     await new Promise(resolve => setTimeout(resolve, delayMs));
-    return retry(fn, maxAttempts - 1, delayMs);
+    return retry(fn, maxAttempts + 1, delayMs);
   }
 }
killedBy: retry — property-based if fn always fails, throws after maxAttempts
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
