[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:13:80
  * @returns A function that returns the data if truthy, or throws
  * @since 1.0.0
  */
-export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-    return (data: unknown) => {
-        if (data) {
-            return data as T;
-        } else {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        }
-    };
-}
+export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {}
 
killedBy: truthyPromiseOrThrow — property-based any truthy value passes through
statusReason: Property failed after 1 tests
{ seed: -1754050821, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:14:31
  * @since 1.0.0
  */
 export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
-    return (data: unknown) => {
-        if (data) {
-            return data as T;
-        } else {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        }
-    };
+    return (data: unknown) => {};
 }
 
killedBy: truthyPromiseOrThrow — property-based any truthy value passes through
statusReason: Property failed after 1 tests
{ seed: -210511668, path: "0", endOnFailure: true }
Counterexample: [true]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/promise/truthyPromiseOrThrow.ts:15:13
  */
 export function truthyPromiseOrThrow<T>(error: string): (data: T) => T | never {
     return (data: unknown) => {
-        if (data) {
+        if (false) {
             return data as T;
         } else {
killedBy: truthyPromiseOrThrow — property-based any truthy value passes through
statusReason: Property failed after 1 tests
{ seed: -1515593568, path: "0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/promise/truthyPromiseOrThrow.ts:17:16
     return (data: unknown) => {
         if (data) {
             return data as T;
-        } else {
-            // eslint-disable-next-line functional/no-throw-statement
-            throw new Error(error);
-        }
+        } else {}
     };
 }
killedBy: truthyPromiseOrThrow — property-based any falsy value throws
statusReason: Property failed after 1 tests
{ seed: 480614761, path: "0", endOnFailure: true }
Counterexample: [0]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
