[Killed] BlockStatement
helpers/promise/tryit.ts:29:96
  */
 export function tryit<TArgs extends readonly unknown[], TReturn>(
   fn: (...args: TArgs) => TReturn,
-): (...args: TArgs) => TReturn extends Promise<infer U> ? Promise<Result<U>> : Result<TReturn> {
-  return ((...args: TArgs) => {
-    try {
-      const result = fn(...args);
-      if (result instanceof Promise) {
-        return result.then(
-          (value) => [undefined, value] as Result<unknown>,
-          (error) => [error instanceof Error ? error : new Error(String(error)), undefined] as Result<never>,
-        );
-      }
-      return [undefined, result];
-    } catch (error) {
-      return [error instanceof Error ? error : new Error(String(error)), undefined];
-    }
-  }) as (...args: TArgs) => TReturn extends Promise<infer U> ? Promise<Result<U>> : Result<TReturn>;
-}
+): (...args: TArgs) => TReturn extends Promise<infer U> ? Promise<Result<U>> : Result<TReturn> {}
 
killedBy: tryit — property-based result is always a tuple of length 2
statusReason: Property failed after 1 tests
{ seed: -337716708, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
