[Killed] BlockStatement
helpers/string/capitalize.ts:35:120
 export function capitalize(str: string, options?: CapitalizeOptions): string;
 export function capitalize(str: undefined, options?: CapitalizeOptions): undefined;
 export function capitalize(str: null, options?: CapitalizeOptions): null;
-export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  const { lowercaseRest = true } = options;
-  const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
-  return str.charAt(0).toUpperCase() + rest;
-}
+export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {}
 
killedBy: capitalize should capitalize first letter
statusReason: expected undefined to be 'Hello' // Object.is equality

[Killed] ConditionalExpression
helpers/string/capitalize.ts:36:7
 export function capitalize(str: undefined, options?: CapitalizeOptions): undefined;
 export function capitalize(str: null, options?: CapitalizeOptions): null;
 export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false) return str;
   const { lowercaseRest = true } = options;
   const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
killedBy: capitalize should return null when given null
statusReason: Cannot read properties of null (reading 'slice')

[Killed] ConditionalExpression
helpers/string/capitalize.ts:36:7
 export function capitalize(str: undefined, options?: CapitalizeOptions): undefined;
 export function capitalize(str: null, options?: CapitalizeOptions): null;
 export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false || str === null) return str;
   const { lowercaseRest = true } = options;
   const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
killedBy: capitalize should return undefined when given undefined
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] BooleanLiteral
helpers/string/capitalize.ts:37:27
 export function capitalize(str: null, options?: CapitalizeOptions): null;
 export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
   if (str === undefined || str === null) return str;
-  const { lowercaseRest = true } = options;
+  const { lowercaseRest = false } = options;
   const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
   return str.charAt(0).toUpperCase() + rest;
killedBy: capitalize should lowercase other letters
statusReason: expected 'HELLO' to be 'Hello' // Object.is equality

[Killed] MethodExpression
helpers/string/capitalize.ts:38:32
 export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
   if (str === undefined || str === null) return str;
   const { lowercaseRest = true } = options;
-  const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
+  const rest = lowercaseRest ? str.slice(1).toUpperCase() : str.slice(1);
   return str.charAt(0).toUpperCase() + rest;
 }
killedBy: capitalize should capitalize first letter
statusReason: expected 'HELLO' to be 'Hello' // Object.is equality

[Killed] MethodExpression
helpers/string/capitalize.ts:38:32
 export function capitalize(str: string | undefined | null, options: CapitalizeOptions = {}): string | undefined | null {
   if (str === undefined || str === null) return str;
   const { lowercaseRest = true } = options;
-  const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
+  const rest = lowercaseRest ? str.toLowerCase() : str.slice(1);
   return str.charAt(0).toUpperCase() + rest;
 }
killedBy: capitalize should capitalize first letter
statusReason: expected 'Hhello' to be 'Hello' // Object.is equality

[Killed] MethodExpression
helpers/string/capitalize.ts:39:10
   if (str === undefined || str === null) return str;
   const { lowercaseRest = true } = options;
   const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
-  return str.charAt(0).toUpperCase() + rest;
+  return str.toUpperCase() + rest;
 }
 
killedBy: capitalize should capitalize first letter
statusReason: expected 'HELLOello' to be 'Hello' // Object.is equality

[Killed] MethodExpression
helpers/string/capitalize.ts:39:10
   if (str === undefined || str === null) return str;
   const { lowercaseRest = true } = options;
   const rest = lowercaseRest ? str.slice(1).toLowerCase() : str.slice(1);
-  return str.charAt(0).toUpperCase() + rest;
+  return str.charAt(0).toLowerCase() + rest;
 }
 
killedBy: capitalize should capitalize first letter
statusReason: expected 'hello' to be 'Hello' // Object.is equality
