[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:45:9
 export function extractErrorMessage(error?: unknown, stringify?: boolean | string): string | undefined {
     // Create a control return
     const controlReturn: (message: string | undefined) => string | undefined =
-        stringify === true
+        false
             ? (a) => a ?? JSON.stringify(error)
             : typeof stringify === "string"
killedBy: extractErrorMessage should stringify error when stringify is true
statusReason: expected undefined to be '{"customError":"value"}' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:45:9
 export function extractErrorMessage(error?: unknown, stringify?: boolean | string): string | undefined {
     // Create a control return
     const controlReturn: (message: string | undefined) => string | undefined =
-        stringify === true
+        true
             ? (a) => a ?? JSON.stringify(error)
             : typeof stringify === "string"
killedBy: extractErrorMessage should return undefined when error is null
statusReason: expected 'null' to be undefined

[Killed] LogicalOperator
helpers/string/extractErrorMessage.ts:46:22
     // Create a control return
     const controlReturn: (message: string | undefined) => string | undefined =
         stringify === true
-            ? (a) => a ?? JSON.stringify(error)
+            ? (a) => a && JSON.stringify(error)
             : typeof stringify === "string"
                 ? (a) => a ?? stringify
killedBy: extractErrorMessage should stringify error when stringify is true
statusReason: expected undefined to be '{"customError":"value"}' // Object.is equality

[Killed] ArrowFunction
helpers/string/extractErrorMessage.ts:46:15
     // Create a control return
     const controlReturn: (message: string | undefined) => string | undefined =
         stringify === true
-            ? (a) => a ?? JSON.stringify(error)
+            ? () => undefined
             : typeof stringify === "string"
                 ? (a) => a ?? stringify
killedBy: extractErrorMessage should stringify error when stringify is true
statusReason: expected undefined to be '{"customError":"value"}' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:47:15
     const controlReturn: (message: string | undefined) => string | undefined =
         stringify === true
             ? (a) => a ?? JSON.stringify(error)
-            : typeof stringify === "string"
+            : false
                 ? (a) => a ?? stringify
                 : (a) => a;
killedBy: extractErrorMessage should return custom fallback when provided
statusReason: expected undefined to be 'default message' // Object.is equality

[Killed] EqualityOperator
helpers/string/extractErrorMessage.ts:47:15
     const controlReturn: (message: string | undefined) => string | undefined =
         stringify === true
             ? (a) => a ?? JSON.stringify(error)
-            : typeof stringify === "string"
+            : typeof stringify !== "string"
                 ? (a) => a ?? stringify
                 : (a) => a;
killedBy: extractErrorMessage should return undefined with unknown error object and stringify false
statusReason: expected false to be undefined

[Killed] LogicalOperator
helpers/string/extractErrorMessage.ts:48:26
         stringify === true
             ? (a) => a ?? JSON.stringify(error)
             : typeof stringify === "string"
-                ? (a) => a ?? stringify
+                ? (a) => a && stringify
                 : (a) => a;
 
killedBy: extractErrorMessage should return custom fallback when provided
statusReason: expected undefined to be 'default message' // Object.is equality

[Killed] ArrowFunction
helpers/string/extractErrorMessage.ts:48:19
         stringify === true
             ? (a) => a ?? JSON.stringify(error)
             : typeof stringify === "string"
-                ? (a) => a ?? stringify
+                ? () => undefined
                 : (a) => a;
 
killedBy: extractErrorMessage should return custom fallback when provided
statusReason: expected undefined to be 'default message' // Object.is equality

[Killed] ArrowFunction
helpers/string/extractErrorMessage.ts:49:19
             ? (a) => a ?? JSON.stringify(error)
             : typeof stringify === "string"
                 ? (a) => a ?? stringify
-                : (a) => a;
+                : () => undefined;
 
     // Pre-requisite: error
killedBy: extractErrorMessage should return string for number error
statusReason: expected undefined to be '123' // Object.is equality

[Killed] BooleanLiteral
helpers/string/extractErrorMessage.ts:52:9
                 : (a) => a;
 
     // Pre-requisite: error
-    if (!error) {
+    if (error) {
         return controlReturn(undefined);
     }
killedBy: extractErrorMessage should return undefined when error is null
statusReason: expected 'null' to be undefined

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:52:9
                 : (a) => a;
 
     // Pre-requisite: error
-    if (!error) {
+    if (true) {
         return controlReturn(undefined);
     }
killedBy: extractErrorMessage should return error when type is string
statusReason: expected undefined to be 'unexpected error' // Object.is equality

[Killed] EqualityOperator
helpers/string/extractErrorMessage.ts:57:9
     }
 
     // Pre-requisite: not a string
-    if (typeof error === "string") {
+    if (typeof error !== "string") {
         return error;
     }
killedBy: extractErrorMessage should return string for number error
statusReason: expected 123 to be '123' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:57:9
     }
 
     // Pre-requisite: not a string
-    if (typeof error === "string") {
+    if (true) {
         return error;
     }
killedBy: extractErrorMessage should return string for number error
statusReason: expected 123 to be '123' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:62:9
     }
 
     // Handle Error instances early (before isObject check)
-    if (error instanceof Error) {
+    if (true) {
         return String(error);
     }
killedBy: extractErrorMessage should return errorMessage when present in nested error
statusReason: expected '[object Object]' to be 'keycloak error' // Object.is equality

[Survived] ConditionalExpression
helpers/string/extractErrorMessage.ts:62:9
     }
 
     // Handle Error instances early (before isObject check)
-    if (error instanceof Error) {
+    if (false) {
         return String(error);
     }

[Killed] BlockStatement
helpers/string/extractErrorMessage.ts:67:32
     }
 
     // Pre-requisite: an object
-    if (!isPlainObject(error)) {
-        return controlReturn(String(error));
-    }
+    if (!isPlainObject(error)) {}
 
     const errObj = error as object;
killedBy: extractErrorMessage — contract non-plain object falls back to String(obj)
statusReason: expected undefined to be 'custom error' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:67:9
     }
 
     // Pre-requisite: an object
-    if (!isPlainObject(error)) {
+    if (false) {
         return controlReturn(String(error));
     }
killedBy: extractErrorMessage should return string for number error
statusReason: Cannot use 'in' operator to search for 'error' in 123

[Killed] BlockStatement
helpers/string/extractErrorMessage.ts:74:28
     const errObj = error as object;
 
     // Handle nested errors
-    if ("error" in errObj) {
-        return extractErrorMessage(errObj.error, stringify);
-    }
+    if ("error" in errObj) {}
 
     // Handle Keycloak specific errors
killedBy: extractErrorMessage — contract object with error string property returns error string
statusReason: expected undefined to be 'foo' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:74:9
     const errObj = error as object;
 
     // Handle nested errors
-    if ("error" in errObj) {
+    if (true) {
         return extractErrorMessage(errObj.error, stringify);
     }
killedBy: extractErrorMessage should return errorMessage when present in nested error
statusReason: expected undefined to be 'keycloak error' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:79:9
     }
 
     // Handle Keycloak specific errors
-    if ("errorMessage" in errObj) {
+    if (true) {
         return String(errObj.errorMessage);
     }
killedBy: extractErrorMessage should return message when present in error
statusReason: expected 'undefined' to be 'error message' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:79:9
     }
 
     // Handle Keycloak specific errors
-    if ("errorMessage" in errObj) {
+    if (false) {
         return String(errObj.errorMessage);
     }
killedBy: extractErrorMessage — contract object with errorMessage property returns errorMessage
statusReason: expected undefined to be 'foo' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:84:9
     }
 
     // Handle OpenID interception
-    if ("reason" in errObj && "params" in errObj) {
+    if (true) {
         const errOAuth = error as { type: string; reason: string; params?: unknown };
 
killedBy: extractErrorMessage should return message when present in error
statusReason: expected 'undefined: undefined' to be 'error message' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:84:9
     }
 
     // Handle OpenID interception
-    if ("reason" in errObj && "params" in errObj) {
+    if (false) {
         const errOAuth = error as { type: string; reason: string; params?: unknown };
 
killedBy: extractErrorMessage — contract object with reason and params (OAuth code_error) returns formatted string
statusReason: expected undefined to be 'access_denied: User denied access' // Object.is equality

[Killed] LogicalOperator
helpers/string/extractErrorMessage.ts:88:13
         const errOAuth = error as { type: string; reason: string; params?: unknown };
 
         if (
-            errOAuth.type === "code_error" &&
-            errOAuth.params &&
-            typeof errOAuth.params === "object" &&
-            "error" in errOAuth.params &&
-            "error_description" in errOAuth.params
+            errOAuth.type === "code_error" && errOAuth.params && typeof errOAuth.params === "object" && "error" in errOAuth.params || "error_description" in errOAuth.params
         ) {
             return `${String(errOAuth.params.error)}: ${String(errOAuth.params.error_description)}`;
killedBy: extractErrorMessage should handle OAuth errors with other type
statusReason: expected 'invalid_session: Session expired' to be 'auth_error: session_expired' // Object.is equality

[Killed] EqualityOperator
helpers/string/extractErrorMessage.ts:88:13
         const errOAuth = error as { type: string; reason: string; params?: unknown };
 
         if (
-            errOAuth.type === "code_error" &&
+            errOAuth.type !== "code_error" &&
             errOAuth.params &&
             typeof errOAuth.params === "object" &&
killedBy: extractErrorMessage should handle OAuth code_error with reason and params
statusReason: expected 'code_error: auth_failed' to be 'invalid_grant: Invalid credentials' // Object.is equality

[Killed] EqualityOperator
helpers/string/extractErrorMessage.ts:90:13
         if (
             errOAuth.type === "code_error" &&
             errOAuth.params &&
-            typeof errOAuth.params === "object" &&
+            typeof errOAuth.params !== "object" &&
             "error" in errOAuth.params &&
             "error_description" in errOAuth.params
killedBy: extractErrorMessage should handle OAuth code_error with reason and params
statusReason: expected 'code_error: auth_failed' to be 'invalid_grant: Invalid credentials' // Object.is equality

[Survived] ConditionalExpression
helpers/string/extractErrorMessage.ts:90:13
         if (
             errOAuth.type === "code_error" &&
             errOAuth.params &&
-            typeof errOAuth.params === "object" &&
+            true &&
             "error" in errOAuth.params &&
             "error_description" in errOAuth.params

[Killed] BlockStatement
helpers/string/extractErrorMessage.ts:93:11
             typeof errOAuth.params === "object" &&
             "error" in errOAuth.params &&
             "error_description" in errOAuth.params
-        ) {
-            return `${String(errOAuth.params.error)}: ${String(errOAuth.params.error_description)}`;
-        }
+        ) {}
 
         return `${errOAuth.type}: ${errOAuth.reason}`;
killedBy: extractErrorMessage should handle OAuth code_error with reason and params
statusReason: expected 'code_error: auth_failed' to be 'invalid_grant: Invalid credentials' // Object.is equality

[Killed] BlockStatement
helpers/string/extractErrorMessage.ts:101:30
     }
 
     // Handle objects with a message property
-    if ("message" in errObj) {
-        return String((errObj as { message: unknown }).message);
-    }
+    if ("message" in errObj) {}
 
     // Nothing found
killedBy: extractErrorMessage — contract object with message property returns message as string
statusReason: expected undefined to be 'foo' // Object.is equality

[Killed] ConditionalExpression
helpers/string/extractErrorMessage.ts:101:9
     }
 
     // Handle objects with a message property
-    if ("message" in errObj) {
+    if (true) {
         return String((errObj as { message: unknown }).message);
     }
killedBy: extractErrorMessage should stringify error when stringify is true
statusReason: expected 'undefined' to be '{"customError":"value"}' // Object.is equality
