[Killed] Regex
helpers/string/injectWordBreaks.ts:38:3
  * @internal
  */
 const D0_REGEX =
-  /https?:\/\/[^\s<>"{}|\\^[\]`]+|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}|<[^>]*>|&(?:#\d+|#x[0-9a-fA-F]+|[a-zA-Z]+);/g;
+  /https?:\/\/[^\s<>"{}|\\^[\]`]+|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[^a-zA-Z]{2,}|<[^>]*>|&(?:#\d+|#x[0-9a-fA-F]+|[a-zA-Z]+);/g;
 
 /**
killedBy: injectWordBreaks D0 — email address is protected
statusReason: expected 'contact test​@​example.​com please' to be 'contact test@example.com please' // Object.is equality

[Killed] Regex
helpers/string/injectWordBreaks.ts:38:3
  * @internal
  */
 const D0_REGEX =
-  /https?:\/\/[^\s<>"{}|\\^[\]`]+|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}|<[^>]*>|&(?:#\d+|#x[0-9a-fA-F]+|[a-zA-Z]+);/g;
+  /https?:\/\/[^\s<>"{}|\\^[\]`]+|[^a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}|<[^>]*>|&(?:#\d+|#x[0-9a-fA-F]+|[a-zA-Z]+);/g;
 
 /**
killedBy: injectWordBreaks D0 — email address is protected
statusReason: expected 'contact test​@​example.​com please' to be 'contact test@example.com please' // Object.is equality

[Killed] Regex
helpers/string/injectWordBreaks.ts:50:3
  * @internal
  */
 const ATOMIC_REGEX =
-  /[+-]?(?:\d{1,3}(?:,\d{3})+|\d+)(?:\.\d+)?(?:[eE][+-]?\d+)?[a-zA-Z%°]*/g;
+  /[^+-]?(?:\d{1,3}(?:,\d{3})+|\d+)(?:\.\d+)?(?:[eE][+-]?\d+)?[a-zA-Z%°]*/g;
 
 // ---------------------------------------------------------------------------
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: expected '-​0.1%' to be '-0.1%' // Object.is equality

[Killed] Regex
helpers/string/injectWordBreaks.ts:50:3
  * @internal
  */
 const ATOMIC_REGEX =
-  /[+-]?(?:\d{1,3}(?:,\d{3})+|\d+)(?:\.\d+)?(?:[eE][+-]?\d+)?[a-zA-Z%°]*/g;
+  /[+-]?(?:\D{1,3}(?:,\d{3})+|\d+)(?:\.\d+)?(?:[eE][+-]?\d+)?[a-zA-Z%°]*/g;
 
 // ---------------------------------------------------------------------------
killedBy: injectWordBreaks Pass 1 — localized number (1,234.56) is atomic
statusReason: expected '1,​234.56' to be '1,234.56' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:66:12
   pattern: RegExp,
   matchKind: GroupKind,
   restKind: GroupKind,
-): Group[] {
-  const groups: Group[] = [];
-  let lastIndex = 0;
-  pattern.lastIndex = 0;
-  let match: RegExpExecArray | null;
-  while ((match = pattern.exec(text)) !== null) {
-    if (match.index > lastIndex) {
-      groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
-    }
-    groups.push({ text: match[0], kind: matchKind });
-    lastIndex = match.index + match[0].length;
-  }
-  if (lastIndex < text.length) {
-    groups.push({ text: text.slice(lastIndex), kind: restKind });
-  }
-  return groups;
-}
+): Group[] {}
 
 /**
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: d0Groups is not iterable

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:71:49
   let lastIndex = 0;
   pattern.lastIndex = 0;
   let match: RegExpExecArray | null;
-  while ((match = pattern.exec(text)) !== null) {
-    if (match.index > lastIndex) {
-      groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
-    }
-    groups.push({ text: match[0], kind: matchKind });
-    lastIndex = match.index + match[0].length;
-  }
+  while ((match = pattern.exec(text)) !== null) {}
   if (lastIndex < text.length) {
     groups.push({ text: text.slice(lastIndex), kind: restKind });
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: expected '-​0.​1%' to be '-0.1%' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:71:10
   let lastIndex = 0;
   pattern.lastIndex = 0;
   let match: RegExpExecArray | null;
-  while ((match = pattern.exec(text)) !== null) {
+  while ((match = pattern.exec(text)) === null) {
     if (match.index > lastIndex) {
       groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: Cannot read properties of null (reading 'index')

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:72:9
   pattern.lastIndex = 0;
   let match: RegExpExecArray | null;
   while ((match = pattern.exec(text)) !== null) {
-    if (match.index > lastIndex) {
+    if (false) {
       groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
     }
killedBy: injectWordBreaks Example 5 — scientific notation preserved, comma attaches left
statusReason: expected '-2.4E+6,​avg' to be 'Δ=​-2.4E+6,​avg' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:72:34
   pattern.lastIndex = 0;
   let match: RegExpExecArray | null;
   while ((match = pattern.exec(text)) !== null) {
-    if (match.index > lastIndex) {
-      groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
-    }
+    if (match.index > lastIndex) {}
     groups.push({ text: match[0], kind: matchKind });
     lastIndex = match.index + match[0].length;
killedBy: injectWordBreaks Example 5 — scientific notation preserved, comma attaches left
statusReason: expected '-2.4E+6,​avg' to be 'Δ=​-2.4E+6,​avg' // Object.is equality

[Killed] MethodExpression
helpers/string/injectWordBreaks.ts:73:27
   let match: RegExpExecArray | null;
   while ((match = pattern.exec(text)) !== null) {
     if (match.index > lastIndex) {
-      groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
+      groups.push({ text: text, kind: restKind });
     }
     groups.push({ text: match[0], kind: matchKind });
killedBy: injectWordBreaks Example 5 — scientific notation preserved, comma attaches left
statusReason: expected 'Δ=-​2.​4E​+​6,​avg​-2.4E+6,​avg' to be 'Δ=​-2.4E+6,​avg' // Object.is equality

[Killed] ObjectLiteral
helpers/string/injectWordBreaks.ts:73:19
   let match: RegExpExecArray | null;
   while ((match = pattern.exec(text)) !== null) {
     if (match.index > lastIndex) {
-      groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
+      groups.push({});
     }
     groups.push({ text: match[0], kind: matchKind });
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 8 tests
{ seed: 1153365086, path: "7:2:1:8:5", endOnFailure: true }
Counterexample: [" 0"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:76:17
       groups.push({ text: text.slice(lastIndex, match.index), kind: restKind });
     }
     groups.push({ text: match[0], kind: matchKind });
-    lastIndex = match.index + match[0].length;
+    lastIndex = match.index - match[0].length;
   }
   if (lastIndex < text.length) {
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 2 tests
{ seed: -566653548, path: "1:1:0:3:2:1:5:3:3", endOnFailure: true }
Counterexample: ["0A"]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:78:7
     groups.push({ text: match[0], kind: matchKind });
     lastIndex = match.index + match[0].length;
   }
-  if (lastIndex < text.length) {
+  if (false) {
     groups.push({ text: text.slice(lastIndex), kind: restKind });
   }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:78:32
     groups.push({ text: match[0], kind: matchKind });
     lastIndex = match.index + match[0].length;
   }
-  if (lastIndex < text.length) {
-    groups.push({ text: text.slice(lastIndex), kind: restKind });
-  }
+  if (lastIndex < text.length) {}
   return groups;
 }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] MethodExpression
helpers/string/injectWordBreaks.ts:79:25
     lastIndex = match.index + match[0].length;
   }
   if (lastIndex < text.length) {
-    groups.push({ text: text.slice(lastIndex), kind: restKind });
+    groups.push({ text: text, kind: restKind });
   }
   return groups;
killedBy: injectWordBreaks Example 5 — scientific notation preserved, comma attaches left
statusReason: expected 'Δ=​-2.4E+6​Δ=-​2.​4E​+​6,​avg' to be 'Δ=​-2.4E+6,​avg' // Object.is equality

[Killed] ObjectLiteral
helpers/string/injectWordBreaks.ts:79:17
     lastIndex = match.index + match[0].length;
   }
   if (lastIndex < text.length) {
-    groups.push({ text: text.slice(lastIndex), kind: restKind });
+    groups.push({});
   }
   return groups;
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 3 tests
{ seed: 435597933, path: "2:1:1:2", endOnFailure: true }
Counterexample: ["  "]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:89:45
  * non-word segments.
  * @internal
  */
-function pass2Split(text: string): string[] {
-  const result: string[] = [];
-  const wordRegex = /[a-zA-Z0-9_]+/g;
-  let lastIndex = 0;
-  let match: RegExpExecArray | null;
-  while ((match = wordRegex.exec(text)) !== null) {
-    if (match.index > lastIndex) {
-      result.push(text.slice(lastIndex, match.index));
-    }
-    result.push(match[0]);
-    lastIndex = match.index + match[0].length;
-  }
-  if (lastIndex < text.length) {
-    result.push(text.slice(lastIndex));
-  }
-  return result;
-}
+function pass2Split(text: string): string[] {}
 
 /**
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: p2 is not iterable

[Killed] Regex
helpers/string/injectWordBreaks.ts:91:21
  */
 function pass2Split(text: string): string[] {
   const result: string[] = [];
-  const wordRegex = /[a-zA-Z0-9_]+/g;
+  const wordRegex = /[a-zA-Z0-9_]/g;
   let lastIndex = 0;
   let match: RegExpExecArray | null;
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'f', 'o', 'o,', 'b', 'a', 'r' ] to have a length of 2 but got 6

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:94:10
   const wordRegex = /[a-zA-Z0-9_]+/g;
   let lastIndex = 0;
   let match: RegExpExecArray | null;
-  while ((match = wordRegex.exec(text)) !== null) {
+  while ((match = wordRegex.exec(text)) === null) {
     if (match.index > lastIndex) {
       result.push(text.slice(lastIndex, match.index));
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: Cannot read properties of null (reading 'index')

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:94:10
   const wordRegex = /[a-zA-Z0-9_]+/g;
   let lastIndex = 0;
   let match: RegExpExecArray | null;
-  while ((match = wordRegex.exec(text)) !== null) {
+  while (false) {
     if (match.index > lastIndex) {
       result.push(text.slice(lastIndex, match.index));
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:95:9
   let lastIndex = 0;
   let match: RegExpExecArray | null;
   while ((match = wordRegex.exec(text)) !== null) {
-    if (match.index > lastIndex) {
+    if (match.index <= lastIndex) {
       result.push(text.slice(lastIndex, match.index));
     }
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 2 tests
{ seed: 1694998430, path: "1:1:1:1:6:5:5", endOnFailure: true }
Counterexample: [" A"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:95:9
   let lastIndex = 0;
   let match: RegExpExecArray | null;
   while ((match = wordRegex.exec(text)) !== null) {
-    if (match.index > lastIndex) {
+    if (false) {
       result.push(text.slice(lastIndex, match.index));
     }
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​bar' to be 'foo,​bar' // Object.is equality

[Killed] MethodExpression
helpers/string/injectWordBreaks.ts:96:19
   let match: RegExpExecArray | null;
   while ((match = wordRegex.exec(text)) !== null) {
     if (match.index > lastIndex) {
-      result.push(text.slice(lastIndex, match.index));
+      result.push(text);
     }
     result.push(match[0]);
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​foo,bar​bar' to be 'foo,​bar' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:99:17
       result.push(text.slice(lastIndex, match.index));
     }
     result.push(match[0]);
-    lastIndex = match.index + match[0].length;
+    lastIndex = match.index - match[0].length;
   }
   if (lastIndex < text.length) {
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 1 tests
{ seed: -744308334, path: "0:2:0:3:7:9:9", endOnFailure: true }
Counterexample: ["A  "]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:101:32
     result.push(match[0]);
     lastIndex = match.index + match[0].length;
   }
-  if (lastIndex < text.length) {
-    result.push(text.slice(lastIndex));
-  }
+  if (lastIndex < text.length) {}
   return result;
 }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] MethodExpression
helpers/string/injectWordBreaks.ts:102:17
     lastIndex = match.index + match[0].length;
   }
   if (lastIndex < text.length) {
-    result.push(text.slice(lastIndex));
+    result.push(text);
   }
   return result;
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 1 tests
{ seed: -462780315, path: "0:1:0:2:4:3:3", endOnFailure: true }
Counterexample: ["A "]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:111:45
  * Pass 3 — Split a word group at camelCase boundaries (lowercase → uppercase).
  * @internal
  */
-function pass3Split(text: string): string[] {
-  return text.split(/(?<=[a-z])(?=[A-Z])/);
-}
+function pass3Split(text: string): string[] {}
 
 /**
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: p3 is not iterable

[Killed] Regex
helpers/string/injectWordBreaks.ts:112:21
  * @internal
  */
 function pass3Split(text: string): string[] {
-  return text.split(/(?<=[a-z])(?=[A-Z])/);
+  return text.split(/(?<=[^a-z])(?=[A-Z])/);
 }
 
killedBy: injectWordBreaks Example 3 — camelCase splits at lowercase→uppercase boundaries
statusReason: expected 'getUserProfileData' to be 'get​User​Profile​Data' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:119:49
  * Pass 4 (word groups) — Isolate repeated underscore blocks (`__`, `___`, …).
  * @internal
  */
-function pass4WordSplit(text: string): string[] {
-  return text.split(/(_{2,})/).filter((s) => s.length > 0);
-}
+function pass4WordSplit(text: string): string[] {}
 
 /**
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: p4 is not iterable

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:120:46
  * @internal
  */
 function pass4WordSplit(text: string): string[] {
-  return text.split(/(_{2,})/).filter((s) => s.length > 0);
+  return text.split(/(_{2,})/).filter((s) => true);
 }
 
killedBy: injectWordBreaks — property-based output never starts or ends with a ZWS (input contains no ZWS)
statusReason: Property failed after 90 tests
{ seed: 1341962292, path: "89:1", endOnFailure: true }
Counterexample: ["__"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:120:46
  * @internal
  */
 function pass4WordSplit(text: string): string[] {
-  return text.split(/(_{2,})/).filter((s) => s.length > 0);
+  return text.split(/(_{2,})/).filter((s) => false);
 }
 
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 1 tests
{ seed: 1502894180, path: "0:1:0:1:4:2:3", endOnFailure: true }
Counterexample: [" A"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:127:52
  * Pass 4 (non-word groups) — Isolate `/` and `@` as standalone separators.
  * @internal
  */
-function pass4NonWordSplit(text: string): string[] {
-  return text.split(/([/@])/).filter((s) => s.length > 0);
-}
+function pass4NonWordSplit(text: string): string[] {}
 
 /** Returns true when `text` consists entirely of word characters. @internal */
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 1 tests
{ seed: -1095829755, path: "0:1:0:1:2:2", endOnFailure: true }
Counterexample: ["  "]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/string/injectWordBreaks.ts:128:38
  * @internal
  */
 function pass4NonWordSplit(text: string): string[] {
-  return text.split(/([/@])/).filter((s) => s.length > 0);
+  return text.split(/([/@])/).filter(() => undefined);
 }
 
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 2 tests
{ seed: -1328622187, path: "1:3:3:3:2:2", endOnFailure: true }
Counterexample: ["  "]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/string/injectWordBreaks.ts:128:10
  * @internal
  */
 function pass4NonWordSplit(text: string): string[] {
-  return text.split(/([/@])/).filter((s) => s.length > 0);
+  return text.split(/([/@])/);
 }
 
killedBy: injectWordBreaks — property-based output never starts or ends with a ZWS (input contains no ZWS)
statusReason: Property failed after 30 tests
{ seed: -2121557824, path: "29:9:7:6:6", endOnFailure: true }
Counterexample: ["/ "]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
helpers/string/injectWordBreaks.ts:132:21
 }
 
 /** Returns true when `text` consists entirely of word characters. @internal */
-const isWordGroup = (text: string): boolean => /^[a-zA-Z0-9_]+$/.test(text);
+const isWordGroup = () => undefined;
 
 /** Returns true when `text` consists entirely of whitespace. @internal */
killedBy: injectWordBreaks Example 3 — camelCase splits at lowercase→uppercase boundaries
statusReason: expected 'getUserProfileData' to be 'get​User​Profile​Data' // Object.is equality

[Survived] Regex
helpers/string/injectWordBreaks.ts:132:48
 }
 
 /** Returns true when `text` consists entirely of word characters. @internal */
-const isWordGroup = (text: string): boolean => /^[a-zA-Z0-9_]+$/.test(text);
+const isWordGroup = (text: string): boolean => /[a-zA-Z0-9_]+$/.test(text);
 
 /** Returns true when `text` consists entirely of whitespace. @internal */

[Killed] ArrowFunction
helpers/string/injectWordBreaks.ts:135:22
 const isWordGroup = (text: string): boolean => /^[a-zA-Z0-9_]+$/.test(text);
 
 /** Returns true when `text` consists entirely of whitespace. @internal */
-const isWhitespace = (text: string): boolean => /^\s+$/.test(text);
+const isWhitespace = () => undefined;
 
 /**
killedBy: injectWordBreaks D0 — URL adjacent to regular text: no ZWS next to the URL group
statusReason: expected 'visit​ https://example.com ​now' to be 'visit https://example.com now' // Object.is equality

[Killed] Regex
helpers/string/injectWordBreaks.ts:135:49
 const isWordGroup = (text: string): boolean => /^[a-zA-Z0-9_]+$/.test(text);
 
 /** Returns true when `text` consists entirely of whitespace. @internal */
-const isWhitespace = (text: string): boolean => /^\s+$/.test(text);
+const isWhitespace = (text: string): boolean => /^\S+$/.test(text);
 
 /**
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo,bar' ] to have a length of 2 but got 1

[Killed] Regex
helpers/string/injectWordBreaks.ts:142:24
  * a line never starts with one of these characters.
  * @internal
  */
-const TRAILING_PUNCT = /^[,.:;%)\]}]$/;
+const TRAILING_PUNCT = /^[^,.:;%)\]}]$/;
 
 /**
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​,​bar' to be 'foo,​bar' // Object.is equality

[Survived] Regex
helpers/string/injectWordBreaks.ts:142:24
  * a line never starts with one of these characters.
  * @internal
  */
-const TRAILING_PUNCT = /^[,.:;%)\]}]$/;
+const TRAILING_PUNCT = /[,.:;%)\]}]$/;
 
 /**

[Killed] ArrayDeclaration
helpers/string/injectWordBreaks.ts:157:18
  * @internal
  */
 function pass5Attach(groups: Group[]): Group[] {
-  const result = [...groups];
+  const result = [];
 
   // --- Trailing punctuation: attach to the immediate left neighbour ---
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:161:10
 
   // --- Trailing punctuation: attach to the immediate left neighbour ---
   let i = 0;
-  while (i < result.length) {
+  while (i >= result.length) {
     const g = result[i];
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo', ',', 'bar' ] to have a length of 2 but got 3

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:161:10
 
   // --- Trailing punctuation: attach to the immediate left neighbour ---
   let i = 0;
-  while (i < result.length) {
+  while (false) {
     const g = result[i];
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​,​bar' to be 'foo,​bar' // Object.is equality

[Killed] LogicalOperator
helpers/string/injectWordBreaks.ts:163:9
   let i = 0;
   while (i < result.length) {
     const g = result[i];
-    if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
+    if (g.kind !== 'd0' || TRAILING_PUNCT.test(g.text)) {
       const prev = i - 1;
       if (prev >= 0) {
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo,bar' ] to have a length of 2 but got 1

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:163:9
   let i = 0;
   while (i < result.length) {
     const g = result[i];
-    if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
+    if (false) {
       const prev = i - 1;
       if (prev >= 0) {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​,​bar' to be 'foo,​bar' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:164:20
   while (i < result.length) {
     const g = result[i];
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
-      const prev = i - 1;
+      const prev = i + 1;
       if (prev >= 0) {
         result[prev] = {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo​bar,' to be 'foo,​bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:165:11
     const g = result[i];
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
       const prev = i - 1;
-      if (prev >= 0) {
+      if (prev > 0) {
         result[prev] = {
           text: result[prev].text + g.text,
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo', ',', 'bar' ] to have a length of 2 but got 3

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:165:22
     const g = result[i];
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
       const prev = i - 1;
-      if (prev >= 0) {
-        result[prev] = {
-          text: result[prev].text + g.text,
-          kind: result[prev].kind,
-        };
-        result.splice(i, 1);
-        continue; // re-check same position
-      }
+      if (prev >= 0) {}
     }
     i++;
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo', ',', 'bar' ] to have a length of 2 but got 3

[Killed] ObjectLiteral
helpers/string/injectWordBreaks.ts:166:24
     if (g.kind !== 'd0' && TRAILING_PUNCT.test(g.text)) {
       const prev = i - 1;
       if (prev >= 0) {
-        result[prev] = {
-          text: result[prev].text + g.text,
-          kind: result[prev].kind,
-        };
+        result[prev] = {};
         result.splice(i, 1);
         continue; // re-check same position
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected '​bar' to be 'foo,​bar' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:167:17
       const prev = i - 1;
       if (prev >= 0) {
         result[prev] = {
-          text: result[prev].text + g.text,
+          text: result[prev].text - g.text,
           kind: result[prev].kind,
         };
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 11 tests
{ seed: 673671007, path: "10:1:0:2:1:2:5", endOnFailure: true }
Counterexample: ["/."]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:179:10
 
   // --- Leading punctuation: attach to the immediate right neighbour ---
   i = 0;
-  while (i < result.length) {
+  while (false) {
     const g = result[i];
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
killedBy: injectWordBreaks Pass 5 — opening paren attaches right
statusReason: expected 'foo​(​bar' to be 'foo​(bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:179:10
 
   // --- Leading punctuation: attach to the immediate right neighbour ---
   i = 0;
-  while (i < result.length) {
+  while (i <= result.length) {
     const g = result[i];
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] LogicalOperator
helpers/string/injectWordBreaks.ts:181:9
   i = 0;
   while (i < result.length) {
     const g = result[i];
-    if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
+    if (g.kind !== 'd0' || LEADING_PUNCT.test(g.text)) {
       const next = i + 1;
       if (next < result.length) {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:181:9
   i = 0;
   while (i < result.length) {
     const g = result[i];
-    if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
+    if (true) {
       const next = i + 1;
       if (next < result.length) {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:182:20
   while (i < result.length) {
     const g = result[i];
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
-      const next = i + 1;
+      const next = i - 1;
       if (next < result.length) {
         result[next] = {
killedBy: injectWordBreaks Pass 5 — opening paren attaches right
statusReason: expected '(foo​bar' to be 'foo​(bar' // Object.is equality
