[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:183:33
     const g = result[i];
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
       const next = i + 1;
-      if (next < result.length) {
-        result[next] = {
-          text: g.text + result[next].text,
-          kind: result[next].kind,
-        };
-        result.splice(i, 1);
-        continue; // re-check same position
-      }
+      if (next < result.length) {}
     }
     i++;
killedBy: injectWordBreaks Pass 5 — opening paren attaches right
statusReason: expected 'foo​(​bar' to be 'foo​(bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:183:11
     const g = result[i];
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
       const next = i + 1;
-      if (next < result.length) {
+      if (next <= result.length) {
         result[next] = {
           text: g.text + result[next].text,
killedBy: injectWordBreaks Pass 5 — leading punct at end with no right neighbour stays alone
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
helpers/string/injectWordBreaks.ts:184:24
     if (g.kind !== 'd0' && LEADING_PUNCT.test(g.text)) {
       const next = i + 1;
       if (next < result.length) {
-        result[next] = {
-          text: g.text + result[next].text,
-          kind: result[next].kind,
-        };
+        result[next] = {};
         result.splice(i, 1);
         continue; // re-check same position
killedBy: injectWordBreaks Pass 5 — opening paren attaches right
statusReason: expected 'foo​' to be 'foo​(bar' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:185:17
       const next = i + 1;
       if (next < result.length) {
         result[next] = {
-          text: g.text + result[next].text,
+          text: g.text - result[next].text,
           kind: result[next].kind,
         };
killedBy: injectWordBreaks Pass 5 — opening paren attaches right
statusReason: expected 'foo​NaN' to be 'foo​(bar' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:267:7
 export function injectWordBreaks(
   str: string | undefined | null,
 ): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false) return str;
 
   // Zero or one character can never have a break opportunity
killedBy: injectWordBreaks returns null when given null
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:267:7
 export function injectWordBreaks(
   str: string | undefined | null,
 ): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false || str === null) return str;
 
   // Zero or one character can never have a break opportunity
killedBy: injectWordBreaks returns undefined when given undefined
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:270:7
   if (str === undefined || str === null) return str;
 
   // Zero or one character can never have a break opportunity
-  if (str.length < 2) return str;
+  if (true) return str;
 
   // D0 — split into protected and non-protected segments
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:270:7
   if (str === undefined || str === null) return str;
 
   // Zero or one character can never have a break opportunity
-  if (str.length < 2) return str;
+  if (str.length >= 2) return str;
 
   // D0 — split into protected and non-protected segments
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] StringLiteral
helpers/string/injectWordBreaks.ts:273:47
   if (str.length < 2) return str;
 
   // D0 — split into protected and non-protected segments
-  const d0Groups = splitGroups(str, D0_REGEX, 'd0', 'regular');
+  const d0Groups = splitGroups(str, D0_REGEX, "", 'regular');
 
   // Pass 1 — split non-D0 segments by atomic numeric values
killedBy: injectWordBreaks D0 — HTML tag is protected (no ZWS adjacent to d0 groups)
statusReason: expected '<b>​bold​</b>' to be '<b>bold</b>' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:277:29
 
   // Pass 1 — split non-D0 segments by atomic numeric values
   const afterP1: Group[] = [];
-  for (const g of d0Groups) {
-    if (g.kind !== 'regular') {
-      afterP1.push(g);
-    } else {
-      const atomics = splitGroups(g.text, ATOMIC_REGEX, 'atomic', 'regular');
-      for (const a of atomics) {
-        afterP1.push(a);
-      }
-    }
-  }
+  for (const g of d0Groups) {}
 
   // Passes 2, 3, 4 — further split regular groups into fine-grained tokens
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:278:9
   // Pass 1 — split non-D0 segments by atomic numeric values
   const afterP1: Group[] = [];
   for (const g of d0Groups) {
-    if (g.kind !== 'regular') {
+    if (g.kind === 'regular') {
       afterP1.push(g);
     } else {
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: expected '-​0.​1%' to be '-0.1%' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:278:9
   // Pass 1 — split non-D0 segments by atomic numeric values
   const afterP1: Group[] = [];
   for (const g of d0Groups) {
-    if (g.kind !== 'regular') {
+    if (false) {
       afterP1.push(g);
     } else {
killedBy: injectWordBreaks Example 6 — URL is a D0 protected span (no ZWS injected)
statusReason: expected 'https:​/​/​example.​com​/​foo​/​bar' to be 'https://example.com/foo/bar' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:280:12
   for (const g of d0Groups) {
     if (g.kind !== 'regular') {
       afterP1.push(g);
-    } else {
-      const atomics = splitGroups(g.text, ATOMIC_REGEX, 'atomic', 'regular');
-      for (const a of atomics) {
-        afterP1.push(a);
-      }
-    }
+    } else {}
   }
 
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:282:32
       afterP1.push(g);
     } else {
       const atomics = splitGroups(g.text, ATOMIC_REGEX, 'atomic', 'regular');
-      for (const a of atomics) {
-        afterP1.push(a);
-      }
+      for (const a of atomics) {}
     }
   }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] ArrayDeclaration
helpers/string/injectWordBreaks.ts:289:30
   }
 
   // Passes 2, 3, 4 — further split regular groups into fine-grained tokens
-  const afterP234: Group[] = [];
+  const afterP234: Group[] = ["Stryker was here"];
   for (const g of afterP1) {
     if (g.kind !== 'regular') {
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: expected '​-0.1%' to be '-0.1%' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:291:9
   // Passes 2, 3, 4 — further split regular groups into fine-grained tokens
   const afterP234: Group[] = [];
   for (const g of afterP1) {
-    if (g.kind !== 'regular') {
+    if (false) {
       afterP234.push(g);
       continue;
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: expected '-​0.​1%' to be '-0.1%' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:291:9
   // Passes 2, 3, 4 — further split regular groups into fine-grained tokens
   const afterP234: Group[] = [];
   for (const g of afterP1) {
-    if (g.kind !== 'regular') {
+    if (true) {
       afterP234.push(g);
       continue;
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:296:28
       continue;
     }
     const p2 = pass2Split(g.text);
-    for (const part of p2) {
-      if (isWordGroup(part)) {
-        // Pass 3 — camelCase boundaries
-        const p3 = pass3Split(part);
-        for (const camelPart of p3) {
-          // Pass 4 — repeated underscores
-          const p4 = pass4WordSplit(camelPart);
-          for (const t of p4) {
-            afterP234.push({ text: t, kind: 'regular' });
-          }
-        }
-      } else {
-        // Pass 4 — isolate / and @ in non-word groups
-        const p4 = pass4NonWordSplit(part);
-        for (const t of p4) {
-          afterP234.push({ text: t, kind: 'regular' });
-        }
-      }
-    }
+    for (const part of p2) {}
   }
 
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:297:11
     }
     const p2 = pass2Split(g.text);
     for (const part of p2) {
-      if (isWordGroup(part)) {
+      if (false) {
         // Pass 3 — camelCase boundaries
         const p3 = pass3Split(part);
killedBy: injectWordBreaks Example 3 — camelCase splits at lowercase→uppercase boundaries
statusReason: expected 'getUserProfileData' to be 'get​User​Profile​Data' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:297:30
     }
     const p2 = pass2Split(g.text);
     for (const part of p2) {
-      if (isWordGroup(part)) {
-        // Pass 3 — camelCase boundaries
-        const p3 = pass3Split(part);
-        for (const camelPart of p3) {
-          // Pass 4 — repeated underscores
-          const p4 = pass4WordSplit(camelPart);
-          for (const t of p4) {
-            afterP234.push({ text: t, kind: 'regular' });
-          }
-        }
-      } else {
+      if (isWordGroup(part)) {} else {
         // Pass 4 — isolate / and @ in non-word groups
         const p4 = pass4NonWordSplit(part);
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected ',' to be 'foo,​bar' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:300:37
       if (isWordGroup(part)) {
         // Pass 3 — camelCase boundaries
         const p3 = pass3Split(part);
-        for (const camelPart of p3) {
-          // Pass 4 — repeated underscores
-          const p4 = pass4WordSplit(camelPart);
-          for (const t of p4) {
-            afterP234.push({ text: t, kind: 'regular' });
-          }
-        }
+        for (const camelPart of p3) {}
       } else {
         // Pass 4 — isolate / and @ in non-word groups
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected ',' to be 'foo,​bar' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:303:31
         for (const camelPart of p3) {
           // Pass 4 — repeated underscores
           const p4 = pass4WordSplit(camelPart);
-          for (const t of p4) {
-            afterP234.push({ text: t, kind: 'regular' });
-          }
+          for (const t of p4) {}
         }
       } else {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected ',' to be 'foo,​bar' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:307:14
             afterP234.push({ text: t, kind: 'regular' });
           }
         }
-      } else {
-        // Pass 4 — isolate / and @ in non-word groups
-        const p4 = pass4NonWordSplit(part);
-        for (const t of p4) {
-          afterP234.push({ text: t, kind: 'regular' });
-        }
-      }
+      } else {}
     }
   }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:310:29
       } else {
         // Pass 4 — isolate / and @ in non-word groups
         const p4 = pass4NonWordSplit(part);
-        for (const t of p4) {
-          afterP234.push({ text: t, kind: 'regular' });
-        }
+        for (const t of p4) {}
       }
     }
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:324:19
   // non-D0-protected groups. Use a parts array to avoid quadratic
   // string reallocation when building the output.
   const parts: string[] = [];
-  for (let i = 0; i < finalGroups.length; i++) {
+  for (let i = 0; false; i++) {
     parts.push(finalGroups[i].text);
     if (i < finalGroups.length - 1) {
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: expected '' to be '   ' // Object.is equality

[Killed] UpdateOperator
helpers/string/injectWordBreaks.ts:324:43
   // non-D0-protected groups. Use a parts array to avoid quadratic
   // string reallocation when building the output.
   const parts: string[] = [];
-  for (let i = 0; i < finalGroups.length; i++) {
+  for (let i = 0; i < finalGroups.length; i--) {
     parts.push(finalGroups[i].text);
     if (i < finalGroups.length - 1) {
killedBy: injectWordBreaks returns whitespace-only strings unchanged (no ZWS added around whitespace)
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:326:9
   const parts: string[] = [];
   for (let i = 0; i < finalGroups.length; i++) {
     parts.push(finalGroups[i].text);
-    if (i < finalGroups.length - 1) {
+    if (i >= finalGroups.length - 1) {
       const curr = finalGroups[i];
       const next = finalGroups[i + 1];
killedBy: injectWordBreaks — property-based non-ZWS characters are always preserved (visible text unchanged)
statusReason: Property failed after 1 tests
{ seed: 1131538356, path: "0:1:0:0:1:3:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [" !"]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:326:9
   const parts: string[] = [];
   for (let i = 0; i < finalGroups.length; i++) {
     parts.push(finalGroups[i].text);
-    if (i < finalGroups.length - 1) {
+    if (true) {
       const curr = finalGroups[i];
       const next = finalGroups[i + 1];
killedBy: injectWordBreaks Example 1 — atomic value "-0.1%" is never split
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ArithmeticOperator
helpers/string/injectWordBreaks.ts:328:32
     parts.push(finalGroups[i].text);
     if (i < finalGroups.length - 1) {
       const curr = finalGroups[i];
-      const next = finalGroups[i + 1];
+      const next = finalGroups[i - 1];
       if (
         !isWhitespace(curr.text) &&
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:330:9
       const curr = finalGroups[i];
       const next = finalGroups[i + 1];
       if (
-        !isWhitespace(curr.text) &&
-        !isWhitespace(next.text) &&
-        curr.kind !== 'd0' &&
-        next.kind !== 'd0'
+        false
       ) {
         parts.push(ZWS);
killedBy: injectWordBreaks — contract spec Example 2: foo,bar gets exactly one ZWS
statusReason: expected [ 'foo,bar' ] to have a length of 2 but got 1

[Killed] BooleanLiteral
helpers/string/injectWordBreaks.ts:330:9
       const curr = finalGroups[i];
       const next = finalGroups[i + 1];
       if (
-        !isWhitespace(curr.text) &&
+        isWhitespace(curr.text) &&
         !isWhitespace(next.text) &&
         curr.kind !== 'd0' &&
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] BooleanLiteral
helpers/string/injectWordBreaks.ts:331:9
       const next = finalGroups[i + 1];
       if (
         !isWhitespace(curr.text) &&
-        !isWhitespace(next.text) &&
+        isWhitespace(next.text) &&
         curr.kind !== 'd0' &&
         next.kind !== 'd0'
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:332:9
       if (
         !isWhitespace(curr.text) &&
         !isWhitespace(next.text) &&
-        curr.kind !== 'd0' &&
+        true &&
         next.kind !== 'd0'
       ) {
killedBy: injectWordBreaks D0 — HTML tag is protected (no ZWS adjacent to d0 groups)
statusReason: expected '<b>​bold</b>' to be '<b>bold</b>' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:332:9
       if (
         !isWhitespace(curr.text) &&
         !isWhitespace(next.text) &&
-        curr.kind !== 'd0' &&
+        curr.kind === 'd0' &&
         next.kind !== 'd0'
       ) {
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] EqualityOperator
helpers/string/injectWordBreaks.ts:333:9
         !isWhitespace(curr.text) &&
         !isWhitespace(next.text) &&
         curr.kind !== 'd0' &&
-        next.kind !== 'd0'
+        next.kind === 'd0'
       ) {
         parts.push(ZWS);
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality

[Killed] ConditionalExpression
helpers/string/injectWordBreaks.ts:333:9
         !isWhitespace(curr.text) &&
         !isWhitespace(next.text) &&
         curr.kind !== 'd0' &&
-        next.kind !== 'd0'
+        true
       ) {
         parts.push(ZWS);
killedBy: injectWordBreaks D0 — HTML tag is protected (no ZWS adjacent to d0 groups)
statusReason: expected '<b>bold​</b>' to be '<b>bold</b>' // Object.is equality

[Killed] BlockStatement
helpers/string/injectWordBreaks.ts:334:9
         !isWhitespace(next.text) &&
         curr.kind !== 'd0' &&
         next.kind !== 'd0'
-      ) {
-        parts.push(ZWS);
-      }
+      ) {}
     }
   }
killedBy: injectWordBreaks Example 2 — trailing comma attaches left: "foo,bar" → "foo," + ZWS + "bar"
statusReason: expected 'foo,bar' to be 'foo,​bar' // Object.is equality
