[Killed] BlockStatement
helpers/string/leadingSentence.ts:34:56
  * // => 'No terminator here'
  * @since next
  */
-export function leadingSentence(input: string): string {
-  const clean = input.replace(/\n/g, ' ').trim();
-  const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
-  return clean.slice(0, match.index + 1);
-}
+export function leadingSentence(input: string): string {}
 
killedBy: leadingSentence extracts sentence ending with period
statusReason: expected undefined to be 'Hello world.' // Object.is equality

[Killed] MethodExpression
helpers/string/leadingSentence.ts:35:17
  * @since next
  */
 export function leadingSentence(input: string): string {
-  const clean = input.replace(/\n/g, ' ').trim();
+  const clean = input.replace(/\n/g, ' ');
   const match = clean.match(/[.?!…;](?:\s|$)/);
   if (match === null || match.index === undefined) return clean;
killedBy: leadingSentence trims leading and trailing whitespace
statusReason: expected '  Hello.' to be 'Hello.' // Object.is equality

[Killed] Regex
helpers/string/leadingSentence.ts:36:29
  */
 export function leadingSentence(input: string): string {
   const clean = input.replace(/\n/g, ' ').trim();
-  const match = clean.match(/[.?!…;](?:\s|$)/);
+  const match = clean.match(/[.?!…;](?:\S|$)/);
   if (match === null || match.index === undefined) return clean;
   return clean.slice(0, match.index + 1);
killedBy: leadingSentence extracts sentence ending with period
statusReason: expected 'Hello world. More text here.' to be 'Hello world.' // Object.is equality

[Survived] Regex
helpers/string/leadingSentence.ts:36:29
  */
 export function leadingSentence(input: string): string {
   const clean = input.replace(/\n/g, ' ').trim();
-  const match = clean.match(/[.?!…;](?:\s|$)/);
+  const match = clean.match(/[.?!…;](?:\s)/);
   if (match === null || match.index === undefined) return clean;
   return clean.slice(0, match.index + 1);

[Killed] EqualityOperator
helpers/string/leadingSentence.ts:37:25
 export function leadingSentence(input: string): string {
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
+  if (match === null || match.index !== undefined) return clean;
   return clean.slice(0, match.index + 1);
 }
killedBy: leadingSentence extracts sentence ending with period
statusReason: expected 'Hello world. More text here.' to be 'Hello world.' // Object.is equality

[Killed] LogicalOperator
helpers/string/leadingSentence.ts:37:7
 export function leadingSentence(input: string): string {
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
-  if (match === null || match.index === undefined) return clean;
+  if (match === null && match.index === undefined) return clean;
   return clean.slice(0, match.index + 1);
 }
killedBy: leadingSentence returns full string when no terminator found
statusReason: Cannot read properties of null (reading 'index')

[Killed] ArithmeticOperator
helpers/string/leadingSentence.ts:38:25
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
   if (match === null || match.index === undefined) return clean;
-  return clean.slice(0, match.index + 1);
+  return clean.slice(0, match.index - 1);
 }
 
killedBy: leadingSentence extracts sentence ending with period
statusReason: expected 'Hello worl' to be 'Hello world.' // Object.is equality

[Killed] MethodExpression
helpers/string/leadingSentence.ts:38:10
   const clean = input.replace(/\n/g, ' ').trim();
   const match = clean.match(/[.?!…;](?:\s|$)/);
   if (match === null || match.index === undefined) return clean;
-  return clean.slice(0, match.index + 1);
+  return clean;
 }
 
killedBy: leadingSentence extracts sentence ending with period
statusReason: expected 'Hello world. More text here.' to be 'Hello world.' // Object.is equality
