[Killed] BlockStatement
helpers/string/pascalCase.ts:20:87
 export function pascalCase(str: string): string;
 export function pascalCase(str: undefined): undefined;
 export function pascalCase(str: null): null;
-export function pascalCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
-    .filter(Boolean)
-    .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
-    .join('');
-}
+export function pascalCase(str: string | undefined | null): string | undefined | null {}
 
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected undefined to be 'CamelCase' // Object.is equality

[Killed] LogicalOperator
helpers/string/pascalCase.ts:21:7
 export function pascalCase(str: undefined): undefined;
 export function pascalCase(str: null): null;
 export function pascalCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str === undefined && str === null) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
killedBy: pascalCase should return null when given null
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
helpers/string/pascalCase.ts:21:28
 export function pascalCase(str: undefined): undefined;
 export function pascalCase(str: null): null;
 export function pascalCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str === undefined || false) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
killedBy: pascalCase should return null when given null
statusReason: Cannot read properties of null (reading 'replace')

[Survived] MethodExpression
helpers/string/pascalCase.ts:22:10
 export function pascalCase(str: null): null;
 export function pascalCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
-    .filter(Boolean)
+  return str.replace(/([a-z0-9])([A-Z])/g, '$1 $2').replace(/([A-Z])([A-Z][a-z])/g, '$1 $2').split(/[\s_-]+/)
     .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
     .join('');

[Killed] Regex
helpers/string/pascalCase.ts:23:14
 export function pascalCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
   return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
+    .replace(/([a-z0-9])([^A-Z])/g, '$1 $2')
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected 'CAmElcaSe' to be 'CamelCase' // Object.is equality

[Killed] StringLiteral
helpers/string/pascalCase.ts:24:38
   if (str === undefined || str === null) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
+    .replace(/([A-Z])([A-Z][a-z])/g, "")
     .split(/[\s_-]+/)
     .filter(Boolean)
killedBy: pascalCase should handle multiple uppercase letters
statusReason: expected 'XmtpRequest' to be 'XmlHttpRequest' // Object.is equality

[Killed] Regex
helpers/string/pascalCase.ts:25:12
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
+    .split(/[\S_-]+/)
     .filter(Boolean)
     .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected ' ' to be 'CamelCase' // Object.is equality

[Killed] Regex
helpers/string/pascalCase.ts:25:12
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1 $2')
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
-    .split(/[\s_-]+/)
+    .split(/[^\s_-]+/)
     .filter(Boolean)
     .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected ' ' to be 'CamelCase' // Object.is equality

[Killed] ArithmeticOperator
helpers/string/pascalCase.ts:27:18
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean)
-    .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
+    .map(word => word.charAt(0).toUpperCase() - word.slice(1).toLowerCase())
     .join('');
 }
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected 'NaNNaN' to be 'CamelCase' // Object.is equality

[Killed] MethodExpression
helpers/string/pascalCase.ts:27:49
     .replace(/([A-Z])([A-Z][a-z])/g, '$1 $2')
     .split(/[\s_-]+/)
     .filter(Boolean)
-    .map(word => word.charAt(0).toUpperCase() + word.slice(1).toLowerCase())
+    .map(word => word.charAt(0).toUpperCase() + word.slice(1).toUpperCase())
     .join('');
 }
killedBy: pascalCase should convert camelCase to PascalCase
statusReason: expected 'CAMELCASE' to be 'CamelCase' // Object.is equality
