[Killed] BlockStatement
helpers/string/slugify.ts:21:84
 export function slugify(str: string): string;
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
-export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  return str
-    .normalize('NFKD')
-    .replace(/[\u0300-\u036f]/g, '')
-    .toLowerCase()
-    .trim()
-    .replace(/['’]/g, '')
-    .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-+|-+$/g, '')
-    .replace(/-{2,}/g, '-');
-}
+export function slugify(str: string | undefined | null): string | undefined | null {}
 
killedBy: slugify should convert words to lowercase hyphen-separated slug
statusReason: expected undefined to be 'hello-world' // Object.is equality

[Killed] ConditionalExpression
helpers/string/slugify.ts:22:7
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false) return str;
   return str
     .normalize('NFKD')
killedBy: slugify should return null when given null
statusReason: Cannot read properties of null (reading 'normalize')

[Killed] ConditionalExpression
helpers/string/slugify.ts:22:7
 export function slugify(str: undefined): undefined;
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false || str === null) return str;
   return str
     .normalize('NFKD')
killedBy: slugify should return undefined when given undefined
statusReason: Cannot read properties of undefined (reading 'normalize')

[Killed] MethodExpression
helpers/string/slugify.ts:23:10
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return str
-    .normalize('NFKD')
-    .replace(/[\u0300-\u036f]/g, '')
-    .toLowerCase()
+  return str.normalize('NFKD').replace(/[\u0300-\u036f]/g, '').toUpperCase()
     .trim()
     .replace(/['’]/g, '')
killedBy: slugify should convert words to lowercase hyphen-separated slug
statusReason: expected '' to be 'hello-world' // Object.is equality

[Survived] MethodExpression
helpers/string/slugify.ts:23:10
 export function slugify(str: null): null;
 export function slugify(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return str
-    .normalize('NFKD')
-    .replace(/[\u0300-\u036f]/g, '')
-    .toLowerCase()
-    .trim()
+  return str.normalize('NFKD').replace(/[\u0300-\u036f]/g, '').toLowerCase()
     .replace(/['’]/g, '')
     .replace(/[^a-z0-9]+/g, '-')

[Survived] Regex
helpers/string/slugify.ts:31:14
     .replace(/['’]/g, '')
     .replace(/[^a-z0-9]+/g, '-')
     .replace(/^-+|-+$/g, '')
-    .replace(/-{2,}/g, '-');
+    .replace(/-/g, '-');
 }
 
