[Killed] BlockStatement
helpers/string/snakeCase.ts:20:86
 export function snakeCase(str: string): string;
 export function snakeCase(str: undefined): undefined;
 export function snakeCase(str: null): null;
-export function snakeCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
-  return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1_$2')
-    .replace(/[\s-]+/g, '_')
-    .toLowerCase();
-}
+export function snakeCase(str: string | undefined | null): string | undefined | null {}
 
killedBy: snakeCase should convert camelCase to snake_case
statusReason: expected undefined to be 'camel_case' // Object.is equality

[Killed] ConditionalExpression
helpers/string/snakeCase.ts:21:28
 export function snakeCase(str: undefined): undefined;
 export function snakeCase(str: null): null;
 export function snakeCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (str === undefined || false) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
killedBy: snakeCase should return null when given null
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
helpers/string/snakeCase.ts:21:7
 export function snakeCase(str: undefined): undefined;
 export function snakeCase(str: null): null;
 export function snakeCase(str: string | undefined | null): string | undefined | null {
-  if (str === undefined || str === null) return str;
+  if (false) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
killedBy: snakeCase should return null when given null
statusReason: Cannot read properties of null (reading 'replace')

[Killed] MethodExpression
helpers/string/snakeCase.ts:22:10
 export function snakeCase(str: null): null;
 export function snakeCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
-  return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1_$2')
-    .replace(/[\s-]+/g, '_')
-    .toLowerCase();
+  return str.replace(/([a-z0-9])([A-Z])/g, '$1_$2').replace(/([A-Z])([A-Z][a-z])/g, '$1_$2').replace(/[\s-]+/g, '_').toUpperCase();
 }
 
killedBy: snakeCase should convert camelCase to snake_case
statusReason: expected 'CAMEL_CASE' to be 'camel_case' // Object.is equality

[Killed] StringLiteral
helpers/string/snakeCase.ts:23:36
 export function snakeCase(str: string | undefined | null): string | undefined | null {
   if (str === undefined || str === null) return str;
   return str
-    .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
+    .replace(/([a-z0-9])([A-Z])/g, "")
     .replace(/([A-Z])([A-Z][a-z])/g, '$1_$2')
     .replace(/[\s-]+/g, '_')
killedBy: snakeCase should convert camelCase to snake_case
statusReason: expected 'camease' to be 'camel_case' // Object.is equality

[Killed] Regex
helpers/string/snakeCase.ts:24:14
   if (str === undefined || str === null) return str;
   return str
     .replace(/([a-z0-9])([A-Z])/g, '$1_$2')
-    .replace(/([A-Z])([A-Z][a-z])/g, '$1_$2')
+    .replace(/([^A-Z])([A-Z][a-z])/g, '$1_$2')
     .replace(/[\s-]+/g, '_')
     .toLowerCase();
killedBy: snakeCase should convert camelCase to snake_case
statusReason: expected 'camel__case' to be 'camel_case' // Object.is equality
