[Killed] BlockStatement
helpers/string/template.ts:32:78
  * // 'Hello, !'  (unknown keys become empty string)
  * @since next
  */
-export function template(str: string, data: Record<string, unknown>): string {
-  return str.replace(/\{\{\s*(\w+)\s*\}\}/g, (_, key: string) => String(data[key] ?? ''));
-}
+export function template(str: string, data: Record<string, unknown>): string {}
 
killedBy: template replaces a single placeholder
statusReason: expected undefined to be 'Hello, Alice!' // Object.is equality

[Killed] ArrowFunction
helpers/string/template.ts:33:46
  * @since next
  */
 export function template(str: string, data: Record<string, unknown>): string {
-  return str.replace(/\{\{\s*(\w+)\s*\}\}/g, (_, key: string) => String(data[key] ?? ''));
+  return str.replace(/\{\{\s*(\w+)\s*\}\}/g, () => undefined);
 }
 
killedBy: template replaces a single placeholder
statusReason: expected 'Hello, undefined!' to be 'Hello, Alice!' // Object.is equality

[Killed] LogicalOperator
helpers/string/template.ts:33:73
  * @since next
  */
 export function template(str: string, data: Record<string, unknown>): string {
-  return str.replace(/\{\{\s*(\w+)\s*\}\}/g, (_, key: string) => String(data[key] ?? ''));
+  return str.replace(/\{\{\s*(\w+)\s*\}\}/g, (_, key: string) => String(data[key] && ''));
 }
 
killedBy: template replaces a single placeholder
statusReason: expected 'Hello, !' to be 'Hello, Alice!' // Object.is equality
