[Killed] BlockStatement
helpers/type/isArray.ts:17:61
  * isArray({})        // => false
  * @since 1.9.0
  */
-export function isArray(value: unknown): value is unknown[] {
-  return Array.isArray(value);
-}
+export function isArray(value: unknown): value is unknown[] {}
 
killedBy: equalsUnordered — contract [[1,2]] vs [[2,1]] returns true (recursive order-independent check)
statusReason: expected false to be true // Object.is equality
