[Killed] BlockStatement
helpers/type/isArrayBuffer.ts:21:69
  * isArrayBuffer('hello')            // => false
  * @since next
  */
-export function isArrayBuffer(value: unknown): value is ArrayBuffer {
-  return value instanceof ArrayBuffer;
-}
+export function isArrayBuffer(value: unknown): value is ArrayBuffer {}
 
killedBy: isArrayBuffer — property-based ArrayBuffer instances always return true
statusReason: Property failed after 1 tests
{ seed: 318306006, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
