[Killed] BlockStatement
helpers/type/isAsyncFunction.ts:21:100
  * isAsyncFunction(42)                  // => false
  * @since 2.0.0
  */
-export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {
-  return typeof value === 'function' && value.constructor.name === 'AsyncFunction';
-}
+export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {}
 
killedBy: isAsyncFunction — property-based isAsyncFunction(v) → isFunction(v)
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isAsyncFunction.ts:22:10
  * @since 2.0.0
  */
 export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {
-  return typeof value === 'function' && value.constructor.name === 'AsyncFunction';
+  return false;
 }
 
killedBy: isAsyncFunction — property-based isAsyncFunction(v) → isFunction(v)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/type/isAsyncFunction.ts:22:10
  * @since 2.0.0
  */
 export function isAsyncFunction(value: unknown): value is (...args: unknown[]) => Promise<unknown> {
-  return typeof value === 'function' && value.constructor.name === 'AsyncFunction';
+  return typeof value === 'function' || value.constructor.name === 'AsyncFunction';
 }
 
killedBy: isAsyncFunction — property-based primitives are never async functions
statusReason: Property failed after 1 tests
{ seed: -1686279587, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
