[Killed] BlockStatement
helpers/type/isBigInt.ts:17:59
  * isBigInt('42') // => false
  * @since 2.0.0
  */
-export function isBigInt(value: unknown): value is bigint {
-  return typeof value === 'bigint';
-}
+export function isBigInt(value: unknown): value is bigint {}
 
killedBy: isBigInt — property-based bigint values are always bigint
statusReason: Property failed after 1 tests
{ seed: 1621771469, path: "0:0", endOnFailure: true }
Counterexample: [0n]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isBigInt.ts:18:10
  * @since 2.0.0
  */
 export function isBigInt(value: unknown): value is bigint {
-  return typeof value === 'bigint';
+  return typeof value !== 'bigint';
 }
 
killedBy: isBigInt — property-based bigint values are always bigint
statusReason: Property failed after 1 tests
{ seed: -462579239, path: "0:0", endOnFailure: true }
Counterexample: [0n]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isBigInt.ts:18:10
  * @since 2.0.0
  */
 export function isBigInt(value: unknown): value is bigint {
-  return typeof value === 'bigint';
+  return true;
 }
 
killedBy: isBigInt — property-based numbers are never bigint
statusReason: Property failed after 1 tests
{ seed: -420825106, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
