[Killed] BlockStatement
helpers/type/isBlob.ts:21:55
  * isBlob('hello')                    // => false
  * @since next
  */
-export function isBlob(value: unknown): value is Blob {
-  return typeof Blob !== 'undefined' && value instanceof Blob;
-}
+export function isBlob(value: unknown): value is Blob {}
 
killedBy: isBlob — property-based Blob instances always return true
statusReason: Property failed after 1 tests
{ seed: -789504926, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isBlob.ts:22:10
  * @since next
  */
 export function isBlob(value: unknown): value is Blob {
-  return typeof Blob !== 'undefined' && value instanceof Blob;
+  return true;
 }
 
killedBy: isBlob — property-based primitives never return true
statusReason: Property failed after 1 tests
{ seed: 1850721691, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/type/isBlob.ts:22:10
  * @since next
  */
 export function isBlob(value: unknown): value is Blob {
-  return typeof Blob !== 'undefined' && value instanceof Blob;
+  return typeof Blob !== 'undefined' || value instanceof Blob;
 }
 
killedBy: isBlob — property-based primitives never return true
statusReason: Property failed after 1 tests
{ seed: -877976296, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
