[Killed] BlockStatement
helpers/type/isBuffer.ts:25:59
  * isBuffer('hello')              // => false
  * @since next
  */
-export function isBuffer(value: unknown): value is Buffer {
-  return typeof Buffer !== 'undefined' && value instanceof Buffer;
-}
+export function isBuffer(value: unknown): value is Buffer {}
 
killedBy: isBuffer — property-based Buffer.from(string) always returns true
statusReason: Property failed after 1 tests
{ seed: -1460050324, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isBuffer.ts:26:10
  * @since next
  */
 export function isBuffer(value: unknown): value is Buffer {
-  return typeof Buffer !== 'undefined' && value instanceof Buffer;
+  return false;
 }
 
killedBy: isBuffer — property-based Buffer.from(string) always returns true
statusReason: Property failed after 1 tests
{ seed: 531549316, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/type/isBuffer.ts:26:10
  * @since next
  */
 export function isBuffer(value: unknown): value is Buffer {
-  return typeof Buffer !== 'undefined' && value instanceof Buffer;
+  return typeof Buffer !== 'undefined' || value instanceof Buffer;
 }
 
killedBy: isBuffer — property-based primitives never return true
statusReason: Property failed after 1 tests
{ seed: 360910573, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
