[Killed] BlockStatement
helpers/type/isDate.ts:25:55
  * @see {@link isTimestamp} for checking if a number is a valid timestamp
  * @since 2.0.0
  */
-export function isDate(value: unknown): value is Date {
-  return value instanceof Date;
-}
+export function isDate(value: unknown): value is Date {}
 
killedBy: isDate — property-based Date instances always pass (even invalid)
statusReason: Property failed after 1 tests
{ seed: 394501668, path: "0:0", endOnFailure: true }
Counterexample: [new Date("1970-01-01T00:00:00.000Z")]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
