[Killed] BlockStatement
helpers/type/isDefined.ts:33:59
  * @see {@link isTruthy} to also filter out `0`, `""`, `false`, and `NaN`
  * @since 2.0.0
  */
-export function isDefined<T>(value: Maybe<T>): value is T {
-  return value !== undefined && value !== null;
-}
+export function isDefined<T>(value: Maybe<T>): value is T {}
 
killedBy: combineLatest with array
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] EqualityOperator
helpers/type/isDefined.ts:34:10
  * @since 2.0.0
  */
 export function isDefined<T>(value: Maybe<T>): value is T {
-  return value !== undefined && value !== null;
+  return value === undefined && value !== null;
 }
 
killedBy: combineLatest with array
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
helpers/type/isDefined.ts:34:10
  * @since 2.0.0
  */
 export function isDefined<T>(value: Maybe<T>): value is T {
-  return value !== undefined && value !== null;
+  return false;
 }
 
killedBy: combineLatest with array
statusReason: expected [] to deeply equal [ 1, 2 ]
