[Killed] ConditionalExpression
helpers/type/isEmpty.ts:30:25
  * @since 2.0.0
  */
 export function isEmpty(value: unknown): boolean {
-  if (value === null || value === undefined) {
+  if (value === null || false) {
     return true;
   }
killedBy: isEmpty should treat null and undefined as empty
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:30:7
  * @since 2.0.0
  */
 export function isEmpty(value: unknown): boolean {
-  if (value === null || value === undefined) {
+  if (true) {
     return true;
   }
killedBy: isEmpty should handle strings
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/type/isEmpty.ts:31:12
  */
 export function isEmpty(value: unknown): boolean {
   if (value === null || value === undefined) {
-    return true;
+    return false;
   }
 
killedBy: isEmpty should treat null and undefined as empty
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isEmpty.ts:34:34
     return true;
   }
 
-  if (typeof value === 'string') {
-    return value.length === 0;
-  }
+  if (typeof value === 'string') {}
 
   if (Array.isArray(value)) {
killedBy: isEmpty should handle strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:34:7
     return true;
   }
 
-  if (typeof value === 'string') {
+  if (false) {
     return value.length === 0;
   }
killedBy: isEmpty should handle strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:35:12
   }
 
   if (typeof value === 'string') {
-    return value.length === 0;
+    return true;
   }
 
killedBy: isEmpty should handle strings
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:35:12
   }
 
   if (typeof value === 'string') {
-    return value.length === 0;
+    return false;
   }
 
killedBy: isEmpty should handle strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:38:7
     return value.length === 0;
   }
 
-  if (Array.isArray(value)) {
+  if (false) {
     return value.length === 0;
   }
killedBy: isEmpty should handle arrays
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:39:12
   }
 
   if (Array.isArray(value)) {
-    return value.length === 0;
+    return false;
   }
 
killedBy: isEmpty should handle arrays
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:39:12
   }
 
   if (Array.isArray(value)) {
-    return value.length === 0;
+    return true;
   }
 
killedBy: isEmpty should handle arrays
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/type/isEmpty.ts:42:7
     return value.length === 0;
   }
 
-  if (value instanceof Map || value instanceof Set) {
+  if (value instanceof Map && value instanceof Set) {
     return value.size === 0;
   }
killedBy: isEmpty should handle Map and Set
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:42:7
     return value.length === 0;
   }
 
-  if (value instanceof Map || value instanceof Set) {
+  if (false) {
     return value.size === 0;
   }
killedBy: isEmpty should handle Map and Set
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:43:12
   }
 
   if (value instanceof Map || value instanceof Set) {
-    return value.size === 0;
+    return false;
   }
 
killedBy: isEmpty should handle Map and Set
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isEmpty.ts:43:12
   }
 
   if (value instanceof Map || value instanceof Set) {
-    return value.size === 0;
+    return value.size !== 0;
   }
 
killedBy: isEmpty should handle Map and Set
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isEmpty.ts:46:7
     return value.size === 0;
   }
 
-  if (typeof value === 'object') {
+  if (typeof value !== 'object') {
     if (isSpecialObject(value)) {
       return false;
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isEmpty.ts:46:34
     return value.size === 0;
   }
 
-  if (typeof value === 'object') {
-    if (isSpecialObject(value)) {
-      return false;
-    }
-
-    const proto = Object.getPrototypeOf(value);
-    if (proto !== Object.prototype && proto !== null) {
-      return false;
-    }
-
-    return Object.keys(value as Record<string, unknown>).length === 0;
-  }
+  if (typeof value === 'object') {}
 
   return false;
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:47:9
   }
 
   if (typeof value === 'object') {
-    if (isSpecialObject(value)) {
+    if (true) {
       return false;
     }
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
helpers/type/isEmpty.ts:47:33
   }
 
   if (typeof value === 'object') {
-    if (isSpecialObject(value)) {
-      return false;
-    }
+    if (isSpecialObject(value)) {}
 
     const proto = Object.getPrototypeOf(value);

[Killed] BooleanLiteral
helpers/type/isEmpty.ts:48:14
 
   if (typeof value === 'object') {
     if (isSpecialObject(value)) {
-      return false;
+      return true;
     }
 
killedBy: isEmpty should return false for special objects
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/type/isEmpty.ts:52:55
     }
 
     const proto = Object.getPrototypeOf(value);
-    if (proto !== Object.prototype && proto !== null) {
-      return false;
-    }
+    if (proto !== Object.prototype && proto !== null) {}
 
     return Object.keys(value as Record<string, unknown>).length === 0;
killedBy: isEmpty should return false for special objects
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isEmpty.ts:52:9
     }
 
     const proto = Object.getPrototypeOf(value);
-    if (proto !== Object.prototype && proto !== null) {
+    if (proto === Object.prototype && proto !== null) {
       return false;
     }
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/type/isEmpty.ts:53:14
 
     const proto = Object.getPrototypeOf(value);
     if (proto !== Object.prototype && proto !== null) {
-      return false;
+      return true;
     }
 
killedBy: isEmpty should return false for special objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:56:12
       return false;
     }
 
-    return Object.keys(value as Record<string, unknown>).length === 0;
+    return true;
   }
 
killedBy: isEmpty should handle plain objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isEmpty.ts:56:12
       return false;
     }
 
-    return Object.keys(value as Record<string, unknown>).length === 0;
+    return false;
   }
 
killedBy: isEmpty should handle plain objects
statusReason: expected false to be true // Object.is equality
