[Killed] BlockStatement
helpers/type/isError.ts:17:57
  * isError({ message: 'fake' })  // => false
  * @since 2.0.0
  */
-export function isError(value: unknown): value is Error {
-  return value instanceof Error;
-}
+export function isError(value: unknown): value is Error {}
 
killedBy: isError — property-based Error instances always have a .message property
statusReason: Property failed after 1 tests
{ seed: -1833405607, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
