[Killed] BlockStatement
helpers/type/isFalsy.ts:28:57
  * @see {@link isNullish} to check specifically for `null` or `undefined`
  * @since 2.0.0
  */
-export function isFalsy(value: unknown): value is Falsy {
-  return !value;
-}
+export function isFalsy(value: unknown): value is Falsy {}
 
killedBy: compact — property-based result contains only truthy values
statusReason: Property failed after 1 tests
{ seed: 656744354, path: "0:1:0", endOnFailure: true }
Counterexample: [[undefined]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/type/isFalsy.ts:29:10
  * @since 2.0.0
  */
 export function isFalsy(value: unknown): value is Falsy {
-  return !value;
+  return value;
 }
 
killedBy: compact — property-based result contains only truthy values
statusReason: Property failed after 1 tests
{ seed: 517307497, path: "0:1:0:0", endOnFailure: true }
Counterexample: [[null]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
