[Killed] BlockStatement
helpers/type/isFormData.ts:21:63
  * isFormData(null)           // => false
  * @since next
  */
-export function isFormData(value: unknown): value is FormData {
-  return typeof FormData !== 'undefined' && value instanceof FormData;
-}
+export function isFormData(value: unknown): value is FormData {}
 
killedBy: isFormData — property-based primitives never return true
statusReason: Property failed after 1 tests
{ seed: 387237083, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isFormData.ts:22:10
  * @since next
  */
 export function isFormData(value: unknown): value is FormData {
-  return typeof FormData !== 'undefined' && value instanceof FormData;
+  return true;
 }
 
killedBy: isFormData — property-based primitives never return true
statusReason: Property failed after 1 tests
{ seed: 981246559, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isFormData.ts:22:10
  * @since next
  */
 export function isFormData(value: unknown): value is FormData {
-  return typeof FormData !== 'undefined' && value instanceof FormData;
+  return typeof FormData === 'undefined' && value instanceof FormData;
 }
 
killedBy: isFormData — contract new FormData() → true
statusReason: expected false to be true // Object.is equality
