[Killed] BlockStatement
helpers/type/isIterable.ts:24:72
  * isIterable(42)             // => false
  * @since 2.0.0
  */
-export function isIterable(value: unknown): value is Iterable<unknown> {
-  if (value === null || value === undefined) return false;
-  return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
-}
+export function isIterable(value: unknown): value is Iterable<unknown> {}
 
killedBy: isIterable — property-based arrays are always iterable
statusReason: Property failed after 1 tests
{ seed: -883670520, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isIterable.ts:25:7
  * @since 2.0.0
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (false) return false;
   return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
 }
killedBy: isIterable — contract null → false
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
helpers/type/isIterable.ts:25:7
  * @since 2.0.0
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
-  if (value === null || value === undefined) return false;
+  if (false || value === undefined) return false;
   return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
 }
killedBy: isIterable — contract null → false
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
helpers/type/isIterable.ts:26:10
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
   if (value === null || value === undefined) return false;
-  return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
+  return false;
 }
 
killedBy: isIterable — property-based arrays are always iterable
statusReason: Property failed after 1 tests
{ seed: -1145669279, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isIterable.ts:26:10
  */
 export function isIterable(value: unknown): value is Iterable<unknown> {
   if (value === null || value === undefined) return false;
-  return typeof (value as Iterable<unknown>)[Symbol.iterator] === 'function';
+  return typeof (value as Iterable<unknown>)[Symbol.iterator] !== 'function';
 }
 
killedBy: isIterable — property-based arrays are always iterable
statusReason: Property failed after 1 tests
{ seed: -1304722509, path: "0:0", endOnFailure: true }
Counterexample: [[]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
