[Killed] BlockStatement
helpers/type/isMap.ts:17:71
  * isMap({})                  // => false
  * @since 2.0.0
  */
-export function isMap(value: unknown): value is Map<unknown, unknown> {
-  return value instanceof Map;
-}
+export function isMap(value: unknown): value is Map<unknown, unknown> {}
 
killedBy: isMap — property-based Map instances always pass and have .get and .set
statusReason: Property failed after 1 tests
{ seed: 1488535154, path: "0", endOnFailure: true }
Counterexample: [[]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
