[Killed] BlockStatement
helpers/type/isNegativeNumber.ts:22:67
  * isNegativeNumber(NaN)  // => false
  * @since 2.0.0
  */
-export function isNegativeNumber(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
-}
+export function isNegativeNumber(value: unknown): value is number {}
 
killedBy: isNegativeNumber — property-based isNegativeNumber(v) → isNumber(v)
statusReason: Property failed after 1 tests
{ seed: 280588999, path: "0:0", endOnFailure: true }
Counterexample: [-2.220446049250313e-16]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isNegativeNumber.ts:23:39
  * @since 2.0.0
  */
 export function isNegativeNumber(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
+  return typeof value === 'number' && true;
 }
 
killedBy: isNegativeNumber — contract 0 → false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isNegativeNumber.ts:23:39
  * @since 2.0.0
  */
 export function isNegativeNumber(value: unknown): value is number {
-  return typeof value === 'number' && value < 0;
+  return typeof value === 'number' && value >= 0;
 }
 
killedBy: isNegativeNumber — property-based isNegativeNumber(v) → isNumber(v)
statusReason: Property failed after 1 tests
{ seed: 1260635720, path: "0:0", endOnFailure: true }
Counterexample: [-2.220446049250313e-16]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
