[Killed] BlockStatement
helpers/type/isNonEmptyArray.ts:18:83
  * isNonEmptyArray(null)   // => false
  * @since 2.0.0
  */
-export function isNonEmptyArray(value: unknown): value is [unknown, ...unknown[]] {
-  return Array.isArray(value) && value.length > 0;
-}
+export function isNonEmptyArray(value: unknown): value is [unknown, ...unknown[]] {}
 
killedBy: isNonEmptyArray — property-based isNonEmptyArray(v) → isArray(v)
statusReason: Property failed after 1 tests
{ seed: -368942360, path: "0:0:0", endOnFailure: true }
Counterexample: [[{}]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isNonEmptyArray.ts:19:34
  * @since 2.0.0
  */
 export function isNonEmptyArray(value: unknown): value is [unknown, ...unknown[]] {
-  return Array.isArray(value) && value.length > 0;
+  return Array.isArray(value) && value.length >= 0;
 }
 
killedBy: isNonEmptyArray — contract [] → false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isNonEmptyArray.ts:19:34
  * @since 2.0.0
  */
 export function isNonEmptyArray(value: unknown): value is [unknown, ...unknown[]] {
-  return Array.isArray(value) && value.length > 0;
+  return Array.isArray(value) && true;
 }
 
killedBy: isNonEmptyArray — contract [] → false
statusReason: expected true to be false // Object.is equality
