[Killed] BlockStatement
helpers/type/isNonEmptyString.ts:18:67
  * isNonEmptyString(null)    // => false
  * @since 2.0.0
  */
-export function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.length > 0;
-}
+export function isNonEmptyString(value: unknown): value is string {}
 
killedBy: isNonEmptyString — property-based isNonEmptyString(v) → isString(v)
statusReason: Property failed after 1 tests
{ seed: -66243387, path: "0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/type/isNonEmptyString.ts:19:10
  * @since 2.0.0
  */
 export function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.length > 0;
+  return typeof value === 'string' || value.length > 0;
 }
 
killedBy: isNonEmptyString — contract '' → false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isNonEmptyString.ts:19:39
  * @since 2.0.0
  */
 export function isNonEmptyString(value: unknown): value is string {
-  return typeof value === 'string' && value.length > 0;
+  return typeof value === 'string' && true;
 }
 
killedBy: isNonEmptyString — contract '' → false
statusReason: expected true to be false // Object.is equality
