[Killed] BlockStatement
helpers/type/isNullish.ts:21:70
  * @see {@link isFalsy} to also catch `0`, `""`, `false`, and `NaN`
  * @since 2.0.0
  */
-export function isNullish(value: unknown): value is null | undefined {
-  return value === null || value === undefined;
-}
+export function isNullish(value: unknown): value is null | undefined {}
 
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: -1887370399, path: "0", endOnFailure: true }
Counterexample: [{"a":undefined,"b":null,"c":null}]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isNullish.ts:22:10
  * @since 2.0.0
  */
 export function isNullish(value: unknown): value is null | undefined {
-  return value === null || value === undefined;
+  return true;
 }
 
killedBy: removeUndefinedNull — property-based all non-null/non-undefined values from input are preserved
statusReason: Property failed after 1 tests
{ seed: -1846439729, path: "0:0:0", endOnFailure: true }
Counterexample: [{"a":0,"b":"","c":false}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isNullish.ts:22:10
  * @since 2.0.0
  */
 export function isNullish(value: unknown): value is null | undefined {
-  return value === null || value === undefined;
+  return value !== null || value === undefined;
 }
 
killedBy: removeUndefinedNull — property-based no null or undefined values in result
statusReason: Property failed after 1 tests
{ seed: -1396672104, path: "0:0", endOnFailure: true }
Counterexample: [{"a":undefined,"b":undefined,"c":null}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
