[Killed] BlockStatement
helpers/type/isNumber.ts:22:59
  * isNumber('123') // => false
  * @since 1.9.0
  */
-export function isNumber(value: unknown): value is number {
-  return typeof value === 'number' && !Number.isNaN(value);
-}
+export function isNumber(value: unknown): value is number {}
 
killedBy: isTimestamp — property-based isTimestamp(v) → isNumber(v)
statusReason: Property failed after 1 tests
{ seed: -1919934951, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isNumber.ts:23:10
  * @since 1.9.0
  */
 export function isNumber(value: unknown): value is number {
-  return typeof value === 'number' && !Number.isNaN(value);
+  return false;
 }
 
killedBy: isTimestamp — property-based isTimestamp(v) → isNumber(v)
statusReason: Property failed after 1 tests
{ seed: -1581927845, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/type/isNumber.ts:23:10
  * @since 1.9.0
  */
 export function isNumber(value: unknown): value is number {
-  return typeof value === 'number' && !Number.isNaN(value);
+  return typeof value === 'number' || !Number.isNaN(value);
 }
 
killedBy: isNumber — property-based NaN always fails
statusReason: expected true to be false // Object.is equality
