[Killed] BlockStatement
helpers/type/isPositiveNumber.ts:22:67
  * isPositiveNumber(NaN)  // => false
  * @since 2.0.0
  */
-export function isPositiveNumber(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
-}
+export function isPositiveNumber(value: unknown): value is number {}
 
killedBy: isNegativeNumber — property-based isNegativeNumber(v) → !isPositiveNumber(v)
statusReason: Property failed after 1 tests
{ seed: -1333195593, path: "0:0", endOnFailure: true }
Counterexample: [-2.220446049250313e-16]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isPositiveNumber.ts:23:10
  * @since 2.0.0
  */
 export function isPositiveNumber(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
+  return false;
 }
 
killedBy: isPositiveNumber — property-based isPositiveNumber(v) → isNumber(v)
statusReason: Property failed after 1 tests
{ seed: 1947930181, path: "0:0", endOnFailure: true }
Counterexample: [2.220446049250313e-16]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isPositiveNumber.ts:23:39
  * @since 2.0.0
  */
 export function isPositiveNumber(value: unknown): value is number {
-  return typeof value === 'number' && value > 0;
+  return typeof value === 'number' && value >= 0;
 }
 
killedBy: isPositiveNumber — contract 0 → false
statusReason: expected true to be false // Object.is equality
