[Killed] BlockStatement
helpers/type/isPrimitive.ts:28:65
  * isPrimitive([])       // => false
  * @since 2.0.0
  */
-export function isPrimitive(value: unknown): value is Primitive {
-  return value === null || (typeof value !== 'object' && typeof value !== 'function');
-}
+export function isPrimitive(value: unknown): value is Primitive {}
 
killedBy: isPrimitive — property-based isPrimitive(v) → !isPlainObject(v)
statusReason: Property failed after 1 tests
{ seed: 992983312, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isPrimitive.ts:29:29
  * @since 2.0.0
  */
 export function isPrimitive(value: unknown): value is Primitive {
-  return value === null || (typeof value !== 'object' && typeof value !== 'function');
+  return value === null || (typeof value === 'object' && typeof value !== 'function');
 }
 
killedBy: isPrimitive — property-based isPrimitive(v) → !isPlainObject(v)
statusReason: Property failed after 2 tests
{ seed: 1418093931, path: "1", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isPrimitive.ts:29:10
  * @since 2.0.0
  */
 export function isPrimitive(value: unknown): value is Primitive {
-  return value === null || (typeof value !== 'object' && typeof value !== 'function');
+  return false || (typeof value !== 'object' && typeof value !== 'function');
 }
 
killedBy: isPrimitive — property-based isPrimitive(v) → !isPlainObject(v)
statusReason: Property failed after 3 tests
{ seed: -1078706704, path: "2", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
