[Killed] BlockStatement
helpers/type/isPromise.ts:22:74
  * isPromise(42)                      // => false
  * @since 2.0.0
  */
-export function isPromise(value: unknown): value is PromiseLike<unknown> {
-  return (
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as PromiseLike<unknown>).then === 'function' &&
-    typeof (value as Record<string, unknown>).catch === 'function'
-  );
-}
+export function isPromise(value: unknown): value is PromiseLike<unknown> {}
 
killedBy: isPromise — property-based isPromise(v) → v has .then and .catch as functions
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isPromise.ts:24:5
  */
 export function isPromise(value: unknown): value is PromiseLike<unknown> {
   return (
-    value !== null &&
+    value === null &&
     typeof value === 'object' &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
killedBy: isPromise — property-based isPromise(v) → v has .then and .catch as functions
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/type/isPromise.ts:24:5
  */
 export function isPromise(value: unknown): value is PromiseLike<unknown> {
   return (
-    value !== null &&
-    typeof value === 'object' &&
-    typeof (value as PromiseLike<unknown>).then === 'function' &&
+    value !== null && typeof value === 'object' || typeof (value as PromiseLike<unknown>).then === 'function' &&
     typeof (value as Record<string, unknown>).catch === 'function'
   );
killedBy: isPromise — property-based primitives are never promises
statusReason: Property failed after 1 tests
{ seed: -2024703475, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isPromise.ts:25:5
 export function isPromise(value: unknown): value is PromiseLike<unknown> {
   return (
     value !== null &&
-    typeof value === 'object' &&
+    true &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
     typeof (value as Record<string, unknown>).catch === 'function'
killedBy: isPromise — property-based primitives are never promises
statusReason: Property failed after 1 tests
{ seed: -582206466, path: "0", endOnFailure: true }
Counterexample: [undefined]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isPromise.ts:25:5
 export function isPromise(value: unknown): value is PromiseLike<unknown> {
   return (
     value !== null &&
-    typeof value === 'object' &&
+    typeof value !== 'object' &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
     typeof (value as Record<string, unknown>).catch === 'function'
killedBy: isPromise — property-based isPromise(v) → v has .then and .catch as functions
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isPromise.ts:26:5
   return (
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as PromiseLike<unknown>).then === 'function' &&
+    typeof (value as PromiseLike<unknown>).then !== 'function' &&
     typeof (value as Record<string, unknown>).catch === 'function'
   );
killedBy: isPromise — property-based isPromise(v) → v has .then and .catch as functions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isPromise.ts:26:5
   return (
     value !== null &&
     typeof value === 'object' &&
-    typeof (value as PromiseLike<unknown>).then === 'function' &&
+    true &&
     typeof (value as Record<string, unknown>).catch === 'function'
   );
killedBy: isPromise should return false for partial thenables
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isPromise.ts:27:5
     value !== null &&
     typeof value === 'object' &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
-    typeof (value as Record<string, unknown>).catch === 'function'
+    typeof (value as Record<string, unknown>).catch !== 'function'
   );
 }
killedBy: isPromise — property-based isPromise(v) → v has .then and .catch as functions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isPromise.ts:27:5
     value !== null &&
     typeof value === 'object' &&
     typeof (value as PromiseLike<unknown>).then === 'function' &&
-    typeof (value as Record<string, unknown>).catch === 'function'
+    true
   );
 }
killedBy: isPromise — contract {then:()=>{}} → false (no catch)
statusReason: expected true to be false // Object.is equality
