[Killed] BlockStatement
helpers/type/isRegExp.ts:17:59
  * isRegExp('abc')          // => false
  * @since 2.0.0
  */
-export function isRegExp(value: unknown): value is RegExp {
-  return value instanceof RegExp;
-}
+export function isRegExp(value: unknown): value is RegExp {}
 
killedBy: isRegExp — property-based primitives are never regexes
statusReason: Property failed after 1 tests
{ seed: -1732734116, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
