[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:16:7
  * @since 2.0.0
  */
 export function isSpecialObject(value: unknown): boolean {
-  if (value === null || value === undefined) {
+  if (true) {
     return false;
   }
killedBy: diff should handle special objects by reference only
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:16:7
  * @since 2.0.0
  */
 export function isSpecialObject(value: unknown): boolean {
-  if (value === null || value === undefined) {
+  if (false) {
     return false;
   }
killedBy: isSpecialObject should return false for primitives
statusReason: Cannot read properties of null (reading 'constructor')

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:17:12
  */
 export function isSpecialObject(value: unknown): boolean {
   if (value === null || value === undefined) {
-    return false;
+    return true;
   }
 
killedBy: isSpecialObject should return false for primitives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:21:7
   }
 
   // Functions are special objects
-  if (typeof value === 'function') {
+  if (true) {
     return true;
   }
killedBy: isSpecialObject should return false for primitives
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/type/isSpecialObject.ts:21:36
   }
 
   // Functions are special objects
-  if (typeof value === 'function') {
-    return true;
-  }
+  if (typeof value === 'function') {}
 
   // Non-objects are not special
killedBy: diff should handle special objects by reference only
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:22:12
 
   // Functions are special objects
   if (typeof value === 'function') {
-    return true;
+    return false;
   }
 
killedBy: isSpecialObject should return true for Functions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isSpecialObject.ts:26:34
   }
 
   // Non-objects are not special
-  if (typeof value !== 'object') {
-    return false;
-  }
+  if (typeof value !== 'object') {}
 
   // Arrays are not considered special objects for our purposes
killedBy: isSpecialObject should return false for primitives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:26:7
   }
 
   // Non-objects are not special
-  if (typeof value !== 'object') {
+  if (false) {
     return false;
   }
killedBy: isSpecialObject should return false for primitives
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:27:12
 
   // Non-objects are not special
   if (typeof value !== 'object') {
-    return false;
+    return true;
   }
 
killedBy: isSpecialObject should return false for primitives
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:31:7
   }
 
   // Arrays are not considered special objects for our purposes
-  if (Array.isArray(value)) {
+  if (true) {
     return false;
   }
killedBy: isSpecialObject — contract new Date() → true
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
helpers/type/isSpecialObject.ts:31:7
   }
 
   // Arrays are not considered special objects for our purposes
-  if (Array.isArray(value)) {
+  if (false) {
     return false;
   }

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:32:12
 
   // Arrays are not considered special objects for our purposes
   if (Array.isArray(value)) {
-    return false;
+    return true;
   }
 
killedBy: isSpecialObject should return false for arrays
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/type/isSpecialObject.ts:37:5
 
   // Check for built-in special objects
   if (
-    value instanceof Date ||
-    value instanceof Promise ||
-    value instanceof RegExp ||
-    value instanceof Error ||
-    value instanceof Map ||
+    (value instanceof Date || value instanceof Promise || value instanceof RegExp || value instanceof Error) && value instanceof Map ||
     value instanceof Set ||
     value instanceof WeakMap ||
killedBy: isSpecialObject should return true for Date objects
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/type/isSpecialObject.ts:37:5
 
   // Check for built-in special objects
   if (
-    value instanceof Date ||
-    value instanceof Promise ||
-    value instanceof RegExp ||
-    value instanceof Error ||
+    (value instanceof Date || value instanceof Promise || value instanceof RegExp) && value instanceof Error ||
     value instanceof Map ||
     value instanceof Set ||
killedBy: diff should handle special objects by reference only
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/type/isSpecialObject.ts:47:5
     value instanceof WeakSet ||
     value instanceof ArrayBuffer ||
     value instanceof DataView
-  ) {
-    return true;
-  }
+  ) {}
 
   // Check for Observable (RxJS or similar)
killedBy: isSpecialObject — contract new Date() → true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isSpecialObject.ts:52:49
   }
 
   // Check for Observable (RxJS or similar)
-  if (value.constructor?.name === 'Observable') {
-    return true;
-  }
+  if (value.constructor?.name === 'Observable') {}
 
   // Check for DOM elements (if in browser environment)
killedBy: isSpecialObject should return true for Observable-like objects
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isSpecialObject.ts:52:7
   }
 
   // Check for Observable (RxJS or similar)
-  if (value.constructor?.name === 'Observable') {
+  if (value.constructor?.name !== 'Observable') {
     return true;
   }
killedBy: isSpecialObject — property-based plain objects are never special
statusReason: Property failed after 1 tests
{ seed: 1539736985, path: "0", endOnFailure: true }
Counterexample: [{}]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:53:12
 
   // Check for Observable (RxJS or similar)
   if (value.constructor?.name === 'Observable') {
-    return true;
+    return false;
   }
 
killedBy: isSpecialObject should return true for Observable-like objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:57:7
   }
 
   // Check for DOM elements (if in browser environment)
-  if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {
+  if (true) {
     return true;
   }
killedBy: isSpecialObject — property-based plain objects are never special
statusReason: Property failed after 1 tests
{ seed: 1412260205, path: "0:0", endOnFailure: true }
Counterexample: [{}]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/type/isSpecialObject.ts:57:7
   }
 
   // Check for DOM elements (if in browser environment)
-  if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {
+  if (typeof HTMLElement !== 'undefined' || value instanceof HTMLElement) {
     return true;
   }
killedBy: isSpecialObject should return false for plain objects
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:58:12
 
   // Check for DOM elements (if in browser environment)
   if (typeof HTMLElement !== 'undefined' && value instanceof HTMLElement) {
-    return true;
+    return false;
   }
 
killedBy: isSpecialObject should return true for HTMLElement in browser
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
helpers/type/isSpecialObject.ts:62:27
   }
 
   // Check for other built-in types by constructor name
-  const constructorName = value.constructor?.name;
+  const constructorName = value.constructor.name;
   if (constructorName && [
     'Buffer',       // Node.js Buffer
killedBy: isSpecialObject should return false for plain objects
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
helpers/type/isSpecialObject.ts:63:7
 
   // Check for other built-in types by constructor name
   const constructorName = value.constructor?.name;
-  if (constructorName && [
-    'Buffer',       // Node.js Buffer
-    'URL',          // Web URL API
-    'URLSearchParams',
-    'File',         // Web File API
-    'Blob',         // Web Blob API
-    'FormData',     // Web FormData API
-    'Headers',      // Web Headers API
-    'Request',      // Web Request API
-    'Response',     // Web Response API
-    'EventTarget',  // Web EventTarget API
-    'Symbol'        // Symbol objects
-  ].includes(constructorName)) {
+  if (true) {
     return true;
   }
killedBy: isSpecialObject should return false for plain objects
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/type/isSpecialObject.ts:63:7
 
   // Check for other built-in types by constructor name
   const constructorName = value.constructor?.name;
-  if (constructorName && [
-    'Buffer',       // Node.js Buffer
-    'URL',          // Web URL API
-    'URLSearchParams',
-    'File',         // Web File API
-    'Blob',         // Web Blob API
-    'FormData',     // Web FormData API
-    'Headers',      // Web Headers API
-    'Request',      // Web Request API
-    'Response',     // Web Response API
-    'EventTarget',  // Web EventTarget API
-    'Symbol'        // Symbol objects
-  ].includes(constructorName)) {
+  if (constructorName || ['Buffer',
+// Node.js Buffer
+'URL',
+// Web URL API
+'URLSearchParams', 'File',
+// Web File API
+'Blob',
+// Web Blob API
+'FormData',
+// Web FormData API
+'Headers',
+// Web Headers API
+'Request',
+// Web Request API
+'Response',
+// Web Response API
+'EventTarget',
+// Web EventTarget API
+'Symbol' // Symbol objects
+].includes(constructorName)) {
     return true;
   }
killedBy: isSpecialObject should return false for plain objects
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
helpers/type/isSpecialObject.ts:68:5
     'URL',          // Web URL API
     'URLSearchParams',
     'File',         // Web File API
-    'Blob',         // Web Blob API
+    "",         // Web Blob API
     'FormData',     // Web FormData API
     'Headers',      // Web Headers API
killedBy: isSpecialObject should return true for objects with matching Web API constructor names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/type/isSpecialObject.ts:70:5
     'File',         // Web File API
     'Blob',         // Web Blob API
     'FormData',     // Web FormData API
-    'Headers',      // Web Headers API
+    "",      // Web Headers API
     'Request',      // Web Request API
     'Response',     // Web Response API
killedBy: isSpecialObject should return true for objects with matching Web API constructor names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/type/isSpecialObject.ts:72:5
     'FormData',     // Web FormData API
     'Headers',      // Web Headers API
     'Request',      // Web Request API
-    'Response',     // Web Response API
+    "",     // Web Response API
     'EventTarget',  // Web EventTarget API
     'Symbol'        // Symbol objects
killedBy: isSpecialObject should return true for objects with matching Web API constructor names
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/type/isSpecialObject.ts:74:5
     'Request',      // Web Request API
     'Response',     // Web Response API
     'EventTarget',  // Web EventTarget API
-    'Symbol'        // Symbol objects
+    ""        // Symbol objects
   ].includes(constructorName)) {
     return true;
killedBy: isSpecialObject should return true for objects with matching Web API constructor names
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/type/isSpecialObject.ts:75:32
     'Response',     // Web Response API
     'EventTarget',  // Web EventTarget API
     'Symbol'        // Symbol objects
-  ].includes(constructorName)) {
-    return true;
-  }
+  ].includes(constructorName)) {}
 
   return false;
killedBy: isSpecialObject should return true for URL objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
helpers/type/isSpecialObject.ts:76:12
     'EventTarget',  // Web EventTarget API
     'Symbol'        // Symbol objects
   ].includes(constructorName)) {
-    return true;
+    return false;
   }
 
killedBy: isSpecialObject should return true for URL objects
statusReason: expected false to be true // Object.is equality
