[Killed] BlockStatement
helpers/type/isString.ts:16:59
  * isString(123)     // => false
  * @since 1.9.0
  */
-export function isString(value: unknown): value is string {
-  return typeof value === 'string';
-}
+export function isString(value: unknown): value is string {}
 
killedBy: isNonEmptyString — property-based isNonEmptyString(v) → isString(v)
statusReason: Property failed after 1 tests
{ seed: -1149736714, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isString.ts:17:10
  * @since 1.9.0
  */
 export function isString(value: unknown): value is string {
-  return typeof value === 'string';
+  return typeof value !== 'string';
 }
 
killedBy: isNonEmptyString — property-based isNonEmptyString(v) → isString(v)
statusReason: Property failed after 1 tests
{ seed: 2135111108, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isString.ts:17:10
  * @since 1.9.0
  */
 export function isString(value: unknown): value is string {
-  return typeof value === 'string';
+  return false;
 }
 
killedBy: isNonEmptyString — property-based isNonEmptyString(v) → isString(v)
statusReason: Property failed after 1 tests
{ seed: -498911295, path: "0:0:0", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
