[Killed] BlockStatement
helpers/type/isSymbol.ts:17:59
  * isSymbol('symbol')       // => false
  * @since 2.0.0
  */
-export function isSymbol(value: unknown): value is symbol {
-  return typeof value === 'symbol';
-}
+export function isSymbol(value: unknown): value is symbol {}
 
killedBy: isSymbol — property-based isSymbol(v) → isPrimitive(v)
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isSymbol.ts:18:10
  * @since 2.0.0
  */
 export function isSymbol(value: unknown): value is symbol {
-  return typeof value === 'symbol';
+  return true;
 }
 
killedBy: isSymbol — property-based strings are never symbols
statusReason: Property failed after 1 tests
{ seed: -1903957730, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/type/isSymbol.ts:18:10
  * @since 2.0.0
  */
 export function isSymbol(value: unknown): value is symbol {
-  return typeof value === 'symbol';
+  return typeof value !== 'symbol';
 }
 
killedBy: isSymbol — property-based isSymbol(v) → isPrimitive(v)
statusReason: expected false to be true // Object.is equality
