[Killed] BlockStatement
helpers/type/isTemporalInstant.ts:21:78
  * isTemporalInstant(new Date())                   // => false
  * @since 2.0.0
  */
-export function isTemporalInstant(value: unknown): value is Temporal.Instant {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.Instant;
-  }
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Instant'
-  );
-}
+export function isTemporalInstant(value: unknown): value is Temporal.Instant {}
 
killedBy: isTemporalInstant should return true for a Temporal.Instant
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isTemporalInstant.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalInstant(value: unknown): value is Temporal.Instant {
-  if (typeof Temporal !== 'undefined') {
+  if (typeof Temporal === 'undefined') {
     return value instanceof Temporal.Instant;
   }
killedBy: isTemporalInstant — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'Instant')

[Killed] ConditionalExpression
helpers/type/isTemporalInstant.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalInstant(value: unknown): value is Temporal.Instant {
-  if (typeof Temporal !== 'undefined') {
+  if (true) {
     return value instanceof Temporal.Instant;
   }
killedBy: isTemporalInstant — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'Instant')

[Killed] ConditionalExpression
helpers/type/isTemporalInstant.ts:26:5
     return value instanceof Temporal.Instant;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Instant'
+    true
   );
 }
killedBy: isTemporalInstant — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalInstant.ts:26:5
     return value instanceof Temporal.Instant;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
+    true &&
     (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Instant'
   );
killedBy: isTemporalInstant — fallback without Temporal should return false for non-objects
statusReason: Cannot read properties of null (reading 'Symbol(Symbol.toStringTag)')

[Killed] EqualityOperator
helpers/type/isTemporalInstant.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Instant'
+    (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] !== 'Temporal.Instant'
   );
 }
killedBy: isTemporalInstant — fallback without Temporal should return true for an object with matching toStringTag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalInstant.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.Instant'
+    true
   );
 }
killedBy: isTemporalInstant — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality
