[Killed] BlockStatement
helpers/type/isTemporalPlainDate.ts:21:82
  * isTemporalPlainDate(new Date())                             // => false
  * @since 2.0.0
  */
-export function isTemporalPlainDate(value: unknown): value is Temporal.PlainDate {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.PlainDate;
-  }
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDate'
-  );
-}
+export function isTemporalPlainDate(value: unknown): value is Temporal.PlainDate {}
 
killedBy: isTemporalPlainDate should return true for a Temporal.PlainDate
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainDate.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainDate(value: unknown): value is Temporal.PlainDate {
-  if (typeof Temporal !== 'undefined') {
+  if (true) {
     return value instanceof Temporal.PlainDate;
   }
killedBy: isTemporalPlainDate — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainDate')

[Killed] EqualityOperator
helpers/type/isTemporalPlainDate.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainDate(value: unknown): value is Temporal.PlainDate {
-  if (typeof Temporal !== 'undefined') {
+  if (typeof Temporal === 'undefined') {
     return value instanceof Temporal.PlainDate;
   }
killedBy: isTemporalPlainDate — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainDate')

[Killed] LogicalOperator
helpers/type/isTemporalPlainDate.ts:26:5
     return value instanceof Temporal.PlainDate;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDate'
+    typeof value === 'object' && value !== null || (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] === 'Temporal.PlainDate'
   );
 }
killedBy: isTemporalPlainDate — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
helpers/type/isTemporalPlainDate.ts:26:5
     return value instanceof Temporal.PlainDate;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
+    typeof value === 'object' || value !== null &&
     (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDate'
   );
killedBy: isTemporalPlainDate — fallback without Temporal should return false for non-objects
statusReason: Cannot read properties of null (reading 'Symbol(Symbol.toStringTag)')

[Killed] EqualityOperator
helpers/type/isTemporalPlainDate.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDate'
+    (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] !== 'Temporal.PlainDate'
   );
 }
killedBy: isTemporalPlainDate — fallback without Temporal should return true for an object with matching toStringTag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainDate.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDate'
+    true
   );
 }
killedBy: isTemporalPlainDate — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality
