[Killed] BlockStatement
helpers/type/isTemporalPlainDateTime.ts:21:90
  * isTemporalPlainDateTime(new Date())                                       // => false
  * @since 2.0.0
  */
-export function isTemporalPlainDateTime(value: unknown): value is Temporal.PlainDateTime {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.PlainDateTime;
-  }
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
-  );
-}
+export function isTemporalPlainDateTime(value: unknown): value is Temporal.PlainDateTime {}
 
killedBy: isTemporalPlainDateTime should return true for a Temporal.PlainDateTime
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainDateTime.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainDateTime(value: unknown): value is Temporal.PlainDateTime {
-  if (typeof Temporal !== 'undefined') {
+  if (true) {
     return value instanceof Temporal.PlainDateTime;
   }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainDateTime')

[Killed] EqualityOperator
helpers/type/isTemporalPlainDateTime.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainDateTime(value: unknown): value is Temporal.PlainDateTime {
-  if (typeof Temporal !== 'undefined') {
+  if (typeof Temporal === 'undefined') {
     return value instanceof Temporal.PlainDateTime;
   }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainDateTime')

[Killed] ConditionalExpression
helpers/type/isTemporalPlainDateTime.ts:26:5
     return value instanceof Temporal.PlainDateTime;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
+    false
   );
 }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/type/isTemporalPlainDateTime.ts:26:5
     return value instanceof Temporal.PlainDateTime;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
+    typeof value === 'object' && value !== null || (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] === 'Temporal.PlainDateTime'
   );
 }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isTemporalPlainDateTime.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
+    (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] !== 'Temporal.PlainDateTime'
   );
 }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainDateTime.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainDateTime'
+    true
   );
 }
killedBy: isTemporalPlainDateTime — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality
