[Killed] BlockStatement
helpers/type/isTemporalPlainTime.ts:21:82
  * isTemporalPlainTime(new Date())                           // => false
  * @since 2.0.0
  */
-export function isTemporalPlainTime(value: unknown): value is Temporal.PlainTime {
-  if (typeof Temporal !== 'undefined') {
-    return value instanceof Temporal.PlainTime;
-  }
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainTime'
-  );
-}
+export function isTemporalPlainTime(value: unknown): value is Temporal.PlainTime {}
 
killedBy: isTemporalPlainTime should return true for a Temporal.PlainTime
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainTime.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainTime(value: unknown): value is Temporal.PlainTime {
-  if (typeof Temporal !== 'undefined') {
+  if (true) {
     return value instanceof Temporal.PlainTime;
   }
killedBy: isTemporalPlainTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainTime')

[Killed] EqualityOperator
helpers/type/isTemporalPlainTime.ts:22:7
  * @since 2.0.0
  */
 export function isTemporalPlainTime(value: unknown): value is Temporal.PlainTime {
-  if (typeof Temporal !== 'undefined') {
+  if (typeof Temporal === 'undefined') {
     return value instanceof Temporal.PlainTime;
   }
killedBy: isTemporalPlainTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: Cannot read properties of undefined (reading 'PlainTime')

[Killed] LogicalOperator
helpers/type/isTemporalPlainTime.ts:26:5
     return value instanceof Temporal.PlainTime;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainTime'
+    typeof value === 'object' && value !== null || (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] === 'Temporal.PlainTime'
   );
 }
killedBy: isTemporalPlainTime — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainTime.ts:26:5
     return value instanceof Temporal.PlainTime;
   }
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainTime'
+    true
   );
 }
killedBy: isTemporalPlainTime — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/type/isTemporalPlainTime.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainTime'
+    (value as {
+  [Symbol.toStringTag]?: string;
+})[Symbol.toStringTag] !== 'Temporal.PlainTime'
   );
 }
killedBy: isTemporalPlainTime — fallback without Temporal should return true for an object with matching toStringTag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTemporalPlainTime.ts:28:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    (value as { [Symbol.toStringTag]?: string })[Symbol.toStringTag] === 'Temporal.PlainTime'
+    true
   );
 }
killedBy: isTemporalPlainTime — fallback without Temporal should return false for an object with wrong toStringTag
statusReason: expected true to be false // Object.is equality
