[Killed] BlockStatement
helpers/type/isTimestamp.ts:42:62
  * @see {@link isValidDate} for checking if a Date instance is valid
  * @since 2.0.0
  */
-export function isTimestamp(value: unknown): value is number {
-  if (typeof value !== 'number' || !Number.isFinite(value)) return false;
-
-  const abs = Math.abs(value);
-
-  // If it looks like seconds (small enough), convert to ms for validation
-  if (abs <= MAX_UNIX_SECONDS) {
-    return abs * 1000 <= MAX_TIMESTAMP_MS;
-  }
-
-  // Otherwise treat as milliseconds
-  return abs <= MAX_TIMESTAMP_MS;
-}
+export function isTimestamp(value: unknown): value is number {}
 
killedBy: isTimestamp — property-based non-number values are never timestamps
statusReason: Property failed after 1 tests
{ seed: 2027548955, path: "0:0", endOnFailure: true }
Counterexample: [false]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isTimestamp.ts:43:7
  * @since 2.0.0
  */
 export function isTimestamp(value: unknown): value is number {
-  if (typeof value !== 'number' || !Number.isFinite(value)) return false;
+  if (false) return false;
 
   const abs = Math.abs(value);
killedBy: isTimestamp — property-based non-number values are never timestamps
statusReason: Property failed after 2 tests
{ seed: 846647728, path: "1", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/type/isTimestamp.ts:43:68
  * @since 2.0.0
  */
 export function isTimestamp(value: unknown): value is number {
-  if (typeof value !== 'number' || !Number.isFinite(value)) return false;
+  if (typeof value !== 'number' || !Number.isFinite(value)) return true;
 
   const abs = Math.abs(value);
killedBy: isTimestamp — property-based non-number values are never timestamps
statusReason: Property failed after 1 tests
{ seed: -741380973, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/type/isTimestamp.ts:48:7
   const abs = Math.abs(value);
 
   // If it looks like seconds (small enough), convert to ms for validation
-  if (abs <= MAX_UNIX_SECONDS) {
+  if (true) {
     return abs * 1000 <= MAX_TIMESTAMP_MS;
   }
killedBy: isTimestamp — contract MAX_TIMESTAMP_MS → true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isTimestamp.ts:48:7
   const abs = Math.abs(value);
 
   // If it looks like seconds (small enough), convert to ms for validation
-  if (abs <= MAX_UNIX_SECONDS) {
+  if (abs > MAX_UNIX_SECONDS) {
     return abs * 1000 <= MAX_TIMESTAMP_MS;
   }
killedBy: isTimestamp — contract MAX_TIMESTAMP_MS → true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isTimestamp.ts:49:12
 
   // If it looks like seconds (small enough), convert to ms for validation
   if (abs <= MAX_UNIX_SECONDS) {
-    return abs * 1000 <= MAX_TIMESTAMP_MS;
+    return abs * 1000 > MAX_TIMESTAMP_MS;
   }
 
killedBy: isTimestamp — contract 1700000000 (Unix seconds) → true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTimestamp.ts:49:12
 
   // If it looks like seconds (small enough), convert to ms for validation
   if (abs <= MAX_UNIX_SECONDS) {
-    return abs * 1000 <= MAX_TIMESTAMP_MS;
+    return false;
   }
 
killedBy: isTimestamp — contract 1700000000 (Unix seconds) → true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isTimestamp.ts:53:10
   }
 
   // Otherwise treat as milliseconds
-  return abs <= MAX_TIMESTAMP_MS;
+  return abs > MAX_TIMESTAMP_MS;
 }
 
killedBy: isTimestamp — contract Date.now() → true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isTimestamp.ts:53:10
   }
 
   // Otherwise treat as milliseconds
-  return abs <= MAX_TIMESTAMP_MS;
+  return true;
 }
 
killedBy: isTimestamp — contract MAX_TIMESTAMP_MS + 1 → false
statusReason: expected true to be false // Object.is equality
