[Killed] BlockStatement
helpers/type/isUndefined.ts:19:65
  * @see {@link isNullish} to check for both `null` and `undefined`
  * @since 2.0.0
  */
-export function isUndefined(value: unknown): value is undefined {
-  return value === undefined;
-}
+export function isUndefined(value: unknown): value is undefined {}
 
killedBy: isUndefined — property-based isUndefined(v) → isNullish(v)
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
helpers/type/isUndefined.ts:20:10
  * @since 2.0.0
  */
 export function isUndefined(value: unknown): value is undefined {
-  return value === undefined;
+  return value !== undefined;
 }
 
killedBy: isUndefined — property-based isUndefined(v) → isNullish(v)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/type/isUndefined.ts:20:10
  * @since 2.0.0
  */
 export function isUndefined(value: unknown): value is undefined {
-  return value === undefined;
+  return true;
 }
 
killedBy: isUndefined — property-based !isUndefined(null)
statusReason: expected true to be false // Object.is equality
