[Killed] BlockStatement
helpers/type/isValidRegex.ts:17:54
  * isValidRegex('[')      // => false
  * @since 1.9.0
  */
-export function isValidRegex(value: string): boolean {
-  try {
-    RegExp(value);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export function isValidRegex(value: string): boolean {}
 
killedBy: isValidRegex — property-based result is always boolean
statusReason: Property failed after 1 tests
{ seed: -595092437, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/type/isValidRegex.ts:18:7
  * @since 1.9.0
  */
 export function isValidRegex(value: string): boolean {
-  try {
-    RegExp(value);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: isValidRegex — property-based result is always boolean
statusReason: Property failed after 1 tests
{ seed: 882454409, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
helpers/type/isValidRegex.ts:20:12
 export function isValidRegex(value: string): boolean {
   try {
     RegExp(value);
-    return true;
+    return false;
   } catch {
     return false;
killedBy: isValidRegex — property-based simple alphanumeric strings are always valid regexes
statusReason: Property failed after 1 tests
{ seed: 1336075373, path: "0", endOnFailure: true }
Counterexample: [" "]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
