[Killed] BlockStatement
helpers/url/cleanPath.ts:25:30
  */
 export function cleanPath(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  return url.replace(/([^:]\/)\/+/g, '$1')
-}
+): string | undefined | null {}
 
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected 'https://www.document.baseURI.comundef…' to be 'https://www.document.baseURI.com/test…' // Object.is equality

[Killed] ConditionalExpression
helpers/url/cleanPath.ts:26:7
 export function cleanPath(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (false) {
     return url
   }
killedBy: cleanPath — contract null returns null
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
helpers/url/cleanPath.ts:26:7
 export function cleanPath(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (false || url === null) {
     return url
   }
killedBy: cleanPath — contract undefined returns undefined
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
helpers/url/cleanPath.ts:29:22
   if (url === undefined || url === null) {
     return url
   }
-  return url.replace(/([^:]\/)\/+/g, '$1')
+  return url.replace(/([^:]\/)\//g, '$1')
 }
 
killedBy: cleanPath — contract protocol double slashes are preserved
statusReason: expected 'http://example.com/a/b//c' to be 'http://example.com/a/b/c' // Object.is equality
