[Killed] EqualityOperator
helpers/url/extractPureURI.ts:23:7
 export function extractPureURI(url: undefined): undefined;
 export function extractPureURI(url: null): null;
 export function extractPureURI(url: string | undefined | null): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (url !== undefined || url === null) {
     return url;
   }
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] ConditionalExpression
helpers/url/extractPureURI.ts:23:7
 export function extractPureURI(url: undefined): undefined;
 export function extractPureURI(url: null): null;
 export function extractPureURI(url: string | undefined | null): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (true) {
     return url;
   }
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] StringLiteral
helpers/url/extractPureURI.ts:29:37
 
   // Find the first occurrence of ? or #
   const queryIndex = url.indexOf('?');
-  const fragmentIndex = url.indexOf('#');
+  const fragmentIndex = url.indexOf("");
 
   let cutIndex = -1;
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected '' to be 'www.foo.com/api/' // Object.is equality

[Killed] UnaryOperator
helpers/url/extractPureURI.ts:31:18
   const queryIndex = url.indexOf('?');
   const fragmentIndex = url.indexOf('#');
 
-  let cutIndex = -1;
+  let cutIndex = +1;
 
   if (queryIndex !== -1 && fragmentIndex !== -1) {
killedBy: extractPureURI should do nothing from simple text
statusReason: expected 't' to be 'text-without-slash' // Object.is equality

[Killed] LogicalOperator
helpers/url/extractPureURI.ts:33:7
 
   let cutIndex = -1;
 
-  if (queryIndex !== -1 && fragmentIndex !== -1) {
+  if (queryIndex !== -1 || fragmentIndex !== -1) {
     // Both exist, take the earliest one
     cutIndex = Math.min(queryIndex, fragmentIndex);
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] ConditionalExpression
helpers/url/extractPureURI.ts:33:7
 
   let cutIndex = -1;
 
-  if (queryIndex !== -1 && fragmentIndex !== -1) {
+  if (true) {
     // Both exist, take the earliest one
     cutIndex = Math.min(queryIndex, fragmentIndex);
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] MethodExpression
helpers/url/extractPureURI.ts:35:16
 
   if (queryIndex !== -1 && fragmentIndex !== -1) {
     // Both exist, take the earliest one
-    cutIndex = Math.min(queryIndex, fragmentIndex);
+    cutIndex = Math.max(queryIndex, fragmentIndex);
   } else if (queryIndex !== -1) {
     // Only query exists
killedBy: extractPureURI should extract URI from URL with both query and fragment, taking query first
statusReason: expected 'www.foo.com/api/?param=1' to be 'www.foo.com/api/' // Object.is equality

[Killed] ConditionalExpression
helpers/url/extractPureURI.ts:36:14
   if (queryIndex !== -1 && fragmentIndex !== -1) {
     // Both exist, take the earliest one
     cutIndex = Math.min(queryIndex, fragmentIndex);
-  } else if (queryIndex !== -1) {
+  } else if (false) {
     // Only query exists
     cutIndex = queryIndex;
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] BlockStatement
helpers/url/extractPureURI.ts:36:33
   if (queryIndex !== -1 && fragmentIndex !== -1) {
     // Both exist, take the earliest one
     cutIndex = Math.min(queryIndex, fragmentIndex);
-  } else if (queryIndex !== -1) {
-    // Only query exists
-    cutIndex = queryIndex;
-  } else if (fragmentIndex !== -1) {
+  } else if (queryIndex !== -1) {} else if (fragmentIndex !== -1) {
     // Only fragment exists
     cutIndex = fragmentIndex;
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] EqualityOperator
helpers/url/extractPureURI.ts:39:14
   } else if (queryIndex !== -1) {
     // Only query exists
     cutIndex = queryIndex;
-  } else if (fragmentIndex !== -1) {
+  } else if (fragmentIndex === -1) {
     // Only fragment exists
     cutIndex = fragmentIndex;
killedBy: extractPureURI should extract URI from URL with fragment
statusReason: expected 'www.foo.com/api/#userInfos' to be 'www.foo.com/api/' // Object.is equality

[Killed] ConditionalExpression
helpers/url/extractPureURI.ts:39:14
   } else if (queryIndex !== -1) {
     // Only query exists
     cutIndex = queryIndex;
-  } else if (fragmentIndex !== -1) {
+  } else if (false) {
     // Only fragment exists
     cutIndex = fragmentIndex;
killedBy: extractPureURI should extract URI from URL with fragment
statusReason: expected 'www.foo.com/api/#userInfos' to be 'www.foo.com/api/' // Object.is equality

[Killed] UnaryOperator
helpers/url/extractPureURI.ts:45:20
   }
 
   // If no query or fragment found, return the original string
-  if (cutIndex === -1) {
+  if (cutIndex === +1) {
     return url;
   }
killedBy: extractPureURI should do nothing from standalone slash
statusReason: expected '' to be '/' // Object.is equality

[Killed] EqualityOperator
helpers/url/extractPureURI.ts:45:7
   }
 
   // If no query or fragment found, return the original string
-  if (cutIndex === -1) {
+  if (cutIndex !== -1) {
     return url;
   }
killedBy: extractPureURI should extract URI from URL with query
statusReason: expected 'www.foo.com/api/?=bar' to be 'www.foo.com/api/' // Object.is equality

[Killed] MethodExpression
helpers/url/extractPureURI.ts:50:10
   }
 
   // Return the substring up to the first ? or #
-  return url.substring(0, cutIndex);
+  return url;
 }
 
killedBy: extractPureURI — property-based result has no ? or #
statusReason: Property failed after 22 tests
{ seed: -599881649, path: "21:1:3", endOnFailure: true }
Counterexample: ["#"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
