[Killed] BlockStatement
helpers/url/onlyPath.ts:107:30
  */
 export function onlyPath(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  const [path] = url.split(/[?#]/)
-  return path
-}
+): string | undefined | null {}
 
killedBy: onlyPath should return the path without query and fragment
statusReason: expected undefined to be '/path' // Object.is equality

[Killed] LogicalOperator
helpers/url/onlyPath.ts:108:7
 export function onlyPath(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (url === undefined && url === null) {
     return url
   }
killedBy: onlyPath should return undefined if input is undefined
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
helpers/url/onlyPath.ts:108:42
 export function onlyPath(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
+  if (url === undefined || url === null) {}
   const [path] = url.split(/[?#]/)
   return path
killedBy: onlyPath should return undefined if input is undefined
statusReason: Cannot read properties of undefined (reading 'split')
