[Killed] Regex
helpers/url/parsePackageRepository.ts:58:20
 };
 
 /** SCP-style SSH URL: `git@github.com:owner/repo.git` */
-const RE_SSH_SCP = /^git@([\w.-]+):([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
+const RE_SSH_SCP = /^git@([\w.-]+):([^\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
 
 /**
killedBy: parsePackageRepository — object form, URL variants SCP-style SSH: git@github.com:owner/repo.git
statusReason: expected undefined to match object { host: 'github', …(1) }

[Killed] Regex
helpers/url/parsePackageRepository.ts:58:20
 };
 
 /** SCP-style SSH URL: `git@github.com:owner/repo.git` */
-const RE_SSH_SCP = /^git@([\w.-]+):([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
+const RE_SSH_SCP = /^git@([\w.-]+):([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[^#?].*)?$/;
 
 /**
killedBy: parsePackageRepository — object form, URL variants SCP-style SSH: git@github.com:owner/repo.git
statusReason: expected { type: 'git', host: 'github', …(5) } to match object { host: 'github', …(1) }
(5 matching properties omitted from actual)

[Killed] Regex
helpers/url/parsePackageRepository.ts:65:3
  * Captures: [1] domain, [2] owner/repo path
  */
 const RE_URL =
-  /^(?:git\+(?:https?|ssh)|https?|git):\/\/(?:[^@/]+@)?([\w.-]+)\/([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
+  /^(?:git\+(?:https?|ssh)|https?|git):\/\/(?:[^@/]@)?([\w.-]+)\/([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
 
 function makeOwnerRepoResult(
killedBy: parsePackageRepository — object form, URL variants git+ssh URL: git+ssh://git@github.com/owner/repo.git
statusReason: expected undefined to match object { host: 'github', …(1) }

[Killed] Regex
helpers/url/parsePackageRepository.ts:65:3
  * Captures: [1] domain, [2] owner/repo path
  */
 const RE_URL =
-  /^(?:git\+(?:https?|ssh)|https?|git):\/\/(?:[^@/]+@)?([\w.-]+)\/([\w.-]+\/[\w.-]+?)(?:\.git)?(?:[#?].*)?$/;
+  /^(?:git\+(?:https?|ssh)|https?|git):\/\/(?:[^@/]+@)?([\w.-]+)\/([\w.-]+\/[\w.-]+?)(?:\.git)(?:[#?].*)?$/;
 
 function makeOwnerRepoResult(
killedBy: parsePackageRepository — object form, URL variants plain https URL
statusReason: expected undefined to match object { host: 'github', …(1) }

[Killed] BlockStatement
helpers/url/parsePackageRepository.ts:72:22
   host: string,
   rawPath: string,
   directory: string | undefined,
-): PackageRepository {
-  const slashIdx = rawPath.indexOf('/');
-  const owner = rawPath.slice(0, slashIdx);
-  const repo = rawPath.slice(slashIdx + 1);
-  return { type, host, slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
-}
+): PackageRepository {}
 
 function parseRawUrl(
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] MethodExpression
helpers/url/parsePackageRepository.ts:74:17
   directory: string | undefined,
 ): PackageRepository {
   const slashIdx = rawPath.indexOf('/');
-  const owner = rawPath.slice(0, slashIdx);
+  const owner = rawPath;
   const repo = rawPath.slice(slashIdx + 1);
   return { type, host, slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected { type: 'git', host: 'github', …(5) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] ArithmeticOperator
helpers/url/parsePackageRepository.ts:75:30
 ): PackageRepository {
   const slashIdx = rawPath.indexOf('/');
   const owner = rawPath.slice(0, slashIdx);
-  const repo = rawPath.slice(slashIdx + 1);
+  const repo = rawPath.slice(slashIdx - 1);
   return { type, host, slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
 }
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected { type: 'git', host: 'github', …(5) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] MethodExpression
helpers/url/parsePackageRepository.ts:75:16
 ): PackageRepository {
   const slashIdx = rawPath.indexOf('/');
   const owner = rawPath.slice(0, slashIdx);
-  const repo = rawPath.slice(slashIdx + 1);
+  const repo = rawPath;
   return { type, host, slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
 }
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected { type: 'git', host: 'github', …(5) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] Regex
helpers/url/parsePackageRepository.ts:85:26
   directory: string | undefined,
 ): PackageRepository | undefined {
   // Shorthand prefix: "github:owner/repo", "gitlab:owner/repo", "bitbucket:owner/repo"
-  const shorthandMatch = /^(github|gitlab|bitbucket):([\w.-]+\/[\w.-]+)$/.exec(raw);
+  const shorthandMatch = /^(github|gitlab|bitbucket):([\w.-]+\/[\w.-])$/.exec(raw);
   if (shorthandMatch) {
     const host = shorthandMatch[1] as 'github' | 'gitlab' | 'bitbucket';
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected undefined to match object { host: 'github', …(3) }

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:86:7
 ): PackageRepository | undefined {
   // Shorthand prefix: "github:owner/repo", "gitlab:owner/repo", "bitbucket:owner/repo"
   const shorthandMatch = /^(github|gitlab|bitbucket):([\w.-]+\/[\w.-]+)$/.exec(raw);
-  if (shorthandMatch) {
+  if (true) {
     const host = shorthandMatch[1] as 'github' | 'gitlab' | 'bitbucket';
     const slug = shorthandMatch[2];
killedBy: parsePackageRepository — null / undefined / invalid empty string → undefined
statusReason: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:86:7
 ): PackageRepository | undefined {
   // Shorthand prefix: "github:owner/repo", "gitlab:owner/repo", "bitbucket:owner/repo"
   const shorthandMatch = /^(github|gitlab|bitbucket):([\w.-]+\/[\w.-]+)$/.exec(raw);
-  if (shorthandMatch) {
+  if (false) {
     const host = shorthandMatch[1] as 'github' | 'gitlab' | 'bitbucket';
     const slug = shorthandMatch[2];
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected undefined to match object { host: 'github', …(3) }

[Killed] StringLiteral
helpers/url/parsePackageRepository.ts:89:35
   if (shorthandMatch) {
     const host = shorthandMatch[1] as 'github' | 'gitlab' | 'bitbucket';
     const slug = shorthandMatch[2];
-    const slashIdx = slug.indexOf('/');
+    const slashIdx = slug.indexOf("");
     const owner = slug.slice(0, slashIdx);
     const repo = slug.slice(slashIdx + 1);
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected { type: 'git', host: 'github', …(5) } to match object { host: 'github', …(3) }
(3 matching properties omitted from actual)

[Killed] MethodExpression
helpers/url/parsePackageRepository.ts:90:19
     const host = shorthandMatch[1] as 'github' | 'gitlab' | 'bitbucket';
     const slug = shorthandMatch[2];
     const slashIdx = slug.indexOf('/');
-    const owner = slug.slice(0, slashIdx);
+    const owner = slug;
     const repo = slug.slice(slashIdx + 1);
     return { type, host, slug, owner, repo, gistId: undefined, directory };
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected { type: 'git', host: 'github', …(5) } to match object { host: 'github', …(3) }
(3 matching properties omitted from actual)

[Killed] MethodExpression
helpers/url/parsePackageRepository.ts:91:18
     const slug = shorthandMatch[2];
     const slashIdx = slug.indexOf('/');
     const owner = slug.slice(0, slashIdx);
-    const repo = slug.slice(slashIdx + 1);
+    const repo = slug;
     return { type, host, slug, owner, repo, gistId: undefined, directory };
   }
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected { type: 'git', host: 'github', …(5) } to match object { host: 'github', …(3) }
(3 matching properties omitted from actual)

[Killed] ArithmeticOperator
helpers/url/parsePackageRepository.ts:91:29
     const slug = shorthandMatch[2];
     const slashIdx = slug.indexOf('/');
     const owner = slug.slice(0, slashIdx);
-    const repo = slug.slice(slashIdx + 1);
+    const repo = slug.slice(slashIdx - 1);
     return { type, host, slug, owner, repo, gistId: undefined, directory };
   }
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected { type: 'git', host: 'github', …(5) } to match object { host: 'github', …(3) }
(3 matching properties omitted from actual)

[Killed] ObjectLiteral
helpers/url/parsePackageRepository.ts:92:12
     const slashIdx = slug.indexOf('/');
     const owner = slug.slice(0, slashIdx);
     const repo = slug.slice(slashIdx + 1);
-    return { type, host, slug, owner, repo, gistId: undefined, directory };
+    return {};
   }
 
killedBy: parsePackageRepository — shorthand string forms "github:owner/repo"
statusReason: expected {} to match object { host: 'github', …(3) }

[Killed] Regex
helpers/url/parsePackageRepository.ts:96:21
   }
 
   // Gist shorthand: "gist:<id>"
-  const gistMatch = /^gist:([\w-]+)$/.exec(raw);
+  const gistMatch = /^gist:([^\w-]+)$/.exec(raw);
   if (gistMatch) {
     return { type, host: 'gist', slug: undefined, owner: undefined, repo: undefined, gistId: gistMatch[1], directory };
killedBy: parsePackageRepository — shorthand string forms "gist:<id>"
statusReason: expected undefined to deeply equal { type: 'git', host: 'gist', …(5) }

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:97:7
 
   // Gist shorthand: "gist:<id>"
   const gistMatch = /^gist:([\w-]+)$/.exec(raw);
-  if (gistMatch) {
+  if (false) {
     return { type, host: 'gist', slug: undefined, owner: undefined, repo: undefined, gistId: gistMatch[1], directory };
   }
killedBy: parsePackageRepository — shorthand string forms "gist:<id>"
statusReason: expected undefined to deeply equal { type: 'git', host: 'gist', …(5) }

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:97:7
 
   // Gist shorthand: "gist:<id>"
   const gistMatch = /^gist:([\w-]+)$/.exec(raw);
-  if (gistMatch) {
+  if (true) {
     return { type, host: 'gist', slug: undefined, owner: undefined, repo: undefined, gistId: gistMatch[1], directory };
   }
killedBy: parsePackageRepository — property-based bare "owner/repo" shorthand always returns host=github
statusReason: Property failed after 1 tests
{ seed: 841440209, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["a/a"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
helpers/url/parsePackageRepository.ts:102:21
   }
 
   // Bare GitHub shorthand: "owner/repo" (no colon prefix, no protocol)
-  const bareMatch = /^([\w.-]+)\/([\w.-]+)$/.exec(raw);
+  const bareMatch = /^([^\w.-]+)\/([\w.-]+)$/.exec(raw);
   if (bareMatch) {
     const owner = bareMatch[1];
killedBy: parsePackageRepository — property-based bare "owner/repo" shorthand always returns host=github
statusReason: Property failed after 1 tests
{ seed: 610170121, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["a/a"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
helpers/url/parsePackageRepository.ts:102:21
   }
 
   // Bare GitHub shorthand: "owner/repo" (no colon prefix, no protocol)
-  const bareMatch = /^([\w.-]+)\/([\w.-]+)$/.exec(raw);
+  const bareMatch = /^([\w.-])\/([\w.-]+)$/.exec(raw);
   if (bareMatch) {
     const owner = bareMatch[1];
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] BlockStatement
helpers/url/parsePackageRepository.ts:103:18
 
   // Bare GitHub shorthand: "owner/repo" (no colon prefix, no protocol)
   const bareMatch = /^([\w.-]+)\/([\w.-]+)$/.exec(raw);
-  if (bareMatch) {
-    const owner = bareMatch[1];
-    const repo = bareMatch[2];
-    return { type, host: 'github', slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
-  }
+  if (bareMatch) {}
 
   // SCP-style SSH: git@github.com:owner/repo.git
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:103:7
 
   // Bare GitHub shorthand: "owner/repo" (no colon prefix, no protocol)
   const bareMatch = /^([\w.-]+)\/([\w.-]+)$/.exec(raw);
-  if (bareMatch) {
+  if (true) {
     const owner = bareMatch[1];
     const repo = bareMatch[2];
killedBy: parsePackageRepository — property-based object form with type preserves the type field
statusReason: Property failed after 1 tests
{ seed: -988812599, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["git","a/a"]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/url/parsePackageRepository.ts:106:42
   if (bareMatch) {
     const owner = bareMatch[1];
     const repo = bareMatch[2];
-    return { type, host: 'github', slug: `${owner}/${repo}`, owner, repo, gistId: undefined, directory };
+    return { type, host: 'github', slug: ``, owner, repo, gistId: undefined, directory };
   }
 
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected { type: 'git', host: 'github', …(5) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] BlockStatement
helpers/url/parsePackageRepository.ts:111:17
 
   // SCP-style SSH: git@github.com:owner/repo.git
   const sshMatch = RE_SSH_SCP.exec(raw);
-  if (sshMatch) {
-    const host = DOMAIN_TO_HOST[sshMatch[1]] ?? sshMatch[1];
-    return makeOwnerRepoResult(type, host, sshMatch[2], directory);
-  }
+  if (sshMatch) {}
 
   // URL-form: https://, git+https://, git://, git+ssh://
killedBy: parsePackageRepository — contract SCP SSH URL → correct slug
statusReason: expected undefined to be 'helpers4/typescript' // Object.is equality

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:111:7
 
   // SCP-style SSH: git@github.com:owner/repo.git
   const sshMatch = RE_SSH_SCP.exec(raw);
-  if (sshMatch) {
+  if (false) {
     const host = DOMAIN_TO_HOST[sshMatch[1]] ?? sshMatch[1];
     return makeOwnerRepoResult(type, host, sshMatch[2], directory);
killedBy: parsePackageRepository — contract SCP SSH URL → correct slug
statusReason: expected undefined to be 'helpers4/typescript' // Object.is equality

[Killed] LogicalOperator
helpers/url/parsePackageRepository.ts:112:18
   // SCP-style SSH: git@github.com:owner/repo.git
   const sshMatch = RE_SSH_SCP.exec(raw);
   if (sshMatch) {
-    const host = DOMAIN_TO_HOST[sshMatch[1]] ?? sshMatch[1];
+    const host = DOMAIN_TO_HOST[sshMatch[1]] && sshMatch[1];
     return makeOwnerRepoResult(type, host, sshMatch[2], directory);
   }
killedBy: parsePackageRepository — object form, URL variants SCP-style SSH: git@github.com:owner/repo.git
statusReason: expected { type: 'git', …(6) } to match object { host: 'github', …(1) }
(5 matching properties omitted from actual)

[Killed] BlockStatement
helpers/url/parsePackageRepository.ts:118:17
 
   // URL-form: https://, git+https://, git://, git+ssh://
   const urlMatch = RE_URL.exec(raw);
-  if (urlMatch) {
-    const host = DOMAIN_TO_HOST[urlMatch[1]] ?? urlMatch[1];
-    return makeOwnerRepoResult(type, host, urlMatch[2], directory);
-  }
+  if (urlMatch) {}
 
   return undefined;
killedBy: parsePackageRepository — property-based object form with type preserves the type field
statusReason: Property failed after 1 tests
{ seed: -485332717, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["git","a/a"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:118:7
 
   // URL-form: https://, git+https://, git://, git+ssh://
   const urlMatch = RE_URL.exec(raw);
-  if (urlMatch) {
+  if (true) {
     const host = DOMAIN_TO_HOST[urlMatch[1]] ?? urlMatch[1];
     return makeOwnerRepoResult(type, host, urlMatch[2], directory);
killedBy: parsePackageRepository — null / undefined / invalid empty string → undefined
statusReason: Cannot read properties of null (reading '1')

[Killed] LogicalOperator
helpers/url/parsePackageRepository.ts:119:18
   // URL-form: https://, git+https://, git://, git+ssh://
   const urlMatch = RE_URL.exec(raw);
   if (urlMatch) {
-    const host = DOMAIN_TO_HOST[urlMatch[1]] ?? urlMatch[1];
+    const host = DOMAIN_TO_HOST[urlMatch[1]] && urlMatch[1];
     return makeOwnerRepoResult(type, host, urlMatch[2], directory);
   }
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected { type: 'git', …(6) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] BlockStatement
helpers/url/parsePackageRepository.ts:152:92
  * //      repo: 'typescript', gistId: undefined, directory: undefined }
  * @since next
  */
-export function parsePackageRepository(repository: unknown): PackageRepository | undefined {
-  if (repository === null || repository === undefined) return undefined;
-
-  if (typeof repository === 'string') {
-    return parseRawUrl(repository, 'git', undefined);
-  }
-
-  if (typeof repository === 'object' && !Array.isArray(repository)) {
-    const obj = repository as Record<string, unknown>;
-    const rawUrl = obj['url'];
-    if (typeof rawUrl !== 'string') return undefined;
-    const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
-    const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
-    return parseRawUrl(rawUrl, type, directory);
-  }
-
-  return undefined;
-}
+export function parsePackageRepository(repository: unknown): PackageRepository | undefined {}
 
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:153:30
  * @since next
  */
 export function parsePackageRepository(repository: unknown): PackageRepository | undefined {
-  if (repository === null || repository === undefined) return undefined;
+  if (repository === null || repository !== undefined) return undefined;
 
   if (typeof repository === 'string') {
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:153:7
  * @since next
  */
 export function parsePackageRepository(repository: unknown): PackageRepository | undefined {
-  if (repository === null || repository === undefined) return undefined;
+  if (repository !== null || repository === undefined) return undefined;
 
   if (typeof repository === 'string') {
killedBy: parsePackageRepository — property-based null / undefined always returns undefined
statusReason: Property failed after 1 tests
{ seed: -1339712202, path: "0", endOnFailure: true }
Counterexample: [null]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:155:7
 export function parsePackageRepository(repository: unknown): PackageRepository | undefined {
   if (repository === null || repository === undefined) return undefined;
 
-  if (typeof repository === 'string') {
+  if (true) {
     return parseRawUrl(repository, 'git', undefined);
   }
killedBy: parsePackageRepository — null / undefined / invalid array → undefined
statusReason: expected { type: 'git', host: 'github', …(5) } to be undefined

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:155:7
 export function parsePackageRepository(repository: unknown): PackageRepository | undefined {
   if (repository === null || repository === undefined) return undefined;
 
-  if (typeof repository === 'string') {
+  if (typeof repository !== 'string') {
     return parseRawUrl(repository, 'git', undefined);
   }
killedBy: parsePackageRepository — null / undefined / invalid array → undefined
statusReason: expected { type: 'git', host: 'github', …(5) } to be undefined

[Killed] StringLiteral
helpers/url/parsePackageRepository.ts:156:36
   if (repository === null || repository === undefined) return undefined;
 
   if (typeof repository === 'string') {
-    return parseRawUrl(repository, 'git', undefined);
+    return parseRawUrl(repository, "", undefined);
   }
 
killedBy: parsePackageRepository — shorthand string forms bare "owner/repo" → github
statusReason: expected { type: '', host: 'github', …(5) } to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] BooleanLiteral
helpers/url/parsePackageRepository.ts:159:41
     return parseRawUrl(repository, 'git', undefined);
   }
 
-  if (typeof repository === 'object' && !Array.isArray(repository)) {
+  if (typeof repository === 'object' && Array.isArray(repository)) {
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
killedBy: parsePackageRepository — property-based object form with type preserves the type field
statusReason: Property failed after 1 tests
{ seed: 1643187008, path: "0:0:0:0:0:0", endOnFailure: true }
Counterexample: ["git","a/a"]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:159:7
     return parseRawUrl(repository, 'git', undefined);
   }
 
-  if (typeof repository === 'object' && !Array.isArray(repository)) {
+  if (typeof repository !== 'object' && !Array.isArray(repository)) {
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:162:9
   if (typeof repository === 'object' && !Array.isArray(repository)) {
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
-    if (typeof rawUrl !== 'string') return undefined;
+    if (true) return undefined;
     const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
     const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
killedBy: parsePackageRepository — property-based object form with type preserves the type field
statusReason: Property failed after 1 tests
{ seed: 1420969216, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: ["git","a/a"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:162:9
   if (typeof repository === 'object' && !Array.isArray(repository)) {
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
-    if (typeof rawUrl !== 'string') return undefined;
+    if (typeof rawUrl === 'string') return undefined;
     const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
     const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
killedBy: parsePackageRepository — object form, URL variants git+https URL (npm canonical form)
statusReason: expected undefined to deeply equal { type: 'git', host: 'github', …(5) }

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:163:18
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
     if (typeof rawUrl !== 'string') return undefined;
-    const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
+    const type = typeof obj['type'] !== 'string' ? (obj['type'] as string) : 'git';
     const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
     return parseRawUrl(rawUrl, type, directory);
killedBy: parsePackageRepository — property-based object form with type preserves the type field
statusReason: Property failed after 2 tests
{ seed: -1437155617, path: "1:1:1:1:1", endOnFailure: true }
Counterexample: ["hg","a/a"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:163:18
     const obj = repository as Record<string, unknown>;
     const rawUrl = obj['url'];
     if (typeof rawUrl !== 'string') return undefined;
-    const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
+    const type = false ? (obj['type'] as string) : 'git';
     const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
     return parseRawUrl(rawUrl, type, directory);
killedBy: parsePackageRepository — object form, URL variants preserves custom type
statusReason: expected 'git' to be 'svn' // Object.is equality

[Killed] EqualityOperator
helpers/url/parsePackageRepository.ts:164:23
     const rawUrl = obj['url'];
     if (typeof rawUrl !== 'string') return undefined;
     const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
-    const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
+    const directory = typeof obj['directory'] !== 'string' ? (obj['directory'] as string) : undefined;
     return parseRawUrl(rawUrl, type, directory);
   }
killedBy: parsePackageRepository — object form, URL variants extracts directory field
statusReason: expected undefined to be 'workspaces/libnpmpublish' // Object.is equality

[Killed] ConditionalExpression
helpers/url/parsePackageRepository.ts:164:23
     const rawUrl = obj['url'];
     if (typeof rawUrl !== 'string') return undefined;
     const type = typeof obj['type'] === 'string' ? (obj['type'] as string) : 'git';
-    const directory = typeof obj['directory'] === 'string' ? (obj['directory'] as string) : undefined;
+    const directory = false ? (obj['directory'] as string) : undefined;
     return parseRawUrl(rawUrl, type, directory);
   }
killedBy: parsePackageRepository — property-based object form with directory preserves the directory field
statusReason: Property failed after 1 tests
{ seed: -1856242227, path: "0:0", endOnFailure: true }
Counterexample: ["/"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
