[Killed] BlockStatement
helpers/url/relativeURLToAbsolute.ts:22:68
  * @returns The absolute URL
  * @since 1.0.0
  */
-export function relativeURLToAbsolute(relativeUrl: string): string {
-    return (
-        withoutTrailingSlash(document.baseURI ?? window.location.origin) +
-        cleanPath(withLeadingSlash(relativeUrl))
-    );
-}
+export function relativeURLToAbsolute(relativeUrl: string): string {}
 
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected undefined to be 'https://www.document.baseURI.com/test…' // Object.is equality

[Killed] LogicalOperator
helpers/url/relativeURLToAbsolute.ts:24:30
  */
 export function relativeURLToAbsolute(relativeUrl: string): string {
     return (
-        withoutTrailingSlash(document.baseURI ?? window.location.origin) +
+        withoutTrailingSlash(document.baseURI && window.location.origin) +
         cleanPath(withLeadingSlash(relativeUrl))
     );
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected 'https://www.window.location.origin.co…' to be 'https://www.document.baseURI.com/test…' // Object.is equality

[Killed] ArithmeticOperator
helpers/url/relativeURLToAbsolute.ts:24:9
  */
 export function relativeURLToAbsolute(relativeUrl: string): string {
     return (
-        withoutTrailingSlash(document.baseURI ?? window.location.origin) +
-        cleanPath(withLeadingSlash(relativeUrl))
+        withoutTrailingSlash(document.baseURI ?? window.location.origin) - cleanPath(withLeadingSlash(relativeUrl))
     );
 }
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected NaN to be 'https://www.document.baseURI.com/test…' // Object.is equality
