[Killed] BlockStatement
helpers/url/withLeadingSlash.ts:103:30
  */
 export function withLeadingSlash(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  return url[0] === '/' ? url : '/' + url
-}
+): string | undefined | null {}
 
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected 'https://www.document.baseURI.comundef…' to be 'https://www.document.baseURI.com/test…' // Object.is equality

[Killed] EqualityOperator
helpers/url/withLeadingSlash.ts:104:28
 export function withLeadingSlash(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (url === undefined || url !== null) {
     return url
   }
killedBy: withLeadingSlash should return null if input is null
statusReason: Cannot read properties of null (reading '0')

[Killed] ConditionalExpression
helpers/url/withLeadingSlash.ts:107:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[0] === '/' ? url : '/' + url
+  return true ? url : '/' + url
 }
 
killedBy: withLeadingSlash should add leading slash to an empty string
statusReason: expected '' to be '/' // Object.is equality

[Killed] EqualityOperator
helpers/url/withLeadingSlash.ts:107:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[0] === '/' ? url : '/' + url
+  return url[0] !== '/' ? url : '/' + url
 }
 
killedBy: withLeadingSlash should do nothing if leading slash is already present
statusReason: expected '//foo' to be '/foo' // Object.is equality
