[Killed] BlockStatement
helpers/url/withTrailingSlash.ts:103:30
  */
 export function withTrailingSlash(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  return url[url.length - 1] === '/' ? url : url + '/'
-}
+): string | undefined | null {}
 
killedBy: withTrailingSlash — property-based result always ends with /
statusReason: Property failed after 1 tests
{ seed: 795258396, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/withTrailingSlash.ts:104:28
 export function withTrailingSlash(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (url === undefined || false) {
     return url
   }
killedBy: withTrailingSlash — contract null returns null
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
helpers/url/withTrailingSlash.ts:104:7
 export function withTrailingSlash(
   url: string | undefined | null,
 ): string | undefined | null {
-  if (url === undefined || url === null) {
+  if (true) {
     return url
   }
killedBy: withTrailingSlash — property-based result always ends with /
statusReason: Property failed after 1 tests
{ seed: 1147846626, path: "0", endOnFailure: true }
Counterexample: [""]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/withTrailingSlash.ts:107:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[url.length - 1] === '/' ? url : url + '/'
+  return false ? url : url + '/'
 }
 
killedBy: withTrailingSlash — property-based idempotent: withTrailingSlash(withTrailingSlash(s)) === withTrailingSlash(s)
statusReason: Property failed after 1 tests
{ seed: -122274157, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/url/withTrailingSlash.ts:107:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[url.length - 1] === '/' ? url : url + '/'
+  return url[url.length - 1] !== '/' ? url : url + '/'
 }
 
killedBy: withTrailingSlash — property-based result always ends with /
statusReason: Property failed after 1 tests
{ seed: -946103753, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
