[Killed] BlockStatement
helpers/url/withoutLeadingSlash.ts:107:30
  */
 export function withoutLeadingSlash(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  return url[0] === '/' ? url.slice(1) : url
-}
+): string | undefined | null {}
 
killedBy: withoutLeadingSlash — property-based result never starts with / (for inputs with at most one leading slash)
statusReason: Property failed after 1 tests
{ seed: -1966974523, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/url/withoutLeadingSlash.ts:111:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[0] === '/' ? url.slice(1) : url
+  return false ? url.slice(1) : url
 }
 
killedBy: withoutLeadingSlash — contract single slash returns empty string
statusReason: expected '/' to be '' // Object.is equality

[Killed] EqualityOperator
helpers/url/withoutLeadingSlash.ts:111:10
   if (url === undefined || url === null) {
     return url
   }
-  return url[0] === '/' ? url.slice(1) : url
+  return url[0] !== '/' ? url.slice(1) : url
 }
 
killedBy: withoutLeadingSlash — property-based result never starts with / (for inputs with at most one leading slash)
statusReason: Property failed after 49 tests
{ seed: 384076538, path: "48:1:5", endOnFailure: true }
Counterexample: ["/"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
