[Killed] BlockStatement
helpers/url/withoutTrailingSlash.ts:107:30
  */
 export function withoutTrailingSlash(
   url: string | undefined | null,
-): string | undefined | null {
-  if (url === undefined || url === null) {
-    return url
-  }
-  return url.replace(/\/+$/, '')
-}
+): string | undefined | null {}
 
killedBy: relativeURLToAbsolute should use document.baseURI first
statusReason: expected 'undefined/test-url' to be 'https://www.document.baseURI.com/test…' // Object.is equality

[Killed] Regex
helpers/url/withoutTrailingSlash.ts:111:22
   if (url === undefined || url === null) {
     return url
   }
-  return url.replace(/\/+$/, '')
+  return url.replace(/\/+/, '')
 }
 
killedBy: withoutTrailingSlash security edge cases should handle data: URI with trailing slash
statusReason: expected 'data:texthtml,payload/' to be 'data:text/html,payload' // Object.is equality
