[Killed] ConditionalExpression
helpers/version/compare.ts:23:7
 function comparePrerelease(pre1: string[], pre2: string[]): number {
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
-  if (pre1.length === 0 && pre2.length === 0) return 0;
+  if (false) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
helpers/version/compare.ts:23:7
 function comparePrerelease(pre1: string[], pre2: string[]): number {
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
-  if (pre1.length === 0 && pre2.length === 0) return 0;
+  if (pre1.length === 0 || pre2.length === 0) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
killedBy: compare prerelease comparison should consider prerelease lower than release
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:24:7
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
-  if (pre1.length === 0) return 1; // No prerelease > prerelease
+  if (true) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
 
killedBy: compare prerelease comparison should consider prerelease lower than release
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:24:7
   // No prerelease has higher precedence than prerelease
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
-  if (pre1.length === 0) return 1; // No prerelease > prerelease
+  if (false) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
 
killedBy: compare prerelease comparison should consider prerelease lower than release
statusReason: expected -1 to be 1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:25:7
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
-  if (pre2.length === 0) return -1; // prerelease < no prerelease
+  if (pre2.length !== 0) return -1; // prerelease < no prerelease
 
   const maxLength = Math.max(pre1.length, pre2.length);
killedBy: compare prerelease comparison should consider prerelease lower than release
statusReason: expected 1 to be -1 // Object.is equality

[Killed] UnaryOperator
helpers/version/compare.ts:25:33
   // e.g., 1.0.0 > 1.0.0-alpha
   if (pre1.length === 0 && pre2.length === 0) return 0;
   if (pre1.length === 0) return 1; // No prerelease > prerelease
-  if (pre2.length === 0) return -1; // prerelease < no prerelease
+  if (pre2.length === 0) return +1; // prerelease < no prerelease
 
   const maxLength = Math.max(pre1.length, pre2.length);
killedBy: compare prerelease comparison should consider prerelease lower than release
statusReason: expected 1 to be -1 // Object.is equality

[Killed] MethodExpression
helpers/version/compare.ts:27:21
   if (pre1.length === 0) return 1; // No prerelease > prerelease
   if (pre2.length === 0) return -1; // prerelease < no prerelease
 
-  const maxLength = Math.max(pre1.length, pre2.length);
+  const maxLength = Math.min(pre1.length, pre2.length);
 
   for (let i = 0; i < maxLength; i++) {
killedBy: compare prerelease comparison should handle SemVer spec example ordering
statusReason: expected +0 to be -1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:29:19
 
   const maxLength = Math.max(pre1.length, pre2.length);
 
-  for (let i = 0; i < maxLength; i++) {
+  for (let i = 0; i <= maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:29:19
 
   const maxLength = Math.max(pre1.length, pre2.length);
 
-  for (let i = 0; i < maxLength; i++) {
+  for (let i = 0; false; i++) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:31:9
 
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
-    if (i >= pre1.length) return -1;
+    if (true) return -1;
     if (i >= pre2.length) return 1;
 
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected -1 to be 1 // Object.is equality

[Killed] UnaryOperator
helpers/version/compare.ts:31:34
 
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
-    if (i >= pre1.length) return -1;
+    if (i >= pre1.length) return +1;
     if (i >= pre2.length) return 1;
 
killedBy: compare prerelease comparison should handle SemVer spec example ordering
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:32:9
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;
-    if (i >= pre2.length) return 1;
+    if (false) return 1;
 
     const id1 = pre1[i];
killedBy: compare prerelease comparison should handle SemVer spec example ordering
statusReason: expected -1 to be 1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:32:9
   for (let i = 0; i < maxLength; i++) {
     // A larger set has higher precedence if all preceding are equal
     if (i >= pre1.length) return -1;
-    if (i >= pre2.length) return 1;
+    if (i > pre2.length) return 1;
 
     const id1 = pre1[i];
killedBy: compare prerelease comparison should handle SemVer spec example ordering
statusReason: expected -1 to be 1 // Object.is equality

[Killed] Regex
helpers/version/compare.ts:37:20
     const id1 = pre1[i];
     const id2 = pre2[i];
 
-    const isNum1 = /^\d+$/.test(id1);
+    const isNum1 = /^\d$/.test(id1);
     const isNum2 = /^\d+$/.test(id2);
 
killedBy: compare edge cases should handle complex prerelease identifiers
statusReason: expected 1 to be -1 // Object.is equality

[Killed] Regex
helpers/version/compare.ts:38:20
     const id2 = pre2[i];
 
     const isNum1 = /^\d+$/.test(id1);
-    const isNum2 = /^\d+$/.test(id2);
+    const isNum2 = /^\d+/.test(id2);
 
     // Both numeric: compare as integers
killedBy: compare edge cases should treat mixed alphanumeric identifiers like '1abc' as alphanumeric, not numeric
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:41:9
     const isNum2 = /^\d+$/.test(id2);
 
     // Both numeric: compare as integers
-    if (isNum1 && isNum2) {
+    if (false) {
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
killedBy: compare prerelease comparison should compare numeric prerelease identifiers numerically
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:41:9
     const isNum2 = /^\d+$/.test(id2);
 
     // Both numeric: compare as integers
-    if (isNum1 && isNum2) {
+    if (true) {
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:44:11
     if (isNum1 && isNum2) {
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
-      if (num1 < num2) return -1;
+      if (false) return -1;
       if (num1 > num2) return 1;
       // num1 === num2, continue to next identifier
killedBy: compare prerelease comparison should compare numeric prerelease identifiers numerically
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:44:11
     if (isNum1 && isNum2) {
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
-      if (num1 < num2) return -1;
+      if (true) return -1;
       if (num1 > num2) return 1;
       // num1 === num2, continue to next identifier
killedBy: compare prerelease comparison should compare numeric prerelease identifiers numerically
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:45:11
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
       if (num1 < num2) return -1;
-      if (num1 > num2) return 1;
+      if (false) return 1;
       // num1 === num2, continue to next identifier
     }
killedBy: compare prerelease comparison should compare numeric prerelease identifiers numerically
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:45:11
       const num1 = parseInt(id1, 10);
       const num2 = parseInt(id2, 10);
       if (num1 < num2) return -1;
-      if (num1 > num2) return 1;
+      if (num1 <= num2) return 1;
       // num1 === num2, continue to next identifier
     }
killedBy: compare prerelease comparison should compare numeric prerelease identifiers numerically
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:49:14
       // num1 === num2, continue to next identifier
     }
     // Numeric has lower precedence than alphanumeric
-    else if (isNum1) {
+    else if (true) {
       return -1;
     } else if (isNum2) {
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
helpers/version/compare.ts:49:22
       // num1 === num2, continue to next identifier
     }
     // Numeric has lower precedence than alphanumeric
-    else if (isNum1) {
-      return -1;
-    } else if (isNum2) {
+    else if (isNum1) {} else if (isNum2) {
       return 1;
     }
killedBy: compare prerelease comparison should consider numeric identifiers lower than alphanumeric
statusReason: expected +0 to be -1 // Object.is equality

[Killed] UnaryOperator
helpers/version/compare.ts:50:14
     }
     // Numeric has lower precedence than alphanumeric
     else if (isNum1) {
-      return -1;
+      return +1;
     } else if (isNum2) {
       return 1;
killedBy: compare prerelease comparison should consider numeric identifiers lower than alphanumeric
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
helpers/version/compare.ts:51:24
     // Numeric has lower precedence than alphanumeric
     else if (isNum1) {
       return -1;
-    } else if (isNum2) {
-      return 1;
-    }
+    } else if (isNum2) {}
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
killedBy: compare prerelease comparison should consider numeric identifiers lower than alphanumeric
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:51:16
     // Numeric has lower precedence than alphanumeric
     else if (isNum1) {
       return -1;
-    } else if (isNum2) {
+    } else if (true) {
       return 1;
     }
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
helpers/version/compare.ts:55:10
       return 1;
     }
     // Both alphanumeric: compare lexically (ASCII sort)
-    else {
-      if (id1 < id2) return -1;
-      if (id1 > id2) return 1;
-      // id1 === id2, continue to next identifier
-    }
+    else {}
   }
 
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected +0 to be -1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:56:11
     }
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
-      if (id1 < id2) return -1;
+      if (id1 >= id2) return -1;
       if (id1 > id2) return 1;
       // id1 === id2, continue to next identifier
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected +0 to be -1 // Object.is equality

[Killed] UnaryOperator
helpers/version/compare.ts:56:29
     }
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
-      if (id1 < id2) return -1;
+      if (id1 < id2) return +1;
       if (id1 > id2) return 1;
       // id1 === id2, continue to next identifier
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected 1 to be -1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:57:11
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
       if (id1 < id2) return -1;
-      if (id1 > id2) return 1;
+      if (id1 <= id2) return 1;
       // id1 === id2, continue to next identifier
     }
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:57:11
     // Both alphanumeric: compare lexically (ASCII sort)
     else {
       if (id1 < id2) return -1;
-      if (id1 > id2) return 1;
+      if (id1 >= id2) return 1;
       // id1 === id2, continue to next identifier
     }
killedBy: compare prerelease comparison should compare prerelease identifiers alphabetically
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
helpers/version/compare.ts:85:69
  * compare('1.0.0+build1', '1.0.0+build2') // 0 (build metadata ignored)
  * @since 1.9.0
  */
-export function compare(version1: string, version2: string): number {
-  const v1 = parse(version1);
-  const v2 = parse(version2);
-
-  // Compare major, minor, patch
-  if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
-  if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
-  if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
-
-  // Compare prerelease (build metadata is ignored per SemVer spec)
-  return comparePrerelease(v1.prerelease, v2.prerelease);
-}
+export function compare(version1: string, version2: string): number {}
 
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
helpers/version/compare.ts:90:7
   const v2 = parse(version2);
 
   // Compare major, minor, patch
-  if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
+  if (v1.major === v2.major) return v1.major < v2.major ? -1 : 1;
   if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
   if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:90:7
   const v2 = parse(version2);
 
   // Compare major, minor, patch
-  if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
+  if (true) return v1.major < v2.major ? -1 : 1;
   if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
   if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:91:7
 
   // Compare major, minor, patch
   if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
-  if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
+  if (false) return v1.minor < v2.minor ? -1 : 1;
   if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
 
killedBy: compare core version comparison should return -1 when first version is lower
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:91:7
 
   // Compare major, minor, patch
   if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
-  if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
+  if (true) return v1.minor < v2.minor ? -1 : 1;
   if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
 
killedBy: compare core version comparison should return 0 for equal versions
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
helpers/version/compare.ts:92:7
   // Compare major, minor, patch
   if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
   if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
-  if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
+  if (true) return v1.patch < v2.patch ? -1 : 1;
 
   // Compare prerelease (build metadata is ignored per SemVer spec)
killedBy: compare — property-based reflexive: compare(v, v) === 0
statusReason: Property failed after 1 tests
{ seed: 630008829, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/version/compare.ts:92:37
   // Compare major, minor, patch
   if (v1.major !== v2.major) return v1.major < v2.major ? -1 : 1;
   if (v1.minor !== v2.minor) return v1.minor < v2.minor ? -1 : 1;
-  if (v1.patch !== v2.patch) return v1.patch < v2.patch ? -1 : 1;
+  if (v1.patch !== v2.patch) return v1.patch >= v2.patch ? -1 : 1;
 
   // Compare prerelease (build metadata is ignored per SemVer spec)
killedBy: compare — contract "1.0.0" vs "1.0.1" → -1 (patch)
statusReason: expected 1 to be -1 // Object.is equality
