[Killed] ConditionalExpression
helpers/version/increment.ts:21:7
   version: string | undefined | null,
   type: 'major' | 'minor' | 'patch'
 ): string | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (true) return version;
   const hasV = version.startsWith('v');
   const normalizedVersion = version.replace(/^v/, '');
killedBy: increment should increment patch version
statusReason: expected '1.2.3' to be '1.2.4' // Object.is equality

[Killed] EqualityOperator
helpers/version/increment.ts:21:7
   version: string | undefined | null,
   type: 'major' | 'minor' | 'patch'
 ): string | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (version !== undefined || version === null) return version;
   const hasV = version.startsWith('v');
   const normalizedVersion = version.replace(/^v/, '');
killedBy: increment should increment patch version
statusReason: expected '1.2.3' to be '1.2.4' // Object.is equality

[Killed] MethodExpression
helpers/version/increment.ts:22:16
   type: 'major' | 'minor' | 'patch'
 ): string | undefined | null {
   if (version === undefined || version === null) return version;
-  const hasV = version.startsWith('v');
+  const hasV = version.endsWith('v');
   const normalizedVersion = version.replace(/^v/, '');
 
killedBy: increment should increment patch version
statusReason: expected '1.2.4' to be 'v1.2.4' // Object.is equality

[Survived] Regex
helpers/version/increment.ts:23:45
 ): string | undefined | null {
   if (version === undefined || version === null) return version;
   const hasV = version.startsWith('v');
-  const normalizedVersion = version.replace(/^v/, '');
+  const normalizedVersion = version.replace(/v/, '');
 
   const parts = normalizedVersion.split('.').map(Number);

[Killed] ConditionalExpression
helpers/version/increment.ts:28:10
   const parts = normalizedVersion.split('.').map(Number);
 
   // Ensure we have at least major.minor.patch
-  while (parts.length < 3) {
+  while (false) {
     parts.push(0);
   }
killedBy: increment — contract "1" + "minor" → "1.1.0" (handles partial version)
statusReason: expected '1.NaN.0' to be '1.1.0' // Object.is equality

[Timeout] BlockStatement
helpers/version/increment.ts:28:28
   const parts = normalizedVersion.split('.').map(Number);
 
   // Ensure we have at least major.minor.patch
-  while (parts.length < 3) {
-    parts.push(0);
-  }
+  while (parts.length < 3) {}
 
   let [major, minor, patch] = parts;

[Killed] ConditionalExpression
helpers/version/increment.ts:35:5
   let [major, minor, patch] = parts;
 
   switch (type) {
-    case 'major':
-      major++;
-      minor = 0;
-      patch = 0;
-      break;
+    case 'major':
     case 'minor':
       minor++;
killedBy: increment — property-based incrementing major resets minor and patch to 0
statusReason: Property failed after 1 tests
{ seed: -1155689411, path: "0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UpdateOperator
helpers/version/increment.ts:36:7
 
   switch (type) {
     case 'major':
-      major++;
+      major--;
       minor = 0;
       patch = 0;
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 8 tests
{ seed: -688283869, path: "7:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","major"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/increment.ts:40:5
       minor = 0;
       patch = 0;
       break;
-    case 'minor':
-      minor++;
-      patch = 0;
-      break;
+    case 'minor':
     case 'patch':
       patch++;
killedBy: increment should increment minor version and reset patch
statusReason: expected '1.2.4' to be '1.3.0' // Object.is equality

[Killed] StringLiteral
helpers/version/increment.ts:40:10
       minor = 0;
       patch = 0;
       break;
-    case 'minor':
+    case "":
       minor++;
       patch = 0;
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 6 tests
{ seed: 2069648103, path: "5:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","minor"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UpdateOperator
helpers/version/increment.ts:41:7
       patch = 0;
       break;
     case 'minor':
-      minor++;
+      minor--;
       patch = 0;
       break;
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 5 tests
{ seed: 237462279, path: "4:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","minor"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/increment.ts:44:5
       minor++;
       patch = 0;
       break;
-    case 'patch':
-      patch++;
-      break;
+    case 'patch':
     default:
       throw new Error(`Invalid increment type: ${type}`);
killedBy: increment should increment patch version
statusReason: Invalid increment type: patch

[Killed] UpdateOperator
helpers/version/increment.ts:45:7
       patch = 0;
       break;
     case 'patch':
-      patch++;
+      patch--;
       break;
     default:
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 2 tests
{ seed: -1857176863, path: "1:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","patch"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/increment.ts:47:5
     case 'patch':
       patch++;
       break;
-    default:
-      throw new Error(`Invalid increment type: ${type}`);
+    default:
   }
 
killedBy: increment should throw for invalid increment type
statusReason: expected [Function] to throw an error
