[Killed] BlockStatement
helpers/version/isPrerelease.ts:36:110
 export function isPrerelease(version: ParsedVersion): boolean;
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
-export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
-  if (typeof version === 'string') return version.split('+')[0].includes('-');
-  return version.prerelease.length > 0;
-}
+export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {}
 
killedBy: isPrerelease — property-based (string) stable versions always return false
statusReason: Property failed after 1 tests
{ seed: -2029567529, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/isPrerelease.ts:37:7
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false) return version;
   if (typeof version === 'string') return version.split('+')[0].includes('-');
   return version.prerelease.length > 0;
killedBy: isPrerelease — contract undefined → undefined
statusReason: Cannot read properties of undefined (reading 'prerelease')

[Killed] ConditionalExpression
helpers/version/isPrerelease.ts:37:7
 export function isPrerelease(version: undefined): undefined;
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false || version === null) return version;
   if (typeof version === 'string') return version.split('+')[0].includes('-');
   return version.prerelease.length > 0;
killedBy: isPrerelease — contract undefined → undefined
statusReason: Cannot read properties of undefined (reading 'prerelease')

[Killed] ConditionalExpression
helpers/version/isPrerelease.ts:38:7
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
   if (version === undefined || version === null) return version;
-  if (typeof version === 'string') return version.split('+')[0].includes('-');
+  if (false) return version.split('+')[0].includes('-');
   return version.prerelease.length > 0;
 }
killedBy: isPrerelease — property-based (string) stable versions always return false
statusReason: Property failed after 1 tests
{ seed: 1889395593, path: "0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/isPrerelease.ts:38:7
 export function isPrerelease(version: null): null;
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
   if (version === undefined || version === null) return version;
-  if (typeof version === 'string') return version.split('+')[0].includes('-');
+  if (true) return version.split('+')[0].includes('-');
   return version.prerelease.length > 0;
 }
killedBy: isPrerelease — property-based (ParsedVersion) string and ParsedVersion forms always agree
statusReason: Property failed after 1 tests
{ seed: -156424115, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/isPrerelease.ts:39:10
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
   if (version === undefined || version === null) return version;
   if (typeof version === 'string') return version.split('+')[0].includes('-');
-  return version.prerelease.length > 0;
+  return true;
 }
 
killedBy: isPrerelease — property-based (ParsedVersion) string and ParsedVersion forms always agree
statusReason: Property failed after 1 tests
{ seed: 1121880399, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/version/isPrerelease.ts:39:10
 export function isPrerelease(version: string | ParsedVersion | undefined | null): boolean | undefined | null {
   if (version === undefined || version === null) return version;
   if (typeof version === 'string') return version.split('+')[0].includes('-');
-  return version.prerelease.length > 0;
+  return version.prerelease.length >= 0;
 }
 
killedBy: isPrerelease — property-based (ParsedVersion) string and ParsedVersion forms always agree
statusReason: Property failed after 1 tests
{ seed: -2008438467, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
