[Killed] BlockStatement
helpers/version/parse.ts:45:93
 export function parse(version: string): ParsedVersion;
 export function parse(version: undefined): undefined;
 export function parse(version: null): null;
-export function parse(version: string | undefined | null): ParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
-  // Remove optional 'v' prefix
-  const normalized = version.replace(/^v/, '');
-
-  // Split build metadata first (everything after +)
-  const [versionWithPrerelease, buildString] = normalized.split('+');
-  const build = buildString ? buildString.split('.') : [];
-
-  // Split prerelease (everything after -)
-  const [coreVersion, prereleaseString] = versionWithPrerelease.split('-');
-  const prerelease = prereleaseString ? prereleaseString.split('.') : [];
-
-  // Parse core version
-  const parts = coreVersion.split('.').map(Number);
-
-  return {
-    major: parts[0] || 0,
-    minor: parts[1] || 0,
-    patch: parts[2] || 0,
-    prerelease,
-    build,
-  };
-}
+export function parse(version: string | undefined | null): ParsedVersion | undefined | null {}
 
killedBy: parse core version parsing should parse basic version
statusReason: expected undefined to deeply equal { major: 1, minor: 2, patch: 3, …(2) }

[Killed] EqualityOperator
helpers/version/parse.ts:46:7
 export function parse(version: undefined): undefined;
 export function parse(version: null): null;
 export function parse(version: string | undefined | null): ParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (version !== undefined || version === null) return version;
   // Remove optional 'v' prefix
   const normalized = version.replace(/^v/, '');
killedBy: parse — property-based major, minor, patch are non-negative integers
statusReason: Property failed after 1 tests
{ seed: 981007109, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/parse.ts:46:7
 export function parse(version: undefined): undefined;
 export function parse(version: null): null;
 export function parse(version: string | undefined | null): ParsedVersion | undefined | null {
-  if (version === undefined || version === null) return version;
+  if (false) return version;
   // Remove optional 'v' prefix
   const normalized = version.replace(/^v/, '');
killedBy: parse should return null when given null
statusReason: Cannot read properties of null (reading 'replace')

[Killed] StringLiteral
helpers/version/parse.ts:48:44
 export function parse(version: string | undefined | null): ParsedVersion | undefined | null {
   if (version === undefined || version === null) return version;
   // Remove optional 'v' prefix
-  const normalized = version.replace(/^v/, '');
+  const normalized = version.replace(/^v/, "Stryker was here!");
 
   // Split build metadata first (everything after +)
killedBy: parse — property-based v-prefixed version parses the same major/minor/patch as without prefix
statusReason: Property failed after 1 tests
{ seed: -574920137, path: "0:1:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: ["1.0.0"]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] Regex
helpers/version/parse.ts:48:38
 export function parse(version: string | undefined | null): ParsedVersion | undefined | null {
   if (version === undefined || version === null) return version;
   // Remove optional 'v' prefix
-  const normalized = version.replace(/^v/, '');
+  const normalized = version.replace(/v/, '');
 
   // Split build metadata first (everything after +)

[Killed] StringLiteral
helpers/version/parse.ts:55:71
   const build = buildString ? buildString.split('.') : [];
 
   // Split prerelease (everything after -)
-  const [coreVersion, prereleaseString] = versionWithPrerelease.split('-');
+  const [coreVersion, prereleaseString] = versionWithPrerelease.split("");
   const prerelease = prereleaseString ? prereleaseString.split('.') : [];
 
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 1 tests
{ seed: 1530254394, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","minor"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
helpers/version/parse.ts:56:64
 
   // Split prerelease (everything after -)
   const [coreVersion, prereleaseString] = versionWithPrerelease.split('-');
-  const prerelease = prereleaseString ? prereleaseString.split('.') : [];
+  const prerelease = prereleaseString ? prereleaseString.split("") : [];
 
   // Parse core version
killedBy: parse — contract "1.0.0-alpha.1" → prerelease: ["alpha", "1"]
statusReason: expected [ 'a', 'l', 'p', 'h', 'a', '.', '1' ] to deeply equal [ 'alpha', '1' ]

[Killed] ArrayDeclaration
helpers/version/parse.ts:56:71
 
   // Split prerelease (everything after -)
   const [coreVersion, prereleaseString] = versionWithPrerelease.split('-');
-  const prerelease = prereleaseString ? prereleaseString.split('.') : [];
+  const prerelease = prereleaseString ? prereleaseString.split('.') : ["Stryker was here"];
 
   // Parse core version
killedBy: parse core version parsing should parse basic version
statusReason: expected { major: 1, minor: 2, patch: 3, …(2) } to deeply equal { major: 1, minor: 2, patch: 3, …(2) }

[Killed] LogicalOperator
helpers/version/parse.ts:62:12
   const parts = coreVersion.split('.').map(Number);
 
   return {
-    major: parts[0] || 0,
+    major: parts[0] && 0,
     minor: parts[1] || 0,
     patch: parts[2] || 0,
killedBy: parse core version parsing should parse basic version
statusReason: expected { major: +0, minor: 2, patch: 3, …(2) } to deeply equal { major: 1, minor: 2, patch: 3, …(2) }

[Killed] ConditionalExpression
helpers/version/parse.ts:62:12
   const parts = coreVersion.split('.').map(Number);
 
   return {
-    major: parts[0] || 0,
+    major: false,
     minor: parts[1] || 0,
     patch: parts[2] || 0,
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 1 tests
{ seed: 1963476460, path: "0:0", endOnFailure: true }
Counterexample: ["0.0.0","major"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/parse.ts:63:12
 
   return {
     major: parts[0] || 0,
-    minor: parts[1] || 0,
+    minor: false,
     patch: parts[2] || 0,
     prerelease,
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 3 tests
{ seed: -600574523, path: "2:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0","minor"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/parse.ts:63:12
 
   return {
     major: parts[0] || 0,
-    minor: parts[1] || 0,
+    minor: true,
     patch: parts[2] || 0,
     prerelease,
killedBy: parse core version parsing should parse basic version
statusReason: expected { major: 1, minor: true, …(3) } to deeply equal { major: 1, minor: 2, patch: 3, …(2) }

[Killed] ConditionalExpression
helpers/version/parse.ts:64:12
   return {
     major: parts[0] || 0,
     minor: parts[1] || 0,
-    patch: parts[2] || 0,
+    patch: false,
     prerelease,
     build,
killedBy: increment — property-based incremented version is always greater than original
statusReason: Property failed after 1 tests
{ seed: -520864830, path: "0:0", endOnFailure: true }
Counterexample: ["0.0.0","patch"]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/version/parse.ts:64:12
   return {
     major: parts[0] || 0,
     minor: parts[1] || 0,
-    patch: parts[2] || 0,
+    patch: parts[2] && 0,
     prerelease,
     build,
killedBy: parse core version parsing should parse basic version
statusReason: expected { major: 1, minor: 2, patch: +0, …(2) } to deeply equal { major: 1, minor: 2, patch: 3, …(2) }
