[Survived] Regex
helpers/version/satisfiesRange.ts:15:45
  * @since 1.9.0
  */
 export function satisfiesRange(version: string, range: string): boolean {
-  const normalizedVersion = version.replace(/^v/, '');
+  const normalizedVersion = version.replace(/v/, '');
 
   // Handle exact match

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:18:7
   const normalizedVersion = version.replace(/^v/, '');
 
   // Handle exact match
-  if (!range.match(/[~^<>=]/)) {
+  if (true) {
     return normalizedVersion === range.replace(/^v/, '');
   }
killedBy: satisfiesRange should handle >= operator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:18:7
   const normalizedVersion = version.replace(/^v/, '');
 
   // Handle exact match
-  if (!range.match(/[~^<>=]/)) {
+  if (false) {
     return normalizedVersion === range.replace(/^v/, '');
   }
killedBy: satisfiesRange should handle exact matches
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:19:12
 
   // Handle exact match
   if (!range.match(/[~^<>=]/)) {
-    return normalizedVersion === range.replace(/^v/, '');
+    return normalizedVersion !== range.replace(/^v/, '');
   }
 
killedBy: satisfiesRange should handle exact matches
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:19:12
 
   // Handle exact match
   if (!range.match(/[~^<>=]/)) {
-    return normalizedVersion === range.replace(/^v/, '');
+    return false;
   }
 
killedBy: satisfiesRange should handle exact matches
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:23:31
   }
 
   // Handle >= operator
-  if (range.startsWith('>=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
-  }
+  if (range.startsWith('>=')) {}
 
   // Handle > operator
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">=X.Y.Z") is true then compare(v, X.Y.Z) >= 0
statusReason: Property failed after 2 tests
{ seed: 1019755518, path: "1:0:3:4:3:3:4:1:0:2", endOnFailure: true }
Counterexample: ["0.1.0","1.0.0"]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:23:7
   }
 
   // Handle >= operator
-  if (range.startsWith('>=')) {
+  if (range.endsWith('>=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
killedBy: satisfiesRange should handle >= operator
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:24:27
 
   // Handle >= operator
   if (range.startsWith('>=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }
killedBy: satisfiesRange should handle >= operator
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:24:56
 
   // Handle >= operator
   if (range.startsWith('>=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
+    const targetVersion = range.slice(2).replace(/^v/, "Stryker was here!");
     return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:25:12
   // Handle >= operator
   if (range.startsWith('>=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return false;
   }
 
killedBy: satisfiesRange should handle >= operator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:25:12
   // Handle >= operator
   if (range.startsWith('>=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return true;
   }
 
killedBy: satisfiesRange should handle >= operator
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:29:7
   }
 
   // Handle > operator
-  if (range.startsWith('>')) {
+  if (false) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) > 0;
killedBy: satisfiesRange should handle > operator
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:29:30
   }
 
   // Handle > operator
-  if (range.startsWith('>')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) > 0;
-  }
+  if (range.startsWith('>')) {}
 
   // Handle <= operator
killedBy: satisfiesRange — contract "2.0.0" satisfies ">1.0.0"
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:30:27
 
   // Handle > operator
   if (range.startsWith('>')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) > 0;
   }
killedBy: satisfiesRange should handle > operator
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:31:12
   // Handle > operator
   if (range.startsWith('>')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) > 0;
+    return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
   }
 
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">1.0.0") is true then compare(v, "1.0.0") > 0
statusReason: Property failed after 2 tests
{ seed: 1502350181, path: "1:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:31:12
   // Handle > operator
   if (range.startsWith('>')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) > 0;
+    return true;
   }
 
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">1.0.0") is true then compare(v, "1.0.0") > 0
statusReason: Property failed after 6 tests
{ seed: -177283104, path: "5:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:35:31
   }
 
   // Handle <= operator
-  if (range.startsWith('<=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
-  }
+  if (range.startsWith('<=')) {}
 
   // Handle < operator
killedBy: satisfiesRange — contract "1.0.0" satisfies "<=1.0.0"
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:35:7
   }
 
   // Handle <= operator
-  if (range.startsWith('<=')) {
+  if (range.endsWith('<=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
killedBy: satisfiesRange should handle <= operator
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:36:27
 
   // Handle <= operator
   if (range.startsWith('<=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
   }
killedBy: satisfiesRange — contract "1.0.0" satisfies "<=1.0.0"
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:36:56
 
   // Handle <= operator
   if (range.startsWith('<=')) {
-    const targetVersion = range.slice(2).replace(/^v/, '');
+    const targetVersion = range.slice(2).replace(/^v/, "Stryker was here!");
     return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
   }

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:37:12
   // Handle <= operator
   if (range.startsWith('<=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
+    return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
   }
 
killedBy: satisfiesRange — contract "1.0.0" satisfies "<=1.0.0"
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:37:12
   // Handle <= operator
   if (range.startsWith('<=')) {
     const targetVersion = range.slice(2).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
+    return false;
   }
 
killedBy: satisfiesRange — contract "1.0.0" satisfies "<=1.0.0"
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:41:7
   }
 
   // Handle < operator
-  if (range.startsWith('<')) {
+  if (false) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
killedBy: satisfiesRange should handle < operator
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:41:30
   }
 
   // Handle < operator
-  if (range.startsWith('<')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
-  }
+  if (range.startsWith('<')) {}
 
   // Handle caret range (^1.2.3 allows patch and minor updates)
killedBy: satisfiesRange should handle < operator
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:42:27
 
   // Handle < operator
   if (range.startsWith('<')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
   }
killedBy: satisfiesRange should handle < operator
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:42:56
 
   // Handle < operator
   if (range.startsWith('<')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.slice(1).replace(/^v/, "Stryker was here!");
     return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
   }

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:43:12
   // Handle < operator
   if (range.startsWith('<')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
+    return compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }
 
killedBy: satisfiesRange should handle < operator
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:43:12
   // Handle < operator
   if (range.startsWith('<')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    return compareVersionsSimple(normalizedVersion, targetVersion) < 0;
+    return compareVersionsSimple(normalizedVersion, targetVersion) <= 0;
   }
 
killedBy: satisfiesRange should handle < operator
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:47:30
   }
 
   // Handle caret range (^1.2.3 allows patch and minor updates)
-  if (range.startsWith('^')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
-    const [targetMajor] = targetVersion.split('.').map(Number);
-    const [versionMajor] = normalizedVersion.split('.').map(Number);
-
-    return versionMajor === targetMajor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
-  }
+  if (range.startsWith('^')) {}
 
   // Handle tilde range (~1.2.3 allows patch updates)
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:47:7
   }
 
   // Handle caret range (^1.2.3 allows patch and minor updates)
-  if (range.startsWith('^')) {
+  if (range.endsWith('^')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:48:27
 
   // Handle caret range (^1.2.3 allows patch and minor updates)
   if (range.startsWith('^')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:49:47
   // Handle caret range (^1.2.3 allows patch and minor updates)
   if (range.startsWith('^')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
-    const [targetMajor] = targetVersion.split('.').map(Number);
+    const [targetMajor] = targetVersion.split("").map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
 

[Survived] StringLiteral
helpers/version/satisfiesRange.ts:50:52
   if (range.startsWith('^')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor] = targetVersion.split('.').map(Number);
-    const [versionMajor] = normalizedVersion.split('.').map(Number);
+    const [versionMajor] = normalizedVersion.split("").map(Number);
 
     return versionMajor === targetMajor &&

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:52:12
     const [targetMajor] = targetVersion.split('.').map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
 
-    return versionMajor === targetMajor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return false;
   }
 
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:52:12
     const [targetMajor] = targetVersion.split('.').map(Number);
     const [versionMajor] = normalizedVersion.split('.').map(Number);
 
-    return versionMajor === targetMajor &&
+    return versionMajor !== targetMajor &&
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   }
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:53:7
     const [versionMajor] = normalizedVersion.split('.').map(Number);
 
     return versionMajor === targetMajor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+      compareVersionsSimple(normalizedVersion, targetVersion) > 0;
   }
 
killedBy: satisfiesRange should handle caret ranges
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:53:7
     const [versionMajor] = normalizedVersion.split('.').map(Number);
 
     return versionMajor === targetMajor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+      true;
   }
 
killedBy: satisfiesRange should correctly extract version from caret range string
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:57:7
   }
 
   // Handle tilde range (~1.2.3 allows patch updates)
-  if (range.startsWith('~')) {
+  if (false) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:57:7
   }
 
   // Handle tilde range (~1.2.3 allows patch updates)
-  if (range.startsWith('~')) {
+  if (range.endsWith('~')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:58:27
 
   // Handle tilde range (~1.2.3 allows patch updates)
   if (range.startsWith('~')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Survived] Regex
helpers/version/satisfiesRange.ts:58:50
 
   // Handle tilde range (~1.2.3 allows patch updates)
   if (range.startsWith('~')) {
-    const targetVersion = range.slice(1).replace(/^v/, '');
+    const targetVersion = range.slice(1).replace(/v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);

[Killed] StringLiteral
helpers/version/satisfiesRange.ts:60:66
   if (range.startsWith('~')) {
     const targetVersion = range.slice(1).replace(/^v/, '');
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
-    const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
+    const [versionMajor, versionMinor] = normalizedVersion.split("").map(Number);
 
     return versionMajor === targetMajor &&
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:62:12
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
 
-    return versionMajor === targetMajor &&
-      versionMinor === targetMinor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+    return false;
   } else {
     // Unsupported range format
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
helpers/version/satisfiesRange.ts:62:12
     const [targetMajor, targetMinor] = targetVersion.split('.').map(Number);
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
 
-    return versionMajor === targetMajor &&
-      versionMinor === targetMinor &&
+    return versionMajor === targetMajor || versionMinor === targetMinor &&
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   } else {
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:63:7
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
 
     return versionMajor === targetMajor &&
-      versionMinor === targetMinor &&
+      true &&
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   } else {
killedBy: satisfiesRange — contract "1.6.0" does not satisfy "~1.5.0" (minor changed)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:63:7
     const [versionMajor, versionMinor] = normalizedVersion.split('.').map(Number);
 
     return versionMajor === targetMajor &&
-      versionMinor === targetMinor &&
+      versionMinor !== targetMinor &&
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   } else {
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:64:7
 
     return versionMajor === targetMajor &&
       versionMinor === targetMinor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+      true;
   } else {
     // Unsupported range format
killedBy: satisfiesRange should correctly extract version from tilde range string
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:64:7
 
     return versionMajor === targetMajor &&
       versionMinor === targetMinor &&
-      compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
+      compareVersionsSimple(normalizedVersion, targetVersion) > 0;
   } else {
     // Unsupported range format
killedBy: satisfiesRange should handle tilde ranges
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:65:10
     return versionMajor === targetMajor &&
       versionMinor === targetMinor &&
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
-  } else {
-    // Unsupported range format
-    return false;
-  }
+  } else {}
 }
 
killedBy: satisfiesRange should handle invalid range formats
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
helpers/version/satisfiesRange.ts:67:12
       compareVersionsSimple(normalizedVersion, targetVersion) >= 0;
   } else {
     // Unsupported range format
-    return false;
+    return true;
   }
 }
killedBy: satisfiesRange should handle invalid range formats
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
helpers/version/satisfiesRange.ts:71:76
   }
 }
 
-function compareVersionsSimple(version1: string, version2: string): number {
-  const parts1 = version1.split('.').map(Number);
-  const parts2 = version2.split('.').map(Number);
-
-  const maxLength = Math.max(parts1.length, parts2.length);
-
-  for (let i = 0; i < maxLength; i++) {
-    const part1 = parts1[i] || 0;
-    const part2 = parts2[i] || 0;
-
-    if (part1 < part2) return -1;
-    if (part1 > part2) return 1;
-  }
-
-  return 0;
-}
+function compareVersionsSimple(version1: string, version2: string): number {}
 
killedBy: satisfiesRange should handle >= operator
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
helpers/version/satisfiesRange.ts:75:21
   const parts1 = version1.split('.').map(Number);
   const parts2 = version2.split('.').map(Number);
 
-  const maxLength = Math.max(parts1.length, parts2.length);
+  const maxLength = Math.min(parts1.length, parts2.length);
 
   for (let i = 0; i < maxLength; i++) {
killedBy: satisfiesRange should compare versions with different lengths correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:77:19
 
   const maxLength = Math.max(parts1.length, parts2.length);
 
-  for (let i = 0; i < maxLength; i++) {
+  for (let i = 0; i >= maxLength; i++) {
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">=X.Y.Z") is true then compare(v, X.Y.Z) >= 0
statusReason: Property failed after 1 tests
{ seed: -877832615, path: "0:0:0:0:0:0:1", endOnFailure: true }
Counterexample: ["0.0.0","0.0.1"]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/version/satisfiesRange.ts:78:19
   const maxLength = Math.max(parts1.length, parts2.length);
 
   for (let i = 0; i < maxLength; i++) {
-    const part1 = parts1[i] || 0;
+    const part1 = parts1[i] && 0;
     const part2 = parts2[i] || 0;
 
killedBy: satisfiesRange should handle >= operator
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:78:19
   const maxLength = Math.max(parts1.length, parts2.length);
 
   for (let i = 0; i < maxLength; i++) {
-    const part1 = parts1[i] || 0;
+    const part1 = true;
     const part2 = parts2[i] || 0;
 
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">1.0.0") is true then compare(v, "1.0.0") > 0
statusReason: Property failed after 4 tests
{ seed: 1928925352, path: "3:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/version/satisfiesRange.ts:79:19
 
   for (let i = 0; i < maxLength; i++) {
     const part1 = parts1[i] || 0;
-    const part2 = parts2[i] || 0;
+    const part2 = parts2[i] && 0;
 
     if (part1 < part2) return -1;
killedBy: satisfiesRange should handle >= operator
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
helpers/version/satisfiesRange.ts:79:19
 
   for (let i = 0; i < maxLength; i++) {
     const part1 = parts1[i] || 0;
-    const part2 = parts2[i] || 0;
+    const part2 = false;
 
     if (part1 < part2) return -1;
killedBy: satisfiesRange — property-based if satisfiesRange(v, ">1.0.0") is true then compare(v, "1.0.0") > 0
statusReason: Property failed after 5 tests
{ seed: 1699344251, path: "4:0:1:0:0", endOnFailure: true }
Counterexample: ["0.0.1"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UnaryOperator
helpers/version/satisfiesRange.ts:81:31
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
 
-    if (part1 < part2) return -1;
+    if (part1 < part2) return +1;
     if (part1 > part2) return 1;
   }
killedBy: satisfiesRange should handle >= operator
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:81:9
     const part1 = parts1[i] || 0;
     const part2 = parts2[i] || 0;
 
-    if (part1 < part2) return -1;
+    if (part1 >= part2) return -1;
     if (part1 > part2) return 1;
   }
killedBy: satisfiesRange should handle >= operator
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:82:9
     const part2 = parts2[i] || 0;
 
     if (part1 < part2) return -1;
-    if (part1 > part2) return 1;
+    if (part1 <= part2) return 1;
   }
 
killedBy: satisfiesRange should handle > operator
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
helpers/version/satisfiesRange.ts:82:9
     const part2 = parts2[i] || 0;
 
     if (part1 < part2) return -1;
-    if (part1 > part2) return 1;
+    if (part1 >= part2) return 1;
   }
 
killedBy: satisfiesRange should handle > operator
statusReason: expected true to be false // Object.is equality
