[Killed] BlockStatement
helpers/version/stringify.ts:31:96
 export function stringify(parsed: ParsedVersion): string;
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
-export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
-  const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
-  const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
-  const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
-  return `${base}${prerelease}${build}`;
-}
+export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {}
 
killedBy: stringify — property-based round-trips stable versions through parse
statusReason: Property failed after 1 tests
{ seed: -203807791, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/version/stringify.ts:32:31
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
 export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
+  if (parsed === undefined || parsed !== null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
killedBy: stringify — stable versions 1.2.3
statusReason: expected { major: 1, minor: 2, patch: 3, …(2) } to be '1.2.3' // Object.is equality

[Killed] LogicalOperator
helpers/version/stringify.ts:32:7
 export function stringify(parsed: undefined): undefined;
 export function stringify(parsed: null): null;
 export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {
-  if (parsed === undefined || parsed === null) return parsed;
+  if (parsed === undefined && parsed === null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
killedBy: stringify — null / undefined passthrough undefined → undefined
statusReason: Cannot read properties of undefined (reading 'major')

[Killed] EqualityOperator
helpers/version/stringify.ts:34:22
 export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {
   if (parsed === undefined || parsed === null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
-  const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
+  const prerelease = parsed.prerelease.length >= 0 ? `-${parsed.prerelease.join('.')}` : '';
   const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
   return `${base}${prerelease}${build}`;
killedBy: stringify — stable versions 1.2.3
statusReason: expected '1.2.3-' to be '1.2.3' // Object.is equality

[Killed] EqualityOperator
helpers/version/stringify.ts:34:22
 export function stringify(parsed: ParsedVersion | undefined | null): string | undefined | null {
   if (parsed === undefined || parsed === null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
-  const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
+  const prerelease = parsed.prerelease.length <= 0 ? `-${parsed.prerelease.join('.')}` : '';
   const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
   return `${base}${prerelease}${build}`;
killedBy: stringify — property-based round-trips stable versions through parse
statusReason: Property failed after 1 tests
{ seed: -1155968506, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
helpers/version/stringify.ts:35:17
   if (parsed === undefined || parsed === null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
-  const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
+  const build = true ? `+${parsed.build.join('.')}` : '';
   return `${base}${prerelease}${build}`;
 }
killedBy: stringify — property-based round-trips stable versions through parse
statusReason: Property failed after 1 tests
{ seed: 2057649592, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["0.0.0"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/version/stringify.ts:35:17
   if (parsed === undefined || parsed === null) return parsed;
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
-  const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
+  const build = parsed.build.length <= 0 ? `+${parsed.build.join('.')}` : '';
   return `${base}${prerelease}${build}`;
 }
killedBy: stringify — stable versions 1.2.3
statusReason: expected '1.2.3+' to be '1.2.3' // Object.is equality

[Killed] StringLiteral
helpers/version/stringify.ts:36:10
   const base = `${parsed.major}.${parsed.minor}.${parsed.patch}`;
   const prerelease = parsed.prerelease.length > 0 ? `-${parsed.prerelease.join('.')}` : '';
   const build = parsed.build.length > 0 ? `+${parsed.build.join('.')}` : '';
-  return `${base}${prerelease}${build}`;
+  return ``;
 }
 
killedBy: stringify — stable versions 1.2.3
statusReason: expected '' to be '1.2.3' // Object.is equality
