[Killed] BlockStatement
helpers/version/stripV.ts:28:87
 export function stripV(version: string): string;
 export function stripV(version: null): null;
 export function stripV(version: undefined): undefined;
-export function stripV(version: string | null | undefined): string | null | undefined {
-  return typeof version === "string" && version.startsWith("v") ? version.slice(1) : version;
-}
+export function stripV(version: string | null | undefined): string | null | undefined {}
 
killedBy: stripV — property-based if input does not start with v/V, result === input
statusReason: Property failed after 1 tests
{ seed: 1726938502, path: "0:0", endOnFailure: true }
Counterexample: [""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
helpers/version/stripV.ts:29:10
 export function stripV(version: null): null;
 export function stripV(version: undefined): undefined;
 export function stripV(version: string | null | undefined): string | null | undefined {
-  return typeof version === "string" && version.startsWith("v") ? version.slice(1) : version;
+  return typeof version === "string" || version.startsWith("v") ? version.slice(1) : version;
 }
 
killedBy: stripV — property-based strips exactly one leading lowercase "v"
statusReason: Property failed after 1 tests
{ seed: -711615265, path: "0:1:1", endOnFailure: true }
Counterexample: [" "]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
helpers/version/stripV.ts:29:10
 export function stripV(version: null): null;
 export function stripV(version: undefined): undefined;
 export function stripV(version: string | null | undefined): string | null | undefined {
-  return typeof version === "string" && version.startsWith("v") ? version.slice(1) : version;
+  return typeof version !== "string" && version.startsWith("v") ? version.slice(1) : version;
 }
 
killedBy: stripV — contract "v1.0.0" → "1.0.0"
statusReason: expected 'v1.0.0' to be '1.0.0' // Object.is equality
