[Killed] BlockStatement
helpers/commit/buildConventionalCommitRegex.ts:11:48
 
 const REGEX_SPECIAL = /[.*+?^${}()|[\]\\]/g;
 
-function escapeForRegex(value: string): string {
-  return value.replace(REGEX_SPECIAL, '\\$&');
-}
+function escapeForRegex(value: string): string {}
 
 function buildAlternation(values: readonly string[]): string {
killedBy: parseConventionalCommit with options forwards type/scope/requireScope to the regex builder
statusReason: expected null not to be null

[Killed] StringLiteral
helpers/commit/buildConventionalCommitRegex.ts:12:39
 const REGEX_SPECIAL = /[.*+?^${}()|[\]\\]/g;
 
 function escapeForRegex(value: string): string {
-  return value.replace(REGEX_SPECIAL, '\\$&');
+  return value.replace(REGEX_SPECIAL, "");
 }
 
killedBy: buildConventionalCommitRegex with restricted types escapes regex metacharacters in types
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
helpers/commit/buildConventionalCommitRegex.ts:15:62
   return value.replace(REGEX_SPECIAL, '\\$&');
 }
 
-function buildAlternation(values: readonly string[]): string {
-  return values.map(escapeForRegex).join('|');
-}
+function buildAlternation(values: readonly string[]): string {}
 
 /**
killedBy: parseConventionalCommit with options forwards type/scope/requireScope to the regex builder
statusReason: expected null not to be null

[Killed] BlockStatement
helpers/commit/buildConventionalCommitRegex.ts:40:11
  */
 export function buildConventionalCommitRegex(
   options: ConventionalCommitOptions = {},
-): RegExp {
-  const { types, scopes, requireScope = false } = options;
-
-  const typePart = types && types.length > 0
-    ? buildAlternation(types)
-    : '[A-Za-z]+';
-
-  const scopeContent = scopes && scopes.length > 0
-    ? buildAlternation(scopes)
-    : '[^\\s()]+';
-
-  const scopeGroup = requireScope
-    ? `\\((${scopeContent})\\)`
-    : `(?:\\((${scopeContent})\\))?`;
-
-  return new RegExp(`^(${typePart})${scopeGroup}(!)?: (.+)$`);
-}
+): RegExp {}
 
killedBy: parseConventionalCommit subject line parses type and description
statusReason: Cannot read properties of undefined (reading 'exec')

[Killed] BooleanLiteral
helpers/commit/buildConventionalCommitRegex.ts:41:41
 export function buildConventionalCommitRegex(
   options: ConventionalCommitOptions = {},
 ): RegExp {
-  const { types, scopes, requireScope = false } = options;
+  const { types, scopes, requireScope = true } = options;
 
   const typePart = types && types.length > 0
killedBy: parseConventionalCommit subject line parses type and description
statusReason: expected null to deeply equal { type: 'feat', scope: null, …(4) }

[Killed] ConditionalExpression
helpers/commit/buildConventionalCommitRegex.ts:43:29
 ): RegExp {
   const { types, scopes, requireScope = false } = options;
 
-  const typePart = types && types.length > 0
+  const typePart = types && true
     ? buildAlternation(types)
     : '[A-Za-z]+';
killedBy: buildConventionalCommitRegex edge cases handles empty types array as default any-letter type
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/commit/buildConventionalCommitRegex.ts:43:29
 ): RegExp {
   const { types, scopes, requireScope = false } = options;
 
-  const typePart = types && types.length > 0
+  const typePart = types && types.length >= 0
     ? buildAlternation(types)
     : '[A-Za-z]+';
killedBy: buildConventionalCommitRegex edge cases handles empty types array as default any-letter type
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
helpers/commit/buildConventionalCommitRegex.ts:45:7
 
   const typePart = types && types.length > 0
     ? buildAlternation(types)
-    : '[A-Za-z]+';
+    : "";
 
   const scopeContent = scopes && scopes.length > 0
killedBy: buildConventionalCommitRegex default options matches a simple type and description
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
helpers/commit/buildConventionalCommitRegex.ts:47:34
     ? buildAlternation(types)
     : '[A-Za-z]+';
 
-  const scopeContent = scopes && scopes.length > 0
+  const scopeContent = scopes && scopes.length >= 0
     ? buildAlternation(scopes)
     : '[^\\s()]+';
killedBy: buildConventionalCommitRegex edge cases handles empty scopes array as default any scope
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
helpers/commit/buildConventionalCommitRegex.ts:47:24
     ? buildAlternation(types)
     : '[A-Za-z]+';
 
-  const scopeContent = scopes && scopes.length > 0
+  const scopeContent = false
     ? buildAlternation(scopes)
     : '[^\\s()]+';
killedBy: buildConventionalCommitRegex with restricted scopes rejects disallowed scopes
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
helpers/commit/buildConventionalCommitRegex.ts:55:21
     ? `\\((${scopeContent})\\)`
     : `(?:\\((${scopeContent})\\))?`;
 
-  return new RegExp(`^(${typePart})${scopeGroup}(!)?: (.+)$`);
+  return new RegExp(``);
 }
 
killedBy: isConventionalCommit — property-based a leading garbage line always invalidates the message
statusReason: Property failed after 1 tests
{ seed: 41233443, path: "0:0:0:0", endOnFailure: true }
Counterexample: ["a","a"]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
